TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Sun Feb 19 22:05:30 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../demoapp/source/app_main_NoOS.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

     591                    ;******************************************************************************
     592                    ;* CONSTANT TABLE                                                             *
     593                    ;******************************************************************************
     594 00000074                   .sect   ".text:retain"
     595                            .align  4
     596 00000074 FFF7BC24  ||$C$CON1||:    .bits   -541660,32
     597                            .align  4
     598 00000078 FFF7BC5C  ||$C$CON2||:    .bits   -541604,32
     599                    ;******************************************************************************
     600                    ;* CONSTANT TABLE                                                             *
     601                    ;******************************************************************************
     602 000001e0                   .sect   ".text"
     603                            .align  4
     604 000001e0 FFFFFC88  ||$C$CON3||:    .bits   -888,32
     605                            .align  4
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   12

     606 000001e4 FFF7BC3C  ||$C$CON4||:    .bits   -541636,32
     607                            .align  4
     608 000001e8 FFF82028  ||$C$CON5||:    .bits   -516056,32
     609                            .align  4
     610 000001ec 00000000! ||$C$CON6||:    .bits   buttonISR,32
     611                            .align  4
     612 000001f0 FFFFFE30  ||$C$CON7||:    .bits   -464,32
     613                            .align  4
     614 000001f4 FFF7BC00  ||$C$CON8||:    .bits   -541696,32
     615                            .align  4
     616 000001f8 FFF7BC54  ||$C$CON9||:    .bits   -541612,32
     617                            .align  4
     618 000001fc FFF7BC5C  ||$C$CON10||:   .bits   -541604,32
     619                            .align  4
     620 00000200 FFF7BC08  ||$C$CON11||:   .bits   -541688,32
     621                            .align  4
     622 00000204 FFF7BC0C  ||$C$CON12||:   .bits   -541684,32
     623                            .align  4
     624 00000208 FFF7BC18  ||$C$CON13||:   .bits   -541672,32
     625                            .align  4
     626 0000020c FFF7BC20  ||$C$CON14||:   .bits   -541664,32
     627                            .align  4
     628 00000210 FFF7BC10  ||$C$CON15||:   .bits   -541680,32
     629                            .align  4
     630 00000214 FFF7BC34  ||$C$CON16||:   .bits   -541644,32
     631                            .align  4
     632 00000218 FFF7BC44  ||$C$CON17||:   .bits   -541628,32
     633                            .align  4
     634 0000021c FFFFFC00  ||$C$CON18||:   .bits   -1024,32
     635                    ;*****************************************************************************
     636                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     637                    ;*****************************************************************************
     638                            .global rtiInit
     639                            .global rtiStartCounter
     640                            .global rtiEnableNotification
     641                            .global ROLMinit
     642                            .global ROLMSDO
     643                            .global ROLMEDO
     644                            .global ROLMDDO
     645                    
     646                    ;******************************************************************************
     647                    ;* BUILD ATTRIBUTES                                                           *
     648                    ;******************************************************************************
     649                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     650                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     651                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     652                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     653                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     654                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     655                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     656                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     657                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
     658                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     659                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     660                    
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   13

     661                    ;******************************************************************************
     662                    ;* TYPE INFORMATION                                                           *
     663                    ;******************************************************************************
     664                    
     665                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
     666                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x20)
     667                    $C$DW$35        .dwtag  DW_TAG_member
     668                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$20)
     669                            .dwattr $C$DW$35, DW_AT_name("FRCx")
     670                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("FRCx")
     671                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     673                            .dwattr $C$DW$35, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     674                            .dwattr $C$DW$35, DW_AT_decl_line(0x4e)
     675                            .dwattr $C$DW$35, DW_AT_decl_column(0x10)
     676                    
     677                    $C$DW$36        .dwtag  DW_TAG_member
     678                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$20)
     679                            .dwattr $C$DW$36, DW_AT_name("UCx")
     680                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("UCx")
     681                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     682                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     683                            .dwattr $C$DW$36, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     684                            .dwattr $C$DW$36, DW_AT_decl_line(0x4f)
     685                            .dwattr $C$DW$36, DW_AT_decl_column(0x10)
     686                    
     687                    $C$DW$37        .dwtag  DW_TAG_member
     688                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$20)
     689                            .dwattr $C$DW$37, DW_AT_name("CPUCx")
     690                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("CPUCx")
     691                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     692                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     693                            .dwattr $C$DW$37, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     694                            .dwattr $C$DW$37, DW_AT_decl_line(0x50)
     695                            .dwattr $C$DW$37, DW_AT_decl_column(0x10)
     696                    
     697                    $C$DW$38        .dwtag  DW_TAG_member
     698                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$20)
     699                            .dwattr $C$DW$38, DW_AT_name("rsvd1")
     700                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("rsvd1")
     701                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     702                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     703                            .dwattr $C$DW$38, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     704                            .dwattr $C$DW$38, DW_AT_decl_line(0x51)
     705                            .dwattr $C$DW$38, DW_AT_decl_column(0x12)
     706                    
     707                    $C$DW$39        .dwtag  DW_TAG_member
     708                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$20)
     709                            .dwattr $C$DW$39, DW_AT_name("CAFRCx")
     710                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("CAFRCx")
     711                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     712                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     713                            .dwattr $C$DW$39, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     714                            .dwattr $C$DW$39, DW_AT_decl_line(0x52)
     715                            .dwattr $C$DW$39, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   14

     716                    
     717                    $C$DW$40        .dwtag  DW_TAG_member
     718                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$20)
     719                            .dwattr $C$DW$40, DW_AT_name("CAUCx")
     720                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("CAUCx")
     721                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     722                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     723                            .dwattr $C$DW$40, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     724                            .dwattr $C$DW$40, DW_AT_decl_line(0x53)
     725                            .dwattr $C$DW$40, DW_AT_decl_column(0x10)
     726                    
     727                    $C$DW$41        .dwtag  DW_TAG_member
     728                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$21)
     729                            .dwattr $C$DW$41, DW_AT_name("rsvd2")
     730                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("rsvd2")
     731                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     732                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     733                            .dwattr $C$DW$41, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     734                            .dwattr $C$DW$41, DW_AT_decl_line(0x54)
     735                            .dwattr $C$DW$41, DW_AT_decl_column(0x12)
     736                    
     737                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
     738                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x4d)
     739                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x05)
     740                            .dwendtag $C$DW$T$22
     741                    
     742                    
     743                    $C$DW$T$79      .dwtag  DW_TAG_array_type
     744                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$22)
     745                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     746                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x40)
     747                    $C$DW$42        .dwtag  DW_TAG_subrange_type
     748                            .dwattr $C$DW$42, DW_AT_upper_bound(0x01)
     749                    
     750                            .dwendtag $C$DW$T$79
     751                    
     752                    
     753                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
     754                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     755                    $C$DW$43        .dwtag  DW_TAG_member
     756                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$20)
     757                            .dwattr $C$DW$43, DW_AT_name("COMPx")
     758                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("COMPx")
     759                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     760                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     761                            .dwattr $C$DW$43, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     762                            .dwattr $C$DW$43, DW_AT_decl_line(0x5a)
     763                            .dwattr $C$DW$43, DW_AT_decl_column(0x10)
     764                    
     765                    $C$DW$44        .dwtag  DW_TAG_member
     766                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$20)
     767                            .dwattr $C$DW$44, DW_AT_name("UDCPx")
     768                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("UDCPx")
     769                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     770                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   15

     771                            .dwattr $C$DW$44, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     772                            .dwattr $C$DW$44, DW_AT_decl_line(0x5b)
     773                            .dwattr $C$DW$44, DW_AT_decl_column(0x10)
     774                    
     775                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
     776                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x59)
     777                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x05)
     778                            .dwendtag $C$DW$T$23
     779                    
     780                    
     781                    $C$DW$T$80      .dwtag  DW_TAG_array_type
     782                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$23)
     783                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     784                            .dwattr $C$DW$T$80, DW_AT_byte_size(0x20)
     785                    $C$DW$45        .dwtag  DW_TAG_subrange_type
     786                            .dwattr $C$DW$45, DW_AT_upper_bound(0x03)
     787                    
     788                            .dwendtag $C$DW$T$80
     789                    
     790                    
     791                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
     792                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     793                    $C$DW$46        .dwtag  DW_TAG_member
     794                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$25)
     795                            .dwattr $C$DW$46, DW_AT_name("data")
     796                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("data")
     797                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     799                            .dwattr $C$DW$46, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     800                            .dwattr $C$DW$46, DW_AT_decl_line(0xe6)
     801                            .dwattr $C$DW$46, DW_AT_decl_column(0x0e)
     802                    
     803                    $C$DW$47        .dwtag  DW_TAG_member
     804                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$25)
     805                            .dwattr $C$DW$47, DW_AT_name("control")
     806                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("control")
     807                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     808                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     809                            .dwattr $C$DW$47, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     810                            .dwattr $C$DW$47, DW_AT_decl_line(0xe7)
     811                            .dwattr $C$DW$47, DW_AT_decl_column(0x0e)
     812                    
     813                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
     814                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xe4)
     815                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x05)
     816                            .dwendtag $C$DW$T$26
     817                    
     818                    
     819                    $C$DW$T$52      .dwtag  DW_TAG_array_type
     820                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$26)
     821                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
     822                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x200)
     823                    $C$DW$48        .dwtag  DW_TAG_subrange_type
     824                            .dwattr $C$DW$48, DW_AT_upper_bound(0x7f)
     825                    
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   16

     826                            .dwendtag $C$DW$T$52
     827                    
     828                    
     829                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
     830                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     831                    $C$DW$49        .dwtag  DW_TAG_member
     832                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$25)
     833                            .dwattr $C$DW$49, DW_AT_name("data")
     834                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("data")
     835                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     837                            .dwattr $C$DW$49, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     838                            .dwattr $C$DW$49, DW_AT_decl_line(0xf0)
     839                            .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     840                    
     841                    $C$DW$50        .dwtag  DW_TAG_member
     842                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$25)
     843                            .dwattr $C$DW$50, DW_AT_name("flags")
     844                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("flags")
     845                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     846                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     847                            .dwattr $C$DW$50, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     848                            .dwattr $C$DW$50, DW_AT_decl_line(0xf1)
     849                            .dwattr $C$DW$50, DW_AT_decl_column(0x0a)
     850                    
     851                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
     852                            .dwattr $C$DW$T$27, DW_AT_decl_line(0xee)
     853                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x05)
     854                            .dwendtag $C$DW$T$27
     855                    
     856                    
     857                    $C$DW$T$53      .dwtag  DW_TAG_array_type
     858                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
     859                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     860                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x200)
     861                    $C$DW$51        .dwtag  DW_TAG_subrange_type
     862                            .dwattr $C$DW$51, DW_AT_upper_bound(0x7f)
     863                    
     864                            .dwendtag $C$DW$T$53
     865                    
     866                    
     867                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     868                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x18)
     869                    $C$DW$52        .dwtag  DW_TAG_member
     870                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$10)
     871                            .dwattr $C$DW$52, DW_AT_name("fd")
     872                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("fd")
     873                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     875                            .dwattr $C$DW$52, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     876                            .dwattr $C$DW$52, DW_AT_decl_line(0x5c)
     877                            .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     878                    
     879                    $C$DW$53        .dwtag  DW_TAG_member
     880                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$28)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   17

     881                            .dwattr $C$DW$53, DW_AT_name("buf")
     882                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("buf")
     883                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     884                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     885                            .dwattr $C$DW$53, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     886                            .dwattr $C$DW$53, DW_AT_decl_line(0x5d)
     887                            .dwattr $C$DW$53, DW_AT_decl_column(0x16)
     888                    
     889                    $C$DW$54        .dwtag  DW_TAG_member
     890                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$28)
     891                            .dwattr $C$DW$54, DW_AT_name("pos")
     892                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("pos")
     893                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     894                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     895                            .dwattr $C$DW$54, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     896                            .dwattr $C$DW$54, DW_AT_decl_line(0x5e)
     897                            .dwattr $C$DW$54, DW_AT_decl_column(0x16)
     898                    
     899                    $C$DW$55        .dwtag  DW_TAG_member
     900                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$28)
     901                            .dwattr $C$DW$55, DW_AT_name("bufend")
     902                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("bufend")
     903                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     904                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     905                            .dwattr $C$DW$55, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     906                            .dwattr $C$DW$55, DW_AT_decl_line(0x5f)
     907                            .dwattr $C$DW$55, DW_AT_decl_column(0x16)
     908                    
     909                    $C$DW$56        .dwtag  DW_TAG_member
     910                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$28)
     911                            .dwattr $C$DW$56, DW_AT_name("buff_stop")
     912                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("buff_stop")
     913                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     914                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     915                            .dwattr $C$DW$56, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     916                            .dwattr $C$DW$56, DW_AT_decl_line(0x60)
     917                            .dwattr $C$DW$56, DW_AT_decl_column(0x16)
     918                    
     919                    $C$DW$57        .dwtag  DW_TAG_member
     920                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     921                            .dwattr $C$DW$57, DW_AT_name("flags")
     922                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("flags")
     923                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     924                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     925                            .dwattr $C$DW$57, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     926                            .dwattr $C$DW$57, DW_AT_decl_line(0x61)
     927                            .dwattr $C$DW$57, DW_AT_decl_column(0x16)
     928                    
     929                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     930                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x5b)
     931                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
     932                            .dwendtag $C$DW$T$29
     933                    
     934                    $C$DW$T$97      .dwtag  DW_TAG_typedef
     935                            .dwattr $C$DW$T$97, DW_AT_name("FILE")
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   18

     936                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$29)
     937                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
     938                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     939                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x62)
     940                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
     941                    
     942                    
     943                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
     944                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
     945                    $C$DW$58        .dwtag  DW_TAG_member
     946                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     947                            .dwattr $C$DW$58, DW_AT_name("PSxMSTID_L")
     948                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("PSxMSTID_L")
     949                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     950                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     951                            .dwattr $C$DW$58, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     952                            .dwattr $C$DW$58, DW_AT_decl_line(0xe8)
     953                            .dwattr $C$DW$58, DW_AT_decl_column(0x12)
     954                    
     955                    $C$DW$59        .dwtag  DW_TAG_member
     956                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     957                            .dwattr $C$DW$59, DW_AT_name("PSxMSTID_H")
     958                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("PSxMSTID_H")
     959                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     960                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     961                            .dwattr $C$DW$59, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     962                            .dwattr $C$DW$59, DW_AT_decl_line(0xe9)
     963                            .dwattr $C$DW$59, DW_AT_decl_column(0x12)
     964                    
     965                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
     966                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xe7)
     967                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x05)
     968                            .dwendtag $C$DW$T$30
     969                    
     970                    
     971                    $C$DW$T$67      .dwtag  DW_TAG_array_type
     972                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$30)
     973                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     974                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x100)
     975                    $C$DW$60        .dwtag  DW_TAG_subrange_type
     976                            .dwattr $C$DW$60, DW_AT_upper_bound(0x1f)
     977                    
     978                            .dwendtag $C$DW$T$67
     979                    
     980                    
     981                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
     982                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
     983                    $C$DW$61        .dwtag  DW_TAG_member
     984                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     985                            .dwattr $C$DW$61, DW_AT_name("PPSxMSTID_L")
     986                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("PPSxMSTID_L")
     987                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     989                            .dwattr $C$DW$61, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     990                            .dwattr $C$DW$61, DW_AT_decl_line(0xed)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   19

     991                            .dwattr $C$DW$61, DW_AT_decl_column(0x12)
     992                    
     993                    $C$DW$62        .dwtag  DW_TAG_member
     994                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     995                            .dwattr $C$DW$62, DW_AT_name("PPSxMSTID_H")
     996                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("PPSxMSTID_H")
     997                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     998                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     999                            .dwattr $C$DW$62, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1000                            .dwattr $C$DW$62, DW_AT_decl_line(0xee)
    1001                            .dwattr $C$DW$62, DW_AT_decl_column(0x12)
    1002                    
    1003                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    1004                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xec)
    1005                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x05)
    1006                            .dwendtag $C$DW$T$31
    1007                    
    1008                    
    1009                    $C$DW$T$68      .dwtag  DW_TAG_array_type
    1010                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$31)
    1011                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1012                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x40)
    1013                    $C$DW$63        .dwtag  DW_TAG_subrange_type
    1014                            .dwattr $C$DW$63, DW_AT_upper_bound(0x07)
    1015                    
    1016                            .dwendtag $C$DW$T$68
    1017                    
    1018                    
    1019                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1020                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    1021                    $C$DW$64        .dwtag  DW_TAG_member
    1022                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1023                            .dwattr $C$DW$64, DW_AT_name("PPSExMSTID_L")
    1024                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("PPSExMSTID_L")
    1025                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1027                            .dwattr $C$DW$64, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1028                            .dwattr $C$DW$64, DW_AT_decl_line(0xf2)
    1029                            .dwattr $C$DW$64, DW_AT_decl_column(0x12)
    1030                    
    1031                    $C$DW$65        .dwtag  DW_TAG_member
    1032                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1033                            .dwattr $C$DW$65, DW_AT_name("PPSExMSTID_H")
    1034                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("PPSExMSTID_H")
    1035                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1036                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1037                            .dwattr $C$DW$65, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1038                            .dwattr $C$DW$65, DW_AT_decl_line(0xf3)
    1039                            .dwattr $C$DW$65, DW_AT_decl_column(0x12)
    1040                    
    1041                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    1042                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xf1)
    1043                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x05)
    1044                            .dwendtag $C$DW$T$32
    1045                    
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   20

    1046                    
    1047                    $C$DW$T$69      .dwtag  DW_TAG_array_type
    1048                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$32)
    1049                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1050                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x100)
    1051                    $C$DW$66        .dwtag  DW_TAG_subrange_type
    1052                            .dwattr $C$DW$66, DW_AT_upper_bound(0x1f)
    1053                    
    1054                            .dwendtag $C$DW$T$69
    1055                    
    1056                    
    1057                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1058                            .dwattr $C$DW$T$34, DW_AT_name("ROLMIO_t")
    1059                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x20)
    1060                    $C$DW$67        .dwtag  DW_TAG_member
    1061                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$24)
    1062                            .dwattr $C$DW$67, DW_AT_name("DIN")
    1063                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("DIN")
    1064                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1065                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1066                            .dwattr $C$DW$67, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1067                            .dwattr $C$DW$67, DW_AT_decl_line(0x35)
    1068                            .dwattr $C$DW$67, DW_AT_decl_column(0x0b)
    1069                    
    1070                    $C$DW$68        .dwtag  DW_TAG_member
    1071                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$24)
    1072                            .dwattr $C$DW$68, DW_AT_name("DOUT")
    1073                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("DOUT")
    1074                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1075                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1076                            .dwattr $C$DW$68, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1077                            .dwattr $C$DW$68, DW_AT_decl_line(0x36)
    1078                            .dwattr $C$DW$68, DW_AT_decl_column(0x0b)
    1079                    
    1080                    $C$DW$69        .dwtag  DW_TAG_member
    1081                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$24)
    1082                            .dwattr $C$DW$69, DW_AT_name("DS")
    1083                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("DS")
    1084                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1085                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1086                            .dwattr $C$DW$69, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1087                            .dwattr $C$DW$69, DW_AT_decl_line(0x37)
    1088                            .dwattr $C$DW$69, DW_AT_decl_column(0x0b)
    1089                    
    1090                    $C$DW$70        .dwtag  DW_TAG_member
    1091                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$33)
    1092                            .dwattr $C$DW$70, DW_AT_name("DATOA")
    1093                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("DATOA")
    1094                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1095                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1096                            .dwattr $C$DW$70, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1097                            .dwattr $C$DW$70, DW_AT_decl_line(0x38)
    1098                            .dwattr $C$DW$70, DW_AT_decl_column(0x0c)
    1099                    
    1100                    $C$DW$71        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   21

    1101                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$33)
    1102                            .dwattr $C$DW$71, DW_AT_name("DATOB")
    1103                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("DATOB")
    1104                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1105                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1106                            .dwattr $C$DW$71, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1107                            .dwattr $C$DW$71, DW_AT_decl_line(0x39)
    1108                            .dwattr $C$DW$71, DW_AT_decl_column(0x0c)
    1109                    
    1110                    $C$DW$72        .dwtag  DW_TAG_member
    1111                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$33)
    1112                            .dwattr $C$DW$72, DW_AT_name("DATOC")
    1113                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("DATOC")
    1114                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1115                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1116                            .dwattr $C$DW$72, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1117                            .dwattr $C$DW$72, DW_AT_decl_line(0x3a)
    1118                            .dwattr $C$DW$72, DW_AT_decl_column(0x0c)
    1119                    
    1120                    $C$DW$73        .dwtag  DW_TAG_member
    1121                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$33)
    1122                            .dwattr $C$DW$73, DW_AT_name("DATIA")
    1123                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("DATIA")
    1124                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1125                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1126                            .dwattr $C$DW$73, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1127                            .dwattr $C$DW$73, DW_AT_decl_line(0x3b)
    1128                            .dwattr $C$DW$73, DW_AT_decl_column(0x0c)
    1129                    
    1130                    $C$DW$74        .dwtag  DW_TAG_member
    1131                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$33)
    1132                            .dwattr $C$DW$74, DW_AT_name("DATIB")
    1133                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("DATIB")
    1134                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1135                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1136                            .dwattr $C$DW$74, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1137                            .dwattr $C$DW$74, DW_AT_decl_line(0x3c)
    1138                            .dwattr $C$DW$74, DW_AT_decl_column(0x0c)
    1139                    
    1140                    $C$DW$75        .dwtag  DW_TAG_member
    1141                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$33)
    1142                            .dwattr $C$DW$75, DW_AT_name("DATIC")
    1143                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("DATIC")
    1144                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1145                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1146                            .dwattr $C$DW$75, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1147                            .dwattr $C$DW$75, DW_AT_decl_line(0x3d)
    1148                            .dwattr $C$DW$75, DW_AT_decl_column(0x0c)
    1149                    
    1150                    $C$DW$76        .dwtag  DW_TAG_member
    1151                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$33)
    1152                            .dwattr $C$DW$76, DW_AT_name("STRT")
    1153                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("STRT")
    1154                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1155                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   22

    1156                            .dwattr $C$DW$76, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1157                            .dwattr $C$DW$76, DW_AT_decl_line(0x3e)
    1158                            .dwattr $C$DW$76, DW_AT_decl_column(0x0c)
    1159                    
    1160                    $C$DW$77        .dwtag  DW_TAG_member
    1161                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$33)
    1162                            .dwattr $C$DW$77, DW_AT_name("CLR")
    1163                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("CLR")
    1164                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1165                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1166                            .dwattr $C$DW$77, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1167                            .dwattr $C$DW$77, DW_AT_decl_line(0x3f)
    1168                            .dwattr $C$DW$77, DW_AT_decl_column(0x0c)
    1169                    
    1170                    $C$DW$78        .dwtag  DW_TAG_member
    1171                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$33)
    1172                            .dwattr $C$DW$78, DW_AT_name("IOPLS")
    1173                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("IOPLS")
    1174                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1175                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1176                            .dwattr $C$DW$78, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1177                            .dwattr $C$DW$78, DW_AT_decl_line(0x40)
    1178                            .dwattr $C$DW$78, DW_AT_decl_column(0x0c)
    1179                    
    1180                    $C$DW$79        .dwtag  DW_TAG_member
    1181                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$33)
    1182                            .dwattr $C$DW$79, DW_AT_name("SELB")
    1183                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("SELB")
    1184                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1185                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1186                            .dwattr $C$DW$79, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1187                            .dwattr $C$DW$79, DW_AT_decl_line(0x41)
    1188                            .dwattr $C$DW$79, DW_AT_decl_column(0x0c)
    1189                    
    1190                    $C$DW$80        .dwtag  DW_TAG_member
    1191                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$33)
    1192                            .dwattr $C$DW$80, DW_AT_name("SELD")
    1193                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("SELD")
    1194                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1195                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1196                            .dwattr $C$DW$80, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1197                            .dwattr $C$DW$80, DW_AT_decl_line(0x42)
    1198                            .dwattr $C$DW$80, DW_AT_decl_column(0x0c)
    1199                    
    1200                    $C$DW$81        .dwtag  DW_TAG_member
    1201                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$33)
    1202                            .dwattr $C$DW$81, DW_AT_name("IORST")
    1203                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("IORST")
    1204                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1205                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1206                            .dwattr $C$DW$81, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1207                            .dwattr $C$DW$81, DW_AT_decl_line(0x43)
    1208                            .dwattr $C$DW$81, DW_AT_decl_column(0x0c)
    1209                    
    1210                    $C$DW$82        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   23

    1211                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$33)
    1212                            .dwattr $C$DW$82, DW_AT_name("INTR")
    1213                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("INTR")
    1214                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1215                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1216                            .dwattr $C$DW$82, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1217                            .dwattr $C$DW$82, DW_AT_decl_line(0x44)
    1218                            .dwattr $C$DW$82, DW_AT_decl_column(0x0c)
    1219                    
    1220                    $C$DW$83        .dwtag  DW_TAG_member
    1221                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$33)
    1222                            .dwattr $C$DW$83, DW_AT_name("INTA")
    1223                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("INTA")
    1224                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1225                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1226                            .dwattr $C$DW$83, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1227                            .dwattr $C$DW$83, DW_AT_decl_line(0x45)
    1228                            .dwattr $C$DW$83, DW_AT_decl_column(0x0c)
    1229                    
    1230                    $C$DW$84        .dwtag  DW_TAG_member
    1231                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$33)
    1232                            .dwattr $C$DW$84, DW_AT_name("INTP")
    1233                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("INTP")
    1234                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1235                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1236                            .dwattr $C$DW$84, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1237                            .dwattr $C$DW$84, DW_AT_decl_line(0x46)
    1238                            .dwattr $C$DW$84, DW_AT_decl_column(0x0c)
    1239                    
    1240                    $C$DW$85        .dwtag  DW_TAG_member
    1241                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$33)
    1242                            .dwattr $C$DW$85, DW_AT_name("MSKO")
    1243                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("MSKO")
    1244                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1245                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1246                            .dwattr $C$DW$85, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1247                            .dwattr $C$DW$85, DW_AT_decl_line(0x47)
    1248                            .dwattr $C$DW$85, DW_AT_decl_column(0x0c)
    1249                    
    1250                    $C$DW$86        .dwtag  DW_TAG_member
    1251                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$33)
    1252                            .dwattr $C$DW$86, DW_AT_name("RQENB")
    1253                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("RQENB")
    1254                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1255                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1256                            .dwattr $C$DW$86, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1257                            .dwattr $C$DW$86, DW_AT_decl_line(0x48)
    1258                            .dwattr $C$DW$86, DW_AT_decl_column(0x0c)
    1259                    
    1260                    $C$DW$87        .dwtag  DW_TAG_member
    1261                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$33)
    1262                            .dwattr $C$DW$87, DW_AT_name("DCHR")
    1263                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("DCHR")
    1264                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1265                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   24

    1266                            .dwattr $C$DW$87, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1267                            .dwattr $C$DW$87, DW_AT_decl_line(0x49)
    1268                            .dwattr $C$DW$87, DW_AT_decl_column(0x0c)
    1269                    
    1270                    $C$DW$88        .dwtag  DW_TAG_member
    1271                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$33)
    1272                            .dwattr $C$DW$88, DW_AT_name("DCHA")
    1273                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("DCHA")
    1274                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1275                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1276                            .dwattr $C$DW$88, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1277                            .dwattr $C$DW$88, DW_AT_decl_line(0x4a)
    1278                            .dwattr $C$DW$88, DW_AT_decl_column(0x0c)
    1279                    
    1280                    $C$DW$89        .dwtag  DW_TAG_member
    1281                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$33)
    1282                            .dwattr $C$DW$89, DW_AT_name("DCHP")
    1283                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("DCHP")
    1284                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1285                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1286                            .dwattr $C$DW$89, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1287                            .dwattr $C$DW$89, DW_AT_decl_line(0x4b)
    1288                            .dwattr $C$DW$89, DW_AT_decl_column(0x0c)
    1289                    
    1290                    $C$DW$90        .dwtag  DW_TAG_member
    1291                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$33)
    1292                            .dwattr $C$DW$90, DW_AT_name("DCHM0")
    1293                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("DCHM0")
    1294                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1295                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1296                            .dwattr $C$DW$90, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1297                            .dwattr $C$DW$90, DW_AT_decl_line(0x4c)
    1298                            .dwattr $C$DW$90, DW_AT_decl_column(0x0c)
    1299                    
    1300                    $C$DW$91        .dwtag  DW_TAG_member
    1301                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$33)
    1302                            .dwattr $C$DW$91, DW_AT_name("DCHM1")
    1303                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("DCHM1")
    1304                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1305                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1306                            .dwattr $C$DW$91, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1307                            .dwattr $C$DW$91, DW_AT_decl_line(0x4d)
    1308                            .dwattr $C$DW$91, DW_AT_decl_column(0x0c)
    1309                    
    1310                    $C$DW$92        .dwtag  DW_TAG_member
    1311                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$33)
    1312                            .dwattr $C$DW$92, DW_AT_name("DCHS")
    1313                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("DCHS")
    1314                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1315                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1316                            .dwattr $C$DW$92, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1317                            .dwattr $C$DW$92, DW_AT_decl_line(0x4e)
    1318                            .dwattr $C$DW$92, DW_AT_decl_column(0x0c)
    1319                    
    1320                    $C$DW$93        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   25

    1321                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$33)
    1322                            .dwattr $C$DW$93, DW_AT_name("DCHO")
    1323                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("DCHO")
    1324                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1325                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1326                            .dwattr $C$DW$93, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1327                            .dwattr $C$DW$93, DW_AT_decl_line(0x4f)
    1328                            .dwattr $C$DW$93, DW_AT_decl_column(0x0c)
    1329                    
    1330                    $C$DW$94        .dwtag  DW_TAG_member
    1331                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$33)
    1332                            .dwattr $C$DW$94, DW_AT_name("OVFLO")
    1333                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("OVFLO")
    1334                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1335                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1336                            .dwattr $C$DW$94, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1337                            .dwattr $C$DW$94, DW_AT_decl_line(0x50)
    1338                            .dwattr $C$DW$94, DW_AT_decl_column(0x0c)
    1339                    
    1340                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    1341                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x34)
    1342                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x19)
    1343                            .dwendtag $C$DW$T$34
    1344                    
    1345                    $C$DW$T$98      .dwtag  DW_TAG_volatile_type
    1346                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$34)
    1347                    
    1348                    $C$DW$T$99      .dwtag  DW_TAG_typedef
    1349                            .dwattr $C$DW$T$99, DW_AT_name("ROLMIO_t")
    1350                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    1351                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1352                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    1353                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x51)
    1354                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x03)
    1355                    
    1356                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1357                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1358                    
    1359                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1360                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1361                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1362                    
    1363                    
    1364                    $C$DW$T$92      .dwtag  DW_TAG_subroutine_type
    1365                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1366                            .dwendtag $C$DW$T$92
    1367                    
    1368                    $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    1369                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    1370                            .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    1371                    
    1372                    $C$DW$T$94      .dwtag  DW_TAG_typedef
    1373                            .dwattr $C$DW$T$94, DW_AT_name("callback")
    1374                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    1375                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   26

    1376                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    1377                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x06)
    1378                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x10)
    1379                    
    1380                    
    1381                    $C$DW$T$95      .dwtag  DW_TAG_array_type
    1382                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    1383                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1384                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x200)
    1385                    $C$DW$95        .dwtag  DW_TAG_subrange_type
    1386                            .dwattr $C$DW$95, DW_AT_upper_bound(0x7f)
    1387                    
    1388                            .dwendtag $C$DW$T$95
    1389                    
    1390                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1391                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1392                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1393                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1394                    
    1395                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1396                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1397                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1398                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1399                    
    1400                    $C$DW$T$111     .dwtag  DW_TAG_typedef
    1401                            .dwattr $C$DW$T$111, DW_AT_name("int8_t")
    1402                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$5)
    1403                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    1404                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1405                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x2a)
    1406                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x1d)
    1407                    
    1408                    $C$DW$T$112     .dwtag  DW_TAG_typedef
    1409                            .dwattr $C$DW$T$112, DW_AT_name("int_least8_t")
    1410                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    1411                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    1412                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1413                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x37)
    1414                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x17)
    1415                    
    1416                    $C$DW$T$113     .dwtag  DW_TAG_typedef
    1417                            .dwattr $C$DW$T$113, DW_AT_name("sint8")
    1418                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$111)
    1419                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    1420                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    1421                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x68)
    1422                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x10)
    1423                    
    1424                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1425                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1426                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1427                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1428                    
    1429                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1430                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$6)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   27

    1431                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    1432                    
    1433                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    1434                            .dwattr $C$DW$T$33, DW_AT_name("uint8_t")
    1435                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$6)
    1436                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1437                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1438                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x2b)
    1439                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1c)
    1440                    
    1441                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    1442                            .dwattr $C$DW$T$49, DW_AT_name("uint8")
    1443                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$33)
    1444                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1445                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1446                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x4b)
    1447                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x11)
    1448                    
    1449                    
    1450                    $C$DW$T$50      .dwtag  DW_TAG_array_type
    1451                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1452                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1453                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x06)
    1454                    $C$DW$96        .dwtag  DW_TAG_subrange_type
    1455                            .dwattr $C$DW$96, DW_AT_upper_bound(0x05)
    1456                    
    1457                            .dwendtag $C$DW$T$50
    1458                    
    1459                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    1460                            .dwattr $C$DW$T$114, DW_AT_name("uint_least8_t")
    1461                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$33)
    1462                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    1463                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1464                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x38)
    1465                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x16)
    1466                    
    1467                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1468                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1469                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1470                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1471                    
    1472                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1473                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1474                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1475                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1476                    
    1477                    $C$DW$T$115     .dwtag  DW_TAG_typedef
    1478                            .dwattr $C$DW$T$115, DW_AT_name("int16_t")
    1479                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$8)
    1480                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    1481                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1482                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x2c)
    1483                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x1d)
    1484                    
    1485                    $C$DW$T$116     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   28

    1486                            .dwattr $C$DW$T$116, DW_AT_name("int_least16_t")
    1487                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$115)
    1488                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    1489                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1490                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x3a)
    1491                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x17)
    1492                    
    1493                    $C$DW$T$117     .dwtag  DW_TAG_typedef
    1494                            .dwattr $C$DW$T$117, DW_AT_name("sint16")
    1495                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$115)
    1496                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    1497                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    1498                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x63)
    1499                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x11)
    1500                    
    1501                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1502                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1503                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1504                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1505                    
    1506                    $C$DW$T$24      .dwtag  DW_TAG_typedef
    1507                            .dwattr $C$DW$T$24, DW_AT_name("uint16_t")
    1508                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$9)
    1509                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1510                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1511                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x2d)
    1512                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x1c)
    1513                    
    1514                    $C$DW$T$25      .dwtag  DW_TAG_typedef
    1515                            .dwattr $C$DW$T$25, DW_AT_name("uint16")
    1516                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1517                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1518                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1519                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x46)
    1520                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x12)
    1521                    
    1522                    $C$DW$T$118     .dwtag  DW_TAG_typedef
    1523                            .dwattr $C$DW$T$118, DW_AT_name("uint_least16_t")
    1524                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$24)
    1525                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    1526                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1527                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x3b)
    1528                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x16)
    1529                    
    1530                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1531                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1532                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1533                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1534                    
    1535                    $C$DW$T$119     .dwtag  DW_TAG_typedef
    1536                            .dwattr $C$DW$T$119, DW_AT_name("int32_t")
    1537                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$10)
    1538                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    1539                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1540                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x2e)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   29

    1541                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x1d)
    1542                    
    1543                    $C$DW$T$120     .dwtag  DW_TAG_typedef
    1544                            .dwattr $C$DW$T$120, DW_AT_name("int_fast16_t")
    1545                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    1546                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    1547                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1548                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x47)
    1549                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x17)
    1550                    
    1551                    $C$DW$T$121     .dwtag  DW_TAG_typedef
    1552                            .dwattr $C$DW$T$121, DW_AT_name("int_fast32_t")
    1553                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$119)
    1554                            .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    1555                            .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1556                            .dwattr $C$DW$T$121, DW_AT_decl_line(0x4a)
    1557                            .dwattr $C$DW$T$121, DW_AT_decl_column(0x17)
    1558                    
    1559                    $C$DW$T$122     .dwtag  DW_TAG_typedef
    1560                            .dwattr $C$DW$T$122, DW_AT_name("int_fast8_t")
    1561                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$119)
    1562                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    1563                            .dwattr $C$DW$T$122, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1564                            .dwattr $C$DW$T$122, DW_AT_decl_line(0x45)
    1565                            .dwattr $C$DW$T$122, DW_AT_decl_column(0x17)
    1566                    
    1567                    $C$DW$T$123     .dwtag  DW_TAG_typedef
    1568                            .dwattr $C$DW$T$123, DW_AT_name("int_least32_t")
    1569                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$119)
    1570                            .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    1571                            .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1572                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x3c)
    1573                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x17)
    1574                    
    1575                    $C$DW$T$124     .dwtag  DW_TAG_typedef
    1576                            .dwattr $C$DW$T$124, DW_AT_name("sint32")
    1577                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$119)
    1578                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    1579                            .dwattr $C$DW$T$124, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    1580                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x5e)
    1581                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x11)
    1582                    
    1583                    $C$DW$T$125     .dwtag  DW_TAG_typedef
    1584                            .dwattr $C$DW$T$125, DW_AT_name("intptr_t")
    1585                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$10)
    1586                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    1587                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1588                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x52)
    1589                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x1a)
    1590                    
    1591                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    1592                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1593                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1594                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1595                    
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   30

    1596                    $C$DW$T$127     .dwtag  DW_TAG_typedef
    1597                            .dwattr $C$DW$T$127, DW_AT_name("size_t")
    1598                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$11)
    1599                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    1600                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    1601                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x58)
    1602                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x19)
    1603                    
    1604                    $C$DW$T$19      .dwtag  DW_TAG_typedef
    1605                            .dwattr $C$DW$T$19, DW_AT_name("uint32_t")
    1606                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    1607                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1608                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1609                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2f)
    1610                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    1611                    
    1612                    
    1613                    $C$DW$T$55      .dwtag  DW_TAG_array_type
    1614                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$19)
    1615                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1616                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x1c)
    1617                    $C$DW$97        .dwtag  DW_TAG_subrange_type
    1618                            .dwattr $C$DW$97, DW_AT_upper_bound(0x06)
    1619                    
    1620                            .dwendtag $C$DW$T$55
    1621                    
    1622                    
    1623                    $C$DW$T$56      .dwtag  DW_TAG_array_type
    1624                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$19)
    1625                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1626                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x14)
    1627                    $C$DW$98        .dwtag  DW_TAG_subrange_type
    1628                            .dwattr $C$DW$98, DW_AT_upper_bound(0x04)
    1629                    
    1630                            .dwendtag $C$DW$T$56
    1631                    
    1632                    
    1633                    $C$DW$T$57      .dwtag  DW_TAG_array_type
    1634                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$19)
    1635                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1636                            .dwattr $C$DW$T$57, DW_AT_byte_size(0xa0)
    1637                    $C$DW$99        .dwtag  DW_TAG_subrange_type
    1638                            .dwattr $C$DW$99, DW_AT_upper_bound(0x27)
    1639                    
    1640                            .dwendtag $C$DW$T$57
    1641                    
    1642                    
    1643                    $C$DW$T$58      .dwtag  DW_TAG_array_type
    1644                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$19)
    1645                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1646                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    1647                    $C$DW$100       .dwtag  DW_TAG_subrange_type
    1648                            .dwattr $C$DW$100, DW_AT_upper_bound(0x03)
    1649                    
    1650                            .dwendtag $C$DW$T$58
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   31

    1651                    
    1652                    
    1653                    $C$DW$T$59      .dwtag  DW_TAG_array_type
    1654                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$19)
    1655                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1656                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x98)
    1657                    $C$DW$101       .dwtag  DW_TAG_subrange_type
    1658                            .dwattr $C$DW$101, DW_AT_upper_bound(0x25)
    1659                    
    1660                            .dwendtag $C$DW$T$59
    1661                    
    1662                    
    1663                    $C$DW$T$60      .dwtag  DW_TAG_array_type
    1664                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$19)
    1665                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1666                            .dwattr $C$DW$T$60, DW_AT_byte_size(0xa8)
    1667                    $C$DW$102       .dwtag  DW_TAG_subrange_type
    1668                            .dwattr $C$DW$102, DW_AT_upper_bound(0x29)
    1669                    
    1670                            .dwendtag $C$DW$T$60
    1671                    
    1672                    
    1673                    $C$DW$T$61      .dwtag  DW_TAG_array_type
    1674                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$19)
    1675                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1676                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x50)
    1677                    $C$DW$103       .dwtag  DW_TAG_subrange_type
    1678                            .dwattr $C$DW$103, DW_AT_upper_bound(0x13)
    1679                    
    1680                            .dwendtag $C$DW$T$61
    1681                    
    1682                    
    1683                    $C$DW$T$62      .dwtag  DW_TAG_array_type
    1684                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$19)
    1685                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1686                            .dwattr $C$DW$T$62, DW_AT_byte_size(0xf0)
    1687                    $C$DW$104       .dwtag  DW_TAG_subrange_type
    1688                            .dwattr $C$DW$104, DW_AT_upper_bound(0x3b)
    1689                    
    1690                            .dwendtag $C$DW$T$62
    1691                    
    1692                    
    1693                    $C$DW$T$64      .dwtag  DW_TAG_array_type
    1694                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$19)
    1695                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1696                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x08)
    1697                    $C$DW$105       .dwtag  DW_TAG_subrange_type
    1698                            .dwattr $C$DW$105, DW_AT_upper_bound(0x01)
    1699                    
    1700                            .dwendtag $C$DW$T$64
    1701                    
    1702                    
    1703                    $C$DW$T$65      .dwtag  DW_TAG_array_type
    1704                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$19)
    1705                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   32

    1706                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x138)
    1707                    $C$DW$106       .dwtag  DW_TAG_subrange_type
    1708                            .dwattr $C$DW$106, DW_AT_upper_bound(0x4d)
    1709                    
    1710                            .dwendtag $C$DW$T$65
    1711                    
    1712                    
    1713                    $C$DW$T$66      .dwtag  DW_TAG_array_type
    1714                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$19)
    1715                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1716                            .dwattr $C$DW$T$66, DW_AT_byte_size(0xf4)
    1717                    $C$DW$107       .dwtag  DW_TAG_subrange_type
    1718                            .dwattr $C$DW$107, DW_AT_upper_bound(0x3c)
    1719                    
    1720                            .dwendtag $C$DW$T$66
    1721                    
    1722                    
    1723                    $C$DW$T$70      .dwtag  DW_TAG_array_type
    1724                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$19)
    1725                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1726                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x80)
    1727                    $C$DW$108       .dwtag  DW_TAG_subrange_type
    1728                            .dwattr $C$DW$108, DW_AT_upper_bound(0x1f)
    1729                    
    1730                            .dwendtag $C$DW$T$70
    1731                    
    1732                    
    1733                    $C$DW$T$71      .dwtag  DW_TAG_array_type
    1734                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$19)
    1735                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1736                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x20)
    1737                    $C$DW$109       .dwtag  DW_TAG_subrange_type
    1738                            .dwattr $C$DW$109, DW_AT_upper_bound(0x07)
    1739                    
    1740                            .dwendtag $C$DW$T$71
    1741                    
    1742                    $C$DW$T$20      .dwtag  DW_TAG_typedef
    1743                            .dwattr $C$DW$T$20, DW_AT_name("uint32")
    1744                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    1745                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1746                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1747                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x41)
    1748                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x12)
    1749                    
    1750                    
    1751                    $C$DW$T$21      .dwtag  DW_TAG_array_type
    1752                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1753                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1754                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    1755                    $C$DW$110       .dwtag  DW_TAG_subrange_type
    1756                            .dwattr $C$DW$110, DW_AT_upper_bound(0x01)
    1757                    
    1758                            .dwendtag $C$DW$T$21
    1759                    
    1760                    
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   33

    1761                    $C$DW$T$47      .dwtag  DW_TAG_array_type
    1762                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$20)
    1763                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1764                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x40)
    1765                    $C$DW$111       .dwtag  DW_TAG_subrange_type
    1766                            .dwattr $C$DW$111, DW_AT_upper_bound(0x0f)
    1767                    
    1768                            .dwendtag $C$DW$T$47
    1769                    
    1770                    
    1771                    $C$DW$T$48      .dwtag  DW_TAG_array_type
    1772                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$20)
    1773                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1774                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x20)
    1775                    $C$DW$112       .dwtag  DW_TAG_subrange_type
    1776                            .dwattr $C$DW$112, DW_AT_upper_bound(0x07)
    1777                    
    1778                            .dwendtag $C$DW$T$48
    1779                    
    1780                    
    1781                    $C$DW$T$73      .dwtag  DW_TAG_array_type
    1782                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$20)
    1783                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1784                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x1c)
    1785                    $C$DW$113       .dwtag  DW_TAG_subrange_type
    1786                            .dwattr $C$DW$113, DW_AT_upper_bound(0x06)
    1787                    
    1788                            .dwendtag $C$DW$T$73
    1789                    
    1790                    
    1791                    $C$DW$T$74      .dwtag  DW_TAG_array_type
    1792                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$20)
    1793                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1794                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x14)
    1795                    $C$DW$114       .dwtag  DW_TAG_subrange_type
    1796                            .dwattr $C$DW$114, DW_AT_upper_bound(0x04)
    1797                    
    1798                            .dwendtag $C$DW$T$74
    1799                    
    1800                    
    1801                    $C$DW$T$75      .dwtag  DW_TAG_array_type
    1802                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$20)
    1803                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1804                            .dwattr $C$DW$T$75, DW_AT_byte_size(0xa0)
    1805                    $C$DW$115       .dwtag  DW_TAG_subrange_type
    1806                            .dwattr $C$DW$115, DW_AT_upper_bound(0x27)
    1807                    
    1808                            .dwendtag $C$DW$T$75
    1809                    
    1810                    
    1811                    $C$DW$T$76      .dwtag  DW_TAG_array_type
    1812                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$20)
    1813                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1814                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x10)
    1815                    $C$DW$116       .dwtag  DW_TAG_subrange_type
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   34

    1816                            .dwattr $C$DW$116, DW_AT_upper_bound(0x03)
    1817                    
    1818                            .dwendtag $C$DW$T$76
    1819                    
    1820                    
    1821                    $C$DW$T$77      .dwtag  DW_TAG_array_type
    1822                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$20)
    1823                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1824                            .dwattr $C$DW$T$77, DW_AT_byte_size(0x2d0)
    1825                    $C$DW$117       .dwtag  DW_TAG_subrange_type
    1826                            .dwattr $C$DW$117, DW_AT_upper_bound(0xb3)
    1827                    
    1828                            .dwendtag $C$DW$T$77
    1829                    
    1830                    
    1831                    $C$DW$T$86      .dwtag  DW_TAG_array_type
    1832                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$20)
    1833                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1834                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x18)
    1835                    $C$DW$118       .dwtag  DW_TAG_subrange_type
    1836                            .dwattr $C$DW$118, DW_AT_upper_bound(0x05)
    1837                    
    1838                            .dwendtag $C$DW$T$86
    1839                    
    1840                    
    1841                    $C$DW$T$87      .dwtag  DW_TAG_array_type
    1842                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$20)
    1843                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1844                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x70)
    1845                    $C$DW$119       .dwtag  DW_TAG_subrange_type
    1846                            .dwattr $C$DW$119, DW_AT_upper_bound(0x1b)
    1847                    
    1848                            .dwendtag $C$DW$T$87
    1849                    
    1850                    
    1851                    $C$DW$T$89      .dwtag  DW_TAG_array_type
    1852                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$20)
    1853                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1854                            .dwattr $C$DW$T$89, DW_AT_byte_size(0xec)
    1855                    $C$DW$120       .dwtag  DW_TAG_subrange_type
    1856                            .dwattr $C$DW$120, DW_AT_upper_bound(0x3a)
    1857                    
    1858                            .dwendtag $C$DW$T$89
    1859                    
    1860                    
    1861                    $C$DW$T$90      .dwtag  DW_TAG_array_type
    1862                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$20)
    1863                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1864                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x60)
    1865                    $C$DW$121       .dwtag  DW_TAG_subrange_type
    1866                            .dwattr $C$DW$121, DW_AT_upper_bound(0x17)
    1867                    
    1868                            .dwendtag $C$DW$T$90
    1869                    
    1870                    $C$DW$T$130     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:05:31 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0664410                              PAGE   35

