TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 22:33:09 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../src/ROLM.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                            .global ROLMBUS
      14                            .common ROLMBUS,4,4
      15                    $C$DW$1 .dwtag  DW_TAG_variable

     281                            .dwattr $C$DW$11, DW_AT_location[DW_OP_breg13 0]
     282                    
     283                            .dwpsn  file "../src/ROLM.c",line 57,column 15,is_stmt,isa 2
     284 000000bc E59FC048          LDR       V9, $C$CON8           ; [DPU_4_PIPE0] |57| 
     285 000000c0 E59CC000          LDR       V9, [V9, #0]          ; [DPU_4_PIPE0] |57| 
     286 000000c4 E7DFC79F          BFC       V9, #15, #17          ; [DPU_4_PIPE0] |57| 
     287 000000c8 E1CDC0B0          STRH      V9, [SP, #0]          ; [DPU_4_PIPE0] |57| 
     288                            .dwpsn  file "../src/ROLM.c",line 58,column 2,is_stmt,isa 2
     289 000000cc E59FC038          LDR       V9, $C$CON8           ; [DPU_4_PIPE0] |58| 
     290 000000d0 E59C0000          LDR       A1, [V9, #0]          ; [DPU_4_PIPE0] |58| 
     291 000000d4 E1DDC0B0          LDRH      V9, [SP, #0]          ; [DPU_4_PIPE0] |58| 
     292 000000d8 E2000801          AND       A1, A1, #65536        ; [DPU_4_PIPE0] |58| 
     293 000000dc E180C00C          ORR       V9, A1, V9            ; [DPU_4_PIPE0] |58| 
     294 000000e0 E1CDC0B0          STRH      V9, [SP, #0]          ; [DPU_4_PIPE0] |58| 
     295                            .dwpsn  file "../src/ROLM.c",line 59,column 2,is_stmt,isa 2
     296 000000e4 E1DD00B0          LDRH      A1, [SP, #0]          ; [DPU_4_PIPE0] |59| 
     297                            .dwpsn  file "../src/ROLM.c",line 60,column 1,is_stmt,isa 2
     298 000000e8 E28DD008          ADD       SP, SP, #8            ; [DPU_4_PIPE0] 
     299                            .dwcfi  cfa_offset, 0
     300                    $C$DW$12        .dwtag  DW_TAG_TI_branch
     301                            .dwattr $C$DW$12, DW_AT_low_pc(0x00)
     302                            .dwattr $C$DW$12, DW_AT_TI_return
     303                    
     304 000000ec E12FFF1E          BX        LR                    ; [DPU_4_PIPE1] 
     305                            ; BRANCH OCCURS                  ; [] 
     306                            .dwattr $C$DW$10, DW_AT_TI_end_file("../src/ROLM.c")
     307                            .dwattr $C$DW$10, DW_AT_TI_end_line(0x3c)
     308                            .dwattr $C$DW$10, DW_AT_TI_end_column(0x01)
     309                            .dwendentry
     310                            .dwendtag $C$DW$10
     311                    
     312                    ;******************************************************************************
     313                    ;* CONSTANT TABLE                                                             *
     314                    ;******************************************************************************
     315 000000f0                   .sect   ".text"
     316                            .align  4
     317 000000f0 FFF7B900  ||$C$CON1||:    .bits   -542464,32
     318                            .align  4
     319 000000f4 FFF7B94C  ||$C$CON2||:    .bits   -542388,32
     320                            .align  4
     321 000000f8 FFF7B954  ||$C$CON3||:    .bits   -542380,32
     322                            .align  4
     323 000000fc FFF7B800  ||$C$CON4||:    .bits   -542720,32
     324                            .align  4
     325 00000100 FFF7B84C  ||$C$CON5||:    .bits   -542644,32
     326                            .align  4
     327 00000104 FFFE8000  ||$C$CON6||:    .bits   -98304,32
     328                            .align  4
     329 00000108 00000000! ||$C$CON7||:    .bits   ROLMBUS,32
     330                            .align  4
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE    7

     331 0000010c FFF7B850  ||$C$CON8||:    .bits   -542640,32
     332                    
     333                    ;******************************************************************************
     334                    ;* BUILD ATTRIBUTES                                                           *
     335                    ;******************************************************************************
     336                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     337                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     338                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     339                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     340                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     341                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
     342                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     343                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     344                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
     345                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     346                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     347                    
     348                    ;******************************************************************************
     349                    ;* TYPE INFORMATION                                                           *
     350                    ;******************************************************************************
     351                    
     352                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     353                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
     354                    $C$DW$13        .dwtag  DW_TAG_member
     355                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$10)
     356                            .dwattr $C$DW$13, DW_AT_name("fd")
     357                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("fd")
     358                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     359                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     360                            .dwattr $C$DW$13, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     361                            .dwattr $C$DW$13, DW_AT_decl_line(0x5c)
     362                            .dwattr $C$DW$13, DW_AT_decl_column(0x0b)
     363                    
     364                    $C$DW$14        .dwtag  DW_TAG_member
     365                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     366                            .dwattr $C$DW$14, DW_AT_name("buf")
     367                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("buf")
     368                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     369                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     370                            .dwattr $C$DW$14, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     371                            .dwattr $C$DW$14, DW_AT_decl_line(0x5d)
     372                            .dwattr $C$DW$14, DW_AT_decl_column(0x16)
     373                    
     374                    $C$DW$15        .dwtag  DW_TAG_member
     375                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     376                            .dwattr $C$DW$15, DW_AT_name("pos")
     377                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("pos")
     378                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     379                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     380                            .dwattr $C$DW$15, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     381                            .dwattr $C$DW$15, DW_AT_decl_line(0x5e)
     382                            .dwattr $C$DW$15, DW_AT_decl_column(0x16)
     383                    
     384                    $C$DW$16        .dwtag  DW_TAG_member
     385                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE    8

     386                            .dwattr $C$DW$16, DW_AT_name("bufend")
     387                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("bufend")
     388                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     389                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     390                            .dwattr $C$DW$16, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     391                            .dwattr $C$DW$16, DW_AT_decl_line(0x5f)
     392                            .dwattr $C$DW$16, DW_AT_decl_column(0x16)
     393                    
     394                    $C$DW$17        .dwtag  DW_TAG_member
     395                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     396                            .dwattr $C$DW$17, DW_AT_name("buff_stop")
     397                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("buff_stop")
     398                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     399                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     400                            .dwattr $C$DW$17, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     401                            .dwattr $C$DW$17, DW_AT_decl_line(0x60)
     402                            .dwattr $C$DW$17, DW_AT_decl_column(0x16)
     403                    
     404                    $C$DW$18        .dwtag  DW_TAG_member
     405                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     406                            .dwattr $C$DW$18, DW_AT_name("flags")
     407                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("flags")
     408                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     409                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     410                            .dwattr $C$DW$18, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     411                            .dwattr $C$DW$18, DW_AT_decl_line(0x61)
     412                            .dwattr $C$DW$18, DW_AT_decl_column(0x16)
     413                    
     414                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     415                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5b)
     416                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     417                            .dwendtag $C$DW$T$20
     418                    
     419                    $C$DW$T$52      .dwtag  DW_TAG_typedef
     420                            .dwattr $C$DW$T$52, DW_AT_name("FILE")
     421                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$20)
     422                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
     423                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     424                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x62)
     425                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
     426                    
     427                    
     428                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
     429                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
     430                    $C$DW$19        .dwtag  DW_TAG_member
     431                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$21)
     432                            .dwattr $C$DW$19, DW_AT_name("PSxMSTID_L")
     433                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("PSxMSTID_L")
     434                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     435                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     436                            .dwattr $C$DW$19, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     437                            .dwattr $C$DW$19, DW_AT_decl_line(0xe7)
     438                            .dwattr $C$DW$19, DW_AT_decl_column(0x12)
     439                    
     440                    $C$DW$20        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE    9

     441                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$21)
     442                            .dwattr $C$DW$20, DW_AT_name("PSxMSTID_H")
     443                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("PSxMSTID_H")
     444                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     445                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     446                            .dwattr $C$DW$20, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     447                            .dwattr $C$DW$20, DW_AT_decl_line(0xe8)
     448                            .dwattr $C$DW$20, DW_AT_decl_column(0x12)
     449                    
     450                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
     451                            .dwattr $C$DW$T$22, DW_AT_decl_line(0xe6)
     452                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x05)
     453                            .dwendtag $C$DW$T$22
     454                    
     455                    
     456                    $C$DW$T$44      .dwtag  DW_TAG_array_type
     457                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$22)
     458                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     459                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x100)
     460                    $C$DW$21        .dwtag  DW_TAG_subrange_type
     461                            .dwattr $C$DW$21, DW_AT_upper_bound(0x1f)
     462                    
     463                            .dwendtag $C$DW$T$44
     464                    
     465                    
     466                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
     467                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     468                    $C$DW$22        .dwtag  DW_TAG_member
     469                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
     470                            .dwattr $C$DW$22, DW_AT_name("PPSxMSTID_L")
     471                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("PPSxMSTID_L")
     472                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     473                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     474                            .dwattr $C$DW$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     475                            .dwattr $C$DW$22, DW_AT_decl_line(0xec)
     476                            .dwattr $C$DW$22, DW_AT_decl_column(0x12)
     477                    
     478                    $C$DW$23        .dwtag  DW_TAG_member
     479                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$21)
     480                            .dwattr $C$DW$23, DW_AT_name("PPSxMSTID_H")
     481                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("PPSxMSTID_H")
     482                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     483                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     484                            .dwattr $C$DW$23, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     485                            .dwattr $C$DW$23, DW_AT_decl_line(0xed)
     486                            .dwattr $C$DW$23, DW_AT_decl_column(0x12)
     487                    
     488                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
     489                            .dwattr $C$DW$T$23, DW_AT_decl_line(0xeb)
     490                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x05)
     491                            .dwendtag $C$DW$T$23
     492                    
     493                    
     494                    $C$DW$T$45      .dwtag  DW_TAG_array_type
     495                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   10

     496                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
     497                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
     498                    $C$DW$24        .dwtag  DW_TAG_subrange_type
     499                            .dwattr $C$DW$24, DW_AT_upper_bound(0x07)
     500                    
     501                            .dwendtag $C$DW$T$45
     502                    
     503                    
     504                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
     505                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     506                    $C$DW$25        .dwtag  DW_TAG_member
     507                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$21)
     508                            .dwattr $C$DW$25, DW_AT_name("PPSExMSTID_L")
     509                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("PPSExMSTID_L")
     510                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     511                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     512                            .dwattr $C$DW$25, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     513                            .dwattr $C$DW$25, DW_AT_decl_line(0xf1)
     514                            .dwattr $C$DW$25, DW_AT_decl_column(0x12)
     515                    
     516                    $C$DW$26        .dwtag  DW_TAG_member
     517                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$21)
     518                            .dwattr $C$DW$26, DW_AT_name("PPSExMSTID_H")
     519                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("PPSExMSTID_H")
     520                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     521                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     522                            .dwattr $C$DW$26, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     523                            .dwattr $C$DW$26, DW_AT_decl_line(0xf2)
     524                            .dwattr $C$DW$26, DW_AT_decl_column(0x12)
     525                    
     526                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
     527                            .dwattr $C$DW$T$24, DW_AT_decl_line(0xf0)
     528                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x05)
     529                            .dwendtag $C$DW$T$24
     530                    
     531                    
     532                    $C$DW$T$46      .dwtag  DW_TAG_array_type
     533                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$24)
     534                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     535                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x100)
     536                    $C$DW$27        .dwtag  DW_TAG_subrange_type
     537                            .dwattr $C$DW$27, DW_AT_upper_bound(0x1f)
     538                    
     539                            .dwendtag $C$DW$T$46
     540                    
     541                    
     542                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
     543                            .dwattr $C$DW$T$27, DW_AT_name("ROLMIO_struct")
     544                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
     545                    $C$DW$28        .dwtag  DW_TAG_member
     546                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$25)
     547                            .dwattr $C$DW$28, DW_AT_name("DIN")
     548                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("DIN")
     549                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   11

     551                            .dwattr $C$DW$28, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     552                            .dwattr $C$DW$28, DW_AT_decl_line(0x32)
     553                            .dwattr $C$DW$28, DW_AT_decl_column(0x0b)
     554                    
     555                    $C$DW$29        .dwtag  DW_TAG_member
     556                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$25)
     557                            .dwattr $C$DW$29, DW_AT_name("DOUT")
     558                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("DOUT")
     559                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     560                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     561                            .dwattr $C$DW$29, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     562                            .dwattr $C$DW$29, DW_AT_decl_line(0x33)
     563                            .dwattr $C$DW$29, DW_AT_decl_column(0x0b)
     564                    
     565                    $C$DW$30        .dwtag  DW_TAG_member
     566                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$25)
     567                            .dwattr $C$DW$30, DW_AT_name("DS")
     568                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("DS")
     569                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     570                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     571                            .dwattr $C$DW$30, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     572                            .dwattr $C$DW$30, DW_AT_decl_line(0x34)
     573                            .dwattr $C$DW$30, DW_AT_decl_column(0x0b)
     574                    
     575                    $C$DW$31        .dwtag  DW_TAG_member
     576                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$26)
     577                            .dwattr $C$DW$31, DW_AT_name("DATOA")
     578                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("DATOA")
     579                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     580                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     581                            .dwattr $C$DW$31, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     582                            .dwattr $C$DW$31, DW_AT_decl_line(0x35)
     583                            .dwattr $C$DW$31, DW_AT_decl_column(0x0c)
     584                    
     585                    $C$DW$32        .dwtag  DW_TAG_member
     586                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$26)
     587                            .dwattr $C$DW$32, DW_AT_name("DATOB")
     588                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("DATOB")
     589                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     590                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     591                            .dwattr $C$DW$32, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     592                            .dwattr $C$DW$32, DW_AT_decl_line(0x36)
     593                            .dwattr $C$DW$32, DW_AT_decl_column(0x0c)
     594                    
     595                    $C$DW$33        .dwtag  DW_TAG_member
     596                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$26)
     597                            .dwattr $C$DW$33, DW_AT_name("DATOC")
     598                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("DATOC")
     599                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     600                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     601                            .dwattr $C$DW$33, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     602                            .dwattr $C$DW$33, DW_AT_decl_line(0x37)
     603                            .dwattr $C$DW$33, DW_AT_decl_column(0x0c)
     604                    
     605                    $C$DW$34        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   12

     606                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$26)
     607                            .dwattr $C$DW$34, DW_AT_name("DATIA")
     608                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("DATIA")
     609                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     610                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     611                            .dwattr $C$DW$34, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     612                            .dwattr $C$DW$34, DW_AT_decl_line(0x38)
     613                            .dwattr $C$DW$34, DW_AT_decl_column(0x0c)
     614                    
     615                    $C$DW$35        .dwtag  DW_TAG_member
     616                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$26)
     617                            .dwattr $C$DW$35, DW_AT_name("DATIB")
     618                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("DATIB")
     619                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     620                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     621                            .dwattr $C$DW$35, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     622                            .dwattr $C$DW$35, DW_AT_decl_line(0x39)
     623                            .dwattr $C$DW$35, DW_AT_decl_column(0x0c)
     624                    
     625                    $C$DW$36        .dwtag  DW_TAG_member
     626                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$26)
     627                            .dwattr $C$DW$36, DW_AT_name("DATIC")
     628                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("DATIC")
     629                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     630                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     631                            .dwattr $C$DW$36, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     632                            .dwattr $C$DW$36, DW_AT_decl_line(0x3a)
     633                            .dwattr $C$DW$36, DW_AT_decl_column(0x0c)
     634                    
     635                    $C$DW$37        .dwtag  DW_TAG_member
     636                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$26)
     637                            .dwattr $C$DW$37, DW_AT_name("STRT")
     638                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("STRT")
     639                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     640                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     641                            .dwattr $C$DW$37, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     642                            .dwattr $C$DW$37, DW_AT_decl_line(0x3b)
     643                            .dwattr $C$DW$37, DW_AT_decl_column(0x0c)
     644                    
     645                    $C$DW$38        .dwtag  DW_TAG_member
     646                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$26)
     647                            .dwattr $C$DW$38, DW_AT_name("CLR")
     648                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("CLR")
     649                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     650                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     651                            .dwattr $C$DW$38, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     652                            .dwattr $C$DW$38, DW_AT_decl_line(0x3c)
     653                            .dwattr $C$DW$38, DW_AT_decl_column(0x0c)
     654                    
     655                    $C$DW$39        .dwtag  DW_TAG_member
     656                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$26)
     657                            .dwattr $C$DW$39, DW_AT_name("IOPLS")
     658                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("IOPLS")
     659                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     660                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   13

     661                            .dwattr $C$DW$39, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     662                            .dwattr $C$DW$39, DW_AT_decl_line(0x3d)
     663                            .dwattr $C$DW$39, DW_AT_decl_column(0x0c)
     664                    
     665                    $C$DW$40        .dwtag  DW_TAG_member
     666                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$26)
     667                            .dwattr $C$DW$40, DW_AT_name("SELB")
     668                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("SELB")
     669                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     670                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     671                            .dwattr $C$DW$40, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     672                            .dwattr $C$DW$40, DW_AT_decl_line(0x3e)
     673                            .dwattr $C$DW$40, DW_AT_decl_column(0x0c)
     674                    
     675                    $C$DW$41        .dwtag  DW_TAG_member
     676                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$26)
     677                            .dwattr $C$DW$41, DW_AT_name("SELD")
     678                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("SELD")
     679                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     680                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     681                            .dwattr $C$DW$41, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     682                            .dwattr $C$DW$41, DW_AT_decl_line(0x3f)
     683                            .dwattr $C$DW$41, DW_AT_decl_column(0x0c)
     684                    
     685                    $C$DW$42        .dwtag  DW_TAG_member
     686                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$26)
     687                            .dwattr $C$DW$42, DW_AT_name("IORST")
     688                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("IORST")
     689                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     690                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     691                            .dwattr $C$DW$42, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     692                            .dwattr $C$DW$42, DW_AT_decl_line(0x40)
     693                            .dwattr $C$DW$42, DW_AT_decl_column(0x0c)
     694                    
     695                    $C$DW$43        .dwtag  DW_TAG_member
     696                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$26)
     697                            .dwattr $C$DW$43, DW_AT_name("INTR")
     698                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("INTR")
     699                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     700                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     701                            .dwattr $C$DW$43, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     702                            .dwattr $C$DW$43, DW_AT_decl_line(0x41)
     703                            .dwattr $C$DW$43, DW_AT_decl_column(0x0c)
     704                    
     705                    $C$DW$44        .dwtag  DW_TAG_member
     706                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$26)
     707                            .dwattr $C$DW$44, DW_AT_name("INTA")
     708                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("INTA")
     709                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     710                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     711                            .dwattr $C$DW$44, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     712                            .dwattr $C$DW$44, DW_AT_decl_line(0x42)
     713                            .dwattr $C$DW$44, DW_AT_decl_column(0x0c)
     714                    
     715                    $C$DW$45        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   14

     716                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$26)
     717                            .dwattr $C$DW$45, DW_AT_name("INTP")
     718                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("INTP")
     719                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     720                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     721                            .dwattr $C$DW$45, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     722                            .dwattr $C$DW$45, DW_AT_decl_line(0x43)
     723                            .dwattr $C$DW$45, DW_AT_decl_column(0x0c)
     724                    
     725                    $C$DW$46        .dwtag  DW_TAG_member
     726                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$26)
     727                            .dwattr $C$DW$46, DW_AT_name("MSKO")
     728                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("MSKO")
     729                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     730                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     731                            .dwattr $C$DW$46, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     732                            .dwattr $C$DW$46, DW_AT_decl_line(0x44)
     733                            .dwattr $C$DW$46, DW_AT_decl_column(0x0c)
     734                    
     735                    $C$DW$47        .dwtag  DW_TAG_member
     736                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$26)
     737                            .dwattr $C$DW$47, DW_AT_name("RQENB")
     738                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("RQENB")
     739                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     740                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     741                            .dwattr $C$DW$47, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     742                            .dwattr $C$DW$47, DW_AT_decl_line(0x45)
     743                            .dwattr $C$DW$47, DW_AT_decl_column(0x0c)
     744                    
     745                    $C$DW$48        .dwtag  DW_TAG_member
     746                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$26)
     747                            .dwattr $C$DW$48, DW_AT_name("DCHR")
     748                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("DCHR")
     749                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     750                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     751                            .dwattr $C$DW$48, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     752                            .dwattr $C$DW$48, DW_AT_decl_line(0x46)
     753                            .dwattr $C$DW$48, DW_AT_decl_column(0x0c)
     754                    
     755                    $C$DW$49        .dwtag  DW_TAG_member
     756                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$26)
     757                            .dwattr $C$DW$49, DW_AT_name("DCHA")
     758                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("DCHA")
     759                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     760                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     761                            .dwattr $C$DW$49, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     762                            .dwattr $C$DW$49, DW_AT_decl_line(0x47)
     763                            .dwattr $C$DW$49, DW_AT_decl_column(0x0c)
     764                    
     765                    $C$DW$50        .dwtag  DW_TAG_member
     766                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$26)
     767                            .dwattr $C$DW$50, DW_AT_name("DCHP")
     768                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("DCHP")
     769                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     770                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   15

     771                            .dwattr $C$DW$50, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     772                            .dwattr $C$DW$50, DW_AT_decl_line(0x48)
     773                            .dwattr $C$DW$50, DW_AT_decl_column(0x0c)
     774                    
     775                    $C$DW$51        .dwtag  DW_TAG_member
     776                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$26)
     777                            .dwattr $C$DW$51, DW_AT_name("DCHM0")
     778                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DCHM0")
     779                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     780                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     781                            .dwattr $C$DW$51, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     782                            .dwattr $C$DW$51, DW_AT_decl_line(0x49)
     783                            .dwattr $C$DW$51, DW_AT_decl_column(0x0c)
     784                    
     785                    $C$DW$52        .dwtag  DW_TAG_member
     786                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$26)
     787                            .dwattr $C$DW$52, DW_AT_name("DCHM1")
     788                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("DCHM1")
     789                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     790                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     791                            .dwattr $C$DW$52, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     792                            .dwattr $C$DW$52, DW_AT_decl_line(0x4a)
     793                            .dwattr $C$DW$52, DW_AT_decl_column(0x0c)
     794                    
     795                    $C$DW$53        .dwtag  DW_TAG_member
     796                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$26)
     797                            .dwattr $C$DW$53, DW_AT_name("DCHS")
     798                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("DCHS")
     799                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     800                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     801                            .dwattr $C$DW$53, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     802                            .dwattr $C$DW$53, DW_AT_decl_line(0x4b)
     803                            .dwattr $C$DW$53, DW_AT_decl_column(0x0c)
     804                    
     805                    $C$DW$54        .dwtag  DW_TAG_member
     806                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$26)
     807                            .dwattr $C$DW$54, DW_AT_name("DCHO")
     808                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("DCHO")
     809                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     810                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     811                            .dwattr $C$DW$54, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     812                            .dwattr $C$DW$54, DW_AT_decl_line(0x4c)
     813                            .dwattr $C$DW$54, DW_AT_decl_column(0x0c)
     814                    
     815                    $C$DW$55        .dwtag  DW_TAG_member
     816                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$26)
     817                            .dwattr $C$DW$55, DW_AT_name("OVFLO")
     818                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("OVFLO")
     819                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     820                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     821                            .dwattr $C$DW$55, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     822                            .dwattr $C$DW$55, DW_AT_decl_line(0x4d)
     823                            .dwattr $C$DW$55, DW_AT_decl_column(0x0c)
     824                    
     825                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   16

     826                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x31)
     827                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x19)
     828                            .dwendtag $C$DW$T$27
     829                    
     830                    $C$DW$T$53      .dwtag  DW_TAG_volatile_type
     831                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
     832                    
     833                    $C$DW$T$54      .dwtag  DW_TAG_typedef
     834                            .dwattr $C$DW$T$54, DW_AT_name("ROLMIO_t")
     835                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
     836                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
     837                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
     838                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x4e)
     839                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x03)
     840                    
     841                    $C$DW$T$55      .dwtag  DW_TAG_pointer_type
     842                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
     843                            .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
     844                    
     845                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     846                            .dwattr $C$DW$T$2, DW_AT_name("void")
     847                    
     848                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     849                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     850                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     851                    
     852                    $C$DW$T$4       .dwtag  DW_TAG_base_type
     853                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     854                            .dwattr $C$DW$T$4, DW_AT_name("bool")
     855                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     856                    
     857                    $C$DW$T$5       .dwtag  DW_TAG_base_type
     858                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     859                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
     860                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     861                    
     862                    $C$DW$T$58      .dwtag  DW_TAG_typedef
     863                            .dwattr $C$DW$T$58, DW_AT_name("int8_t")
     864                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$5)
     865                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     866                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     867                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x2a)
     868                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x1d)
     869                    
     870                    $C$DW$T$59      .dwtag  DW_TAG_typedef
     871                            .dwattr $C$DW$T$59, DW_AT_name("int_least8_t")
     872                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
     873                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     874                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     875                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x37)
     876                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x17)
     877                    
     878                    $C$DW$T$6       .dwtag  DW_TAG_base_type
     879                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     880                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   17

     881                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     882                    
     883                    $C$DW$T$19      .dwtag  DW_TAG_pointer_type
     884                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
     885                            .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
     886                    
     887                    $C$DW$T$26      .dwtag  DW_TAG_typedef
     888                            .dwattr $C$DW$T$26, DW_AT_name("uint8_t")
     889                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$6)
     890                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     891                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     892                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x2b)
     893                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1c)
     894                    
     895                    $C$DW$T$60      .dwtag  DW_TAG_typedef
     896                            .dwattr $C$DW$T$60, DW_AT_name("uint_least8_t")
     897                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$26)
     898                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
     899                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     900                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x38)
     901                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x16)
     902                    
     903                    $C$DW$T$7       .dwtag  DW_TAG_base_type
     904                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     905                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     906                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
     907                    
     908                    $C$DW$T$8       .dwtag  DW_TAG_base_type
     909                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     910                            .dwattr $C$DW$T$8, DW_AT_name("short")
     911                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
     912                    
     913                    $C$DW$T$61      .dwtag  DW_TAG_typedef
     914                            .dwattr $C$DW$T$61, DW_AT_name("int16_t")
     915                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$8)
     916                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     917                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     918                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x2c)
     919                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x1d)
     920                    
     921                    $C$DW$T$62      .dwtag  DW_TAG_typedef
     922                            .dwattr $C$DW$T$62, DW_AT_name("int_least16_t")
     923                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
     924                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     925                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     926                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x3a)
     927                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x17)
     928                    
     929                    $C$DW$T$9       .dwtag  DW_TAG_base_type
     930                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     931                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     932                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
     933                    
     934                    $C$DW$T$25      .dwtag  DW_TAG_typedef
     935                            .dwattr $C$DW$T$25, DW_AT_name("uint16_t")
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   18

     936                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$9)
     937                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     938                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     939                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x2d)
     940                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x1c)
     941                    
     942                    $C$DW$T$65      .dwtag  DW_TAG_typedef
     943                            .dwattr $C$DW$T$65, DW_AT_name("uint_least16_t")
     944                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$25)
     945                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     946                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     947                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x3b)
     948                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x16)
     949                    
     950                    $C$DW$T$10      .dwtag  DW_TAG_base_type
     951                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     952                            .dwattr $C$DW$T$10, DW_AT_name("int")
     953                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
     954                    
     955                    $C$DW$T$66      .dwtag  DW_TAG_typedef
     956                            .dwattr $C$DW$T$66, DW_AT_name("int32_t")
     957                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$10)
     958                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     959                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     960                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x2e)
     961                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x1d)
     962                    
     963                    $C$DW$T$67      .dwtag  DW_TAG_typedef
     964                            .dwattr $C$DW$T$67, DW_AT_name("int_fast16_t")
     965                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
     966                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     967                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     968                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x47)
     969                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x17)
     970                    
     971                    $C$DW$T$68      .dwtag  DW_TAG_typedef
     972                            .dwattr $C$DW$T$68, DW_AT_name("int_fast32_t")
     973                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$66)
     974                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     975                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     976                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x4a)
     977                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x17)
     978                    
     979                    $C$DW$T$69      .dwtag  DW_TAG_typedef
     980                            .dwattr $C$DW$T$69, DW_AT_name("int_fast8_t")
     981                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$66)
     982                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     983                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     984                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x45)
     985                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x17)
     986                    
     987                    $C$DW$T$70      .dwtag  DW_TAG_typedef
     988                            .dwattr $C$DW$T$70, DW_AT_name("int_least32_t")
     989                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$66)
     990                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   19

     991                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     992                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x3c)
     993                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x17)
     994                    
     995                    $C$DW$T$71      .dwtag  DW_TAG_typedef
     996                            .dwattr $C$DW$T$71, DW_AT_name("intptr_t")
     997                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$10)
     998                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     999                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1000                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x52)
    1001                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x1a)
    1002                    
    1003                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    1004                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1005                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1006                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1007                    
    1008                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    1009                            .dwattr $C$DW$T$72, DW_AT_name("size_t")
    1010                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$11)
    1011                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1012                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1013                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x58)
    1014                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x19)
    1015                    
    1016                    $C$DW$T$21      .dwtag  DW_TAG_typedef
    1017                            .dwattr $C$DW$T$21, DW_AT_name("uint32_t")
    1018                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$11)
    1019                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1020                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1021                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x2f)
    1022                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)
    1023                    
    1024                    
    1025                    $C$DW$T$32      .dwtag  DW_TAG_array_type
    1026                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$21)
    1027                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1028                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x1c)
    1029                    $C$DW$56        .dwtag  DW_TAG_subrange_type
    1030                            .dwattr $C$DW$56, DW_AT_upper_bound(0x06)
    1031                    
    1032                            .dwendtag $C$DW$T$32
    1033                    
    1034                    
    1035                    $C$DW$T$33      .dwtag  DW_TAG_array_type
    1036                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$21)
    1037                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1038                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x14)
    1039                    $C$DW$57        .dwtag  DW_TAG_subrange_type
    1040                            .dwattr $C$DW$57, DW_AT_upper_bound(0x04)
    1041                    
    1042                            .dwendtag $C$DW$T$33
    1043                    
    1044                    
    1045                    $C$DW$T$34      .dwtag  DW_TAG_array_type
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   20

    1046                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$21)
    1047                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1048                            .dwattr $C$DW$T$34, DW_AT_byte_size(0xa0)
    1049                    $C$DW$58        .dwtag  DW_TAG_subrange_type
    1050                            .dwattr $C$DW$58, DW_AT_upper_bound(0x27)
    1051                    
    1052                            .dwendtag $C$DW$T$34
    1053                    
    1054                    
    1055                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    1056                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$21)
    1057                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1058                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    1059                    $C$DW$59        .dwtag  DW_TAG_subrange_type
    1060                            .dwattr $C$DW$59, DW_AT_upper_bound(0x03)
    1061                    
    1062                            .dwendtag $C$DW$T$35
    1063                    
    1064                    
    1065                    $C$DW$T$36      .dwtag  DW_TAG_array_type
    1066                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$21)
    1067                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1068                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x98)
    1069                    $C$DW$60        .dwtag  DW_TAG_subrange_type
    1070                            .dwattr $C$DW$60, DW_AT_upper_bound(0x25)
    1071                    
    1072                            .dwendtag $C$DW$T$36
    1073                    
    1074                    
    1075                    $C$DW$T$37      .dwtag  DW_TAG_array_type
    1076                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$21)
    1077                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1078                            .dwattr $C$DW$T$37, DW_AT_byte_size(0xa8)
    1079                    $C$DW$61        .dwtag  DW_TAG_subrange_type
    1080                            .dwattr $C$DW$61, DW_AT_upper_bound(0x29)
    1081                    
    1082                            .dwendtag $C$DW$T$37
    1083                    
    1084                    
    1085                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    1086                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$21)
    1087                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1088                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x50)
    1089                    $C$DW$62        .dwtag  DW_TAG_subrange_type
    1090                            .dwattr $C$DW$62, DW_AT_upper_bound(0x13)
    1091                    
    1092                            .dwendtag $C$DW$T$38
    1093                    
    1094                    
    1095                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    1096                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$21)
    1097                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1098                            .dwattr $C$DW$T$39, DW_AT_byte_size(0xf0)
    1099                    $C$DW$63        .dwtag  DW_TAG_subrange_type
    1100                            .dwattr $C$DW$63, DW_AT_upper_bound(0x3b)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   21

    1101                    
    1102                            .dwendtag $C$DW$T$39
    1103                    
    1104                    
    1105                    $C$DW$T$41      .dwtag  DW_TAG_array_type
    1106                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
    1107                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1108                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    1109                    $C$DW$64        .dwtag  DW_TAG_subrange_type
    1110                            .dwattr $C$DW$64, DW_AT_upper_bound(0x01)
    1111                    
    1112                            .dwendtag $C$DW$T$41
    1113                    
    1114                    
    1115                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    1116                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$21)
    1117                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1118                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x138)
    1119                    $C$DW$65        .dwtag  DW_TAG_subrange_type
    1120                            .dwattr $C$DW$65, DW_AT_upper_bound(0x4d)
    1121                    
    1122                            .dwendtag $C$DW$T$42
    1123                    
    1124                    
    1125                    $C$DW$T$43      .dwtag  DW_TAG_array_type
    1126                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$21)
    1127                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1128                            .dwattr $C$DW$T$43, DW_AT_byte_size(0xf4)
    1129                    $C$DW$66        .dwtag  DW_TAG_subrange_type
    1130                            .dwattr $C$DW$66, DW_AT_upper_bound(0x3c)
    1131                    
    1132                            .dwendtag $C$DW$T$43
    1133                    
    1134                    
    1135                    $C$DW$T$47      .dwtag  DW_TAG_array_type
    1136                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$21)
    1137                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1138                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x80)
    1139                    $C$DW$67        .dwtag  DW_TAG_subrange_type
    1140                            .dwattr $C$DW$67, DW_AT_upper_bound(0x1f)
    1141                    
    1142                            .dwendtag $C$DW$T$47
    1143                    
    1144                    
    1145                    $C$DW$T$48      .dwtag  DW_TAG_array_type
    1146                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$21)
    1147                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1148                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x20)
    1149                    $C$DW$68        .dwtag  DW_TAG_subrange_type
    1150                            .dwattr $C$DW$68, DW_AT_upper_bound(0x07)
    1151                    
    1152                            .dwendtag $C$DW$T$48
    1153                    
    1154                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    1155                            .dwattr $C$DW$T$74, DW_AT_name("uint_fast16_t")
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   22

    1156                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$21)
    1157                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1158                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1159                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x48)
    1160                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x16)
    1161                    
    1162                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    1163                            .dwattr $C$DW$T$75, DW_AT_name("uint_fast32_t")
    1164                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$21)
    1165                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1166                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1167                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x4b)
    1168                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x16)
    1169                    
    1170                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    1171                            .dwattr $C$DW$T$76, DW_AT_name("uint_fast8_t")
    1172                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$21)
    1173                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1174                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1175                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x46)
    1176                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x16)
    1177                    
    1178                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    1179                            .dwattr $C$DW$T$77, DW_AT_name("uint_least32_t")
    1180                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$21)
    1181                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1182                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1183                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x3d)
    1184                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x16)
    1185                    
    1186                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1187                            .dwattr $C$DW$T$78, DW_AT_name("uintptr_t")
    1188                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$11)
    1189                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1190                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1191                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x53)
    1192                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x1a)
    1193                    
    1194                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1195                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1196                            .dwattr $C$DW$T$12, DW_AT_name("long")
    1197                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1198                    
    1199                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    1200                            .dwattr $C$DW$T$79, DW_AT_name("fpos_t")
    1201                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$12)
    1202                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1203                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1204                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x6e)
    1205                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x0e)
    1206                    
    1207                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    1208                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1209                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1210                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   23

    1211                    
    1212                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1213                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1214                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1215                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1216                    
    1217                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    1218                            .dwattr $C$DW$T$80, DW_AT_name("int64_t")
    1219                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$14)
    1220                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1221                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1222                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x32)
    1223                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x21)
    1224                    
    1225                    $C$DW$T$81      .dwtag  DW_TAG_typedef
    1226                            .dwattr $C$DW$T$81, DW_AT_name("int_fast64_t")
    1227                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1228                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1229                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1230                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x4e)
    1231                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x17)
    1232                    
    1233                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    1234                            .dwattr $C$DW$T$82, DW_AT_name("int_least64_t")
    1235                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$80)
    1236                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1237                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1238                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x40)
    1239                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x17)
    1240                    
    1241                    $C$DW$T$83      .dwtag  DW_TAG_typedef
    1242                            .dwattr $C$DW$T$83, DW_AT_name("intmax_t")
    1243                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$14)
    1244                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1245                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1246                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x56)
    1247                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x20)
    1248                    
    1249                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1250                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1251                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1252                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1253                    
    1254                    $C$DW$T$84      .dwtag  DW_TAG_typedef
    1255                            .dwattr $C$DW$T$84, DW_AT_name("uint64_t")
    1256                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$15)
    1257                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1258                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1259                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x33)
    1260                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x20)
    1261                    
    1262                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1263                            .dwattr $C$DW$T$85, DW_AT_name("uint_fast64_t")
    1264                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    1265                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   24

    1266                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1267                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x4f)
    1268                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x16)
    1269                    
    1270                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    1271                            .dwattr $C$DW$T$86, DW_AT_name("uint_least64_t")
    1272                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$84)
    1273                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1274                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1275                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x41)
    1276                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x16)
    1277                    
    1278                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    1279                            .dwattr $C$DW$T$87, DW_AT_name("uintmax_t")
    1280                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$15)
    1281                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1282                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1283                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x57)
    1284                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x20)
    1285                    
    1286                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1287                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1288                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1289                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1290                    
    1291                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1292                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1293                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1294                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1295                    
    1296                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1297                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1298                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1299                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1300                    
    1301                    
    1302                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1303                            .dwattr $C$DW$T$28, DW_AT_name("__va_list")
    1304                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1305                    $C$DW$69        .dwtag  DW_TAG_member
    1306                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$3)
    1307                            .dwattr $C$DW$69, DW_AT_name("__ap")
    1308                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("__ap")
    1309                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1310                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1311                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
    1312                            .dwattr $C$DW$69, DW_AT_decl_line(0x38)
    1313                            .dwattr $C$DW$69, DW_AT_decl_column(0x0c)
    1314                    
    1315                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1316                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x37)
    1317                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1318                            .dwendtag $C$DW$T$28
    1319                    
    1320                    $C$DW$T$88      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   25

    1321                            .dwattr $C$DW$T$88, DW_AT_name("va_list")
    1322                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$28)
    1323                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1324                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1325                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x39)
    1326                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1327                    
    1328                    
    1329                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1330                            .dwattr $C$DW$T$29, DW_AT_name("gioBase")
    1331                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x34)
    1332                    $C$DW$70        .dwtag  DW_TAG_member
    1333                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1334                            .dwattr $C$DW$70, DW_AT_name("GCR0")
    1335                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("GCR0")
    1336                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1338                            .dwattr $C$DW$70, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1339                            .dwattr $C$DW$70, DW_AT_decl_line(0x8b)
    1340                            .dwattr $C$DW$70, DW_AT_decl_column(0x0b)
    1341                    
    1342                    $C$DW$71        .dwtag  DW_TAG_member
    1343                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
    1344                            .dwattr $C$DW$71, DW_AT_name("rsvd1")
    1345                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("rsvd1")
    1346                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1347                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1348                            .dwattr $C$DW$71, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1349                            .dwattr $C$DW$71, DW_AT_decl_line(0x8c)
    1350                            .dwattr $C$DW$71, DW_AT_decl_column(0x0b)
    1351                    
    1352                    $C$DW$72        .dwtag  DW_TAG_member
    1353                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
    1354                            .dwattr $C$DW$72, DW_AT_name("INTDET")
    1355                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("INTDET")
    1356                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1357                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1358                            .dwattr $C$DW$72, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1359                            .dwattr $C$DW$72, DW_AT_decl_line(0x8d)
    1360                            .dwattr $C$DW$72, DW_AT_decl_column(0x0b)
    1361                    
    1362                    $C$DW$73        .dwtag  DW_TAG_member
    1363                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
    1364                            .dwattr $C$DW$73, DW_AT_name("POL")
    1365                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("POL")
    1366                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1367                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1368                            .dwattr $C$DW$73, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1369                            .dwattr $C$DW$73, DW_AT_decl_line(0x8e)
    1370                            .dwattr $C$DW$73, DW_AT_decl_column(0x0b)
    1371                    
    1372                    $C$DW$74        .dwtag  DW_TAG_member
    1373                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1374                            .dwattr $C$DW$74, DW_AT_name("ENASET")
    1375                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("ENASET")
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   26

    1376                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1377                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1378                            .dwattr $C$DW$74, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1379                            .dwattr $C$DW$74, DW_AT_decl_line(0x8f)
    1380                            .dwattr $C$DW$74, DW_AT_decl_column(0x0b)
    1381                    
    1382                    $C$DW$75        .dwtag  DW_TAG_member
    1383                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    1384                            .dwattr $C$DW$75, DW_AT_name("ENACLR")
    1385                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("ENACLR")
    1386                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1387                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1388                            .dwattr $C$DW$75, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1389                            .dwattr $C$DW$75, DW_AT_decl_line(0x90)
    1390                            .dwattr $C$DW$75, DW_AT_decl_column(0x0b)
    1391                    
    1392                    $C$DW$76        .dwtag  DW_TAG_member
    1393                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
    1394                            .dwattr $C$DW$76, DW_AT_name("LVLSET")
    1395                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("LVLSET")
    1396                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1397                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1398                            .dwattr $C$DW$76, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1399                            .dwattr $C$DW$76, DW_AT_decl_line(0x91)
    1400                            .dwattr $C$DW$76, DW_AT_decl_column(0x0b)
    1401                    
    1402                    $C$DW$77        .dwtag  DW_TAG_member
    1403                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
    1404                            .dwattr $C$DW$77, DW_AT_name("LVLCLR")
    1405                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("LVLCLR")
    1406                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1407                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1408                            .dwattr $C$DW$77, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1409                            .dwattr $C$DW$77, DW_AT_decl_line(0x92)
    1410                            .dwattr $C$DW$77, DW_AT_decl_column(0x0b)
    1411                    
    1412                    $C$DW$78        .dwtag  DW_TAG_member
    1413                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
    1414                            .dwattr $C$DW$78, DW_AT_name("FLG")
    1415                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("FLG")
    1416                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1417                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1418                            .dwattr $C$DW$78, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1419                            .dwattr $C$DW$78, DW_AT_decl_line(0x93)
    1420                            .dwattr $C$DW$78, DW_AT_decl_column(0x0b)
    1421                    
    1422                    $C$DW$79        .dwtag  DW_TAG_member
    1423                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1424                            .dwattr $C$DW$79, DW_AT_name("OFF1")
    1425                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("OFF1")
    1426                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1427                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1428                            .dwattr $C$DW$79, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1429                            .dwattr $C$DW$79, DW_AT_decl_line(0x94)
    1430                            .dwattr $C$DW$79, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   27

    1431                    
    1432                    $C$DW$80        .dwtag  DW_TAG_member
    1433                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1434                            .dwattr $C$DW$80, DW_AT_name("OFF2")
    1435                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("OFF2")
    1436                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1437                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1438                            .dwattr $C$DW$80, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1439                            .dwattr $C$DW$80, DW_AT_decl_line(0x95)
    1440                            .dwattr $C$DW$80, DW_AT_decl_column(0x0b)
    1441                    
    1442                    $C$DW$81        .dwtag  DW_TAG_member
    1443                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
    1444                            .dwattr $C$DW$81, DW_AT_name("EMU1")
    1445                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("EMU1")
    1446                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1447                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1448                            .dwattr $C$DW$81, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1449                            .dwattr $C$DW$81, DW_AT_decl_line(0x96)
    1450                            .dwattr $C$DW$81, DW_AT_decl_column(0x0b)
    1451                    
    1452                    $C$DW$82        .dwtag  DW_TAG_member
    1453                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1454                            .dwattr $C$DW$82, DW_AT_name("EMU2")
    1455                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("EMU2")
    1456                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1457                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1458                            .dwattr $C$DW$82, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1459                            .dwattr $C$DW$82, DW_AT_decl_line(0x97)
    1460                            .dwattr $C$DW$82, DW_AT_decl_column(0x0b)
    1461                    
    1462                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1463                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x8a)
    1464                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x1a)
    1465                            .dwendtag $C$DW$T$29
    1466                    
    1467                    $C$DW$T$89      .dwtag  DW_TAG_volatile_type
    1468                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$29)
    1469                    
    1470                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    1471                            .dwattr $C$DW$T$90, DW_AT_name("gioBase_t")
    1472                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1473                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1474                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1475                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x98)
    1476                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    1477                    
    1478                    
    1479                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1480                            .dwattr $C$DW$T$30, DW_AT_name("gioPort")
    1481                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x20)
    1482                    $C$DW$83        .dwtag  DW_TAG_member
    1483                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1484                            .dwattr $C$DW$83, DW_AT_name("DIR")
    1485                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("DIR")
TI ARM Assembler PC v16.9.0 Thu Feb 16 22:33:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0906010                              PAGE   28

    1486                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1488                            .dwattr $C$DW$83, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1489                            .dwattr $C$DW$83, DW_AT_decl_line(0xa2)
    1490                            .dwattr $C$DW$83, DW_AT_decl_column(0x0b)
    1491                    
    1492                    $C$DW$84        .dwtag  DW_TAG_member
    1493                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1494                            .dwattr $C$DW$84, DW_AT_name("DIN")
    1495                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("DIN")
    1496                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1497                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1498                            .dwattr $C$DW$84, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1499                            .dwattr $C$DW$84, DW_AT_decl_line(0xa3)
    1500                            .dwattr $C$DW$84, DW_AT_decl_column(0x0b)
    1501                    
    1502                    $C$DW$85        .dwtag  DW_TAG_member
    1503                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1504                            .dwattr $C$DW$85, DW_AT_name("DOUT")
    1505                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("DOUT")
    1506                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1507                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1508                            .dwattr $C$DW$85, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1509                            .dwattr $C$DW$85, DW_AT_decl_line(0xa4)
    1510                            .dwattr $C$DW$85, DW_AT_decl_column(0x0b)
    1511                    
    1512                    $C$DW$86        .dwtag  DW_TAG_member
    1513                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1514                            .dwattr $C$DW$86, DW_AT_name("DSET")
    1515                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("DSET")
    1516                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1517                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1518                            .dwattr $C$DW$86, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
