TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Sun Feb 19 14:51:36 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../src/ROLM.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                            .global ROLMBUS
      14                            .common ROLMBUS,32,2
      15                    $C$DW$1 .dwtag  DW_TAG_variable

     343 000000e8 E1CDC0B0          STRH      V9, [SP, #0]          ; [DPU_4_PIPE0] |77| 
     344                            .dwpsn  file "../src/ROLM.c",line 79,column 2,is_stmt,isa 2
     345 000000ec E59FC044          LDR       V9, $C$CON8           ; [DPU_4_PIPE0] |79| 
     346 000000f0 E59C0000          LDR       A1, [V9, #0]          ; [DPU_4_PIPE0] |79| 
     347 000000f4 E1DDC0B0          LDRH      V9, [SP, #0]          ; [DPU_4_PIPE0] |79| 
     348 000000f8 E2000801          AND       A1, A1, #65536        ; [DPU_4_PIPE0] |79| 
     349 000000fc E180C00C          ORR       V9, A1, V9            ; [DPU_4_PIPE0] |79| 
     350 00000100 E1CDC0B0          STRH      V9, [SP, #0]          ; [DPU_4_PIPE0] |79| 
     351                            .dwpsn  file "../src/ROLM.c",line 81,column 2,is_stmt,isa 2
     352 00000104 E59F0030          LDR       A1, $C$CON9           ; [DPU_4_PIPE0] |81| 
     353 00000108 E1DDC0B0          LDRH      V9, [SP, #0]          ; [DPU_4_PIPE0] |81| 
     354 0000010c E1C0C0B0          STRH      V9, [A1, #0]          ; [DPU_4_PIPE0] |81| 
     355                            .dwpsn  file "../src/ROLM.c",line 82,column 2,is_stmt,isa 2
     356 00000110 E1DD00B0          LDRH      A1, [SP, #0]          ; [DPU_4_PIPE0] |82| 
     357                            .dwpsn  file "../src/ROLM.c",line 83,column 1,is_stmt,isa 2
     358 00000114 E28DD008          ADD       SP, SP, #8            ; [DPU_4_PIPE0] 
     359                            .dwcfi  cfa_offset, 0
     360                    $C$DW$14        .dwtag  DW_TAG_TI_branch
     361                            .dwattr $C$DW$14, DW_AT_low_pc(0x00)
     362                            .dwattr $C$DW$14, DW_AT_TI_return
     363                    
     364 00000118 E12FFF1E          BX        LR                    ; [DPU_4_PIPE1] 
     365                            ; BRANCH OCCURS                  ; [] 
     366                            .dwattr $C$DW$12, DW_AT_TI_end_file("../src/ROLM.c")
     367                            .dwattr $C$DW$12, DW_AT_TI_end_line(0x53)
     368                            .dwattr $C$DW$12, DW_AT_TI_end_column(0x01)
     369                            .dwendentry
     370                            .dwendtag $C$DW$12
     371                    
     372                    ;******************************************************************************
     373                    ;* CONSTANT TABLE                                                             *
     374                    ;******************************************************************************
     375 0000011c                   .sect   ".text"
     376                            .align  4
     377 0000011c FFF7B900  ||$C$CON1||:    .bits   -542464,32
     378                            .align  4
     379 00000120 FFF7B94C  ||$C$CON2||:    .bits   -542388,32
     380                            .align  4
     381 00000124 FFF7B954  ||$C$CON3||:    .bits   -542380,32
     382                            .align  4
     383 00000128 FFF7B800  ||$C$CON4||:    .bits   -542720,32
     384                            .align  4
     385 0000012c FFF7B84C  ||$C$CON5||:    .bits   -542644,32
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE    8

     386                            .align  4
     387 00000130 FFFE8000  ||$C$CON6||:    .bits   -98304,32
     388                            .align  4
     389 00000134 00000002! ||$C$CON7||:    .bits   ROLMBUS+2,32
     390                            .align  4
     391 00000138 FFF7B850  ||$C$CON8||:    .bits   -542640,32
     392                            .align  4
     393 0000013c 00000000! ||$C$CON9||:    .bits   ROLMBUS,32
     394                    
     395                    ;******************************************************************************
     396                    ;* BUILD ATTRIBUTES                                                           *
     397                    ;******************************************************************************
     398                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     399                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     400                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     401                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     402                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     403                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
     404                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     405                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     406                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
     407                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     408                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     409                    
     410                    ;******************************************************************************
     411                    ;* TYPE INFORMATION                                                           *
     412                    ;******************************************************************************
     413                    
     414                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     415                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
     416                    $C$DW$15        .dwtag  DW_TAG_member
     417                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$10)
     418                            .dwattr $C$DW$15, DW_AT_name("fd")
     419                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("fd")
     420                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     421                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     422                            .dwattr $C$DW$15, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     423                            .dwattr $C$DW$15, DW_AT_decl_line(0x5c)
     424                            .dwattr $C$DW$15, DW_AT_decl_column(0x0b)
     425                    
     426                    $C$DW$16        .dwtag  DW_TAG_member
     427                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     428                            .dwattr $C$DW$16, DW_AT_name("buf")
     429                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("buf")
     430                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     431                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     432                            .dwattr $C$DW$16, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     433                            .dwattr $C$DW$16, DW_AT_decl_line(0x5d)
     434                            .dwattr $C$DW$16, DW_AT_decl_column(0x16)
     435                    
     436                    $C$DW$17        .dwtag  DW_TAG_member
     437                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     438                            .dwattr $C$DW$17, DW_AT_name("pos")
     439                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("pos")
     440                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE    9

     441                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     442                            .dwattr $C$DW$17, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     443                            .dwattr $C$DW$17, DW_AT_decl_line(0x5e)
     444                            .dwattr $C$DW$17, DW_AT_decl_column(0x16)
     445                    
     446                    $C$DW$18        .dwtag  DW_TAG_member
     447                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     448                            .dwattr $C$DW$18, DW_AT_name("bufend")
     449                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("bufend")
     450                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     451                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     452                            .dwattr $C$DW$18, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     453                            .dwattr $C$DW$18, DW_AT_decl_line(0x5f)
     454                            .dwattr $C$DW$18, DW_AT_decl_column(0x16)
     455                    
     456                    $C$DW$19        .dwtag  DW_TAG_member
     457                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     458                            .dwattr $C$DW$19, DW_AT_name("buff_stop")
     459                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("buff_stop")
     460                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     461                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     462                            .dwattr $C$DW$19, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     463                            .dwattr $C$DW$19, DW_AT_decl_line(0x60)
     464                            .dwattr $C$DW$19, DW_AT_decl_column(0x16)
     465                    
     466                    $C$DW$20        .dwtag  DW_TAG_member
     467                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     468                            .dwattr $C$DW$20, DW_AT_name("flags")
     469                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("flags")
     470                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     471                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     472                            .dwattr $C$DW$20, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
     473                            .dwattr $C$DW$20, DW_AT_decl_line(0x61)
     474                            .dwattr $C$DW$20, DW_AT_decl_column(0x16)
     475                    
     476                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     477                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5b)
     478                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     479                            .dwendtag $C$DW$T$20
     480                    
     481                    $C$DW$T$52      .dwtag  DW_TAG_typedef
     482                            .dwattr $C$DW$T$52, DW_AT_name("FILE")
     483                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$20)
     484                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
     485                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     486                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x62)
     487                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
     488                    
     489                    
     490                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
     491                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
     492                    $C$DW$21        .dwtag  DW_TAG_member
     493                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
     494                            .dwattr $C$DW$21, DW_AT_name("PSxMSTID_L")
     495                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("PSxMSTID_L")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   10

     496                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     497                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     498                            .dwattr $C$DW$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     499                            .dwattr $C$DW$21, DW_AT_decl_line(0xe8)
     500                            .dwattr $C$DW$21, DW_AT_decl_column(0x12)
     501                    
     502                    $C$DW$22        .dwtag  DW_TAG_member
     503                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
     504                            .dwattr $C$DW$22, DW_AT_name("PSxMSTID_H")
     505                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("PSxMSTID_H")
     506                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     507                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     508                            .dwattr $C$DW$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     509                            .dwattr $C$DW$22, DW_AT_decl_line(0xe9)
     510                            .dwattr $C$DW$22, DW_AT_decl_column(0x12)
     511                    
     512                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
     513                            .dwattr $C$DW$T$22, DW_AT_decl_line(0xe7)
     514                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x05)
     515                            .dwendtag $C$DW$T$22
     516                    
     517                    
     518                    $C$DW$T$44      .dwtag  DW_TAG_array_type
     519                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$22)
     520                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     521                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x100)
     522                    $C$DW$23        .dwtag  DW_TAG_subrange_type
     523                            .dwattr $C$DW$23, DW_AT_upper_bound(0x1f)
     524                    
     525                            .dwendtag $C$DW$T$44
     526                    
     527                    
     528                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
     529                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     530                    $C$DW$24        .dwtag  DW_TAG_member
     531                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$21)
     532                            .dwattr $C$DW$24, DW_AT_name("PPSxMSTID_L")
     533                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("PPSxMSTID_L")
     534                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     535                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     536                            .dwattr $C$DW$24, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     537                            .dwattr $C$DW$24, DW_AT_decl_line(0xed)
     538                            .dwattr $C$DW$24, DW_AT_decl_column(0x12)
     539                    
     540                    $C$DW$25        .dwtag  DW_TAG_member
     541                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$21)
     542                            .dwattr $C$DW$25, DW_AT_name("PPSxMSTID_H")
     543                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("PPSxMSTID_H")
     544                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     545                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     546                            .dwattr $C$DW$25, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     547                            .dwattr $C$DW$25, DW_AT_decl_line(0xee)
     548                            .dwattr $C$DW$25, DW_AT_decl_column(0x12)
     549                    
     550                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   11

     551                            .dwattr $C$DW$T$23, DW_AT_decl_line(0xec)
     552                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x05)
     553                            .dwendtag $C$DW$T$23
     554                    
     555                    
     556                    $C$DW$T$45      .dwtag  DW_TAG_array_type
     557                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
     558                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
     559                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
     560                    $C$DW$26        .dwtag  DW_TAG_subrange_type
     561                            .dwattr $C$DW$26, DW_AT_upper_bound(0x07)
     562                    
     563                            .dwendtag $C$DW$T$45
     564                    
     565                    
     566                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
     567                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     568                    $C$DW$27        .dwtag  DW_TAG_member
     569                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
     570                            .dwattr $C$DW$27, DW_AT_name("PPSExMSTID_L")
     571                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("PPSExMSTID_L")
     572                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     573                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     574                            .dwattr $C$DW$27, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     575                            .dwattr $C$DW$27, DW_AT_decl_line(0xf2)
     576                            .dwattr $C$DW$27, DW_AT_decl_column(0x12)
     577                    
     578                    $C$DW$28        .dwtag  DW_TAG_member
     579                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$21)
     580                            .dwattr $C$DW$28, DW_AT_name("PPSExMSTID_H")
     581                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("PPSExMSTID_H")
     582                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     583                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     584                            .dwattr $C$DW$28, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
     585                            .dwattr $C$DW$28, DW_AT_decl_line(0xf3)
     586                            .dwattr $C$DW$28, DW_AT_decl_column(0x12)
     587                    
     588                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
     589                            .dwattr $C$DW$T$24, DW_AT_decl_line(0xf1)
     590                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x05)
     591                            .dwendtag $C$DW$T$24
     592                    
     593                    
     594                    $C$DW$T$46      .dwtag  DW_TAG_array_type
     595                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$24)
     596                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     597                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x100)
     598                    $C$DW$29        .dwtag  DW_TAG_subrange_type
     599                            .dwattr $C$DW$29, DW_AT_upper_bound(0x1f)
     600                    
     601                            .dwendtag $C$DW$T$46
     602                    
     603                    
     604                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
     605                            .dwattr $C$DW$T$27, DW_AT_name("ROLMIO_t")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   12

     606                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
     607                    $C$DW$30        .dwtag  DW_TAG_member
     608                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$25)
     609                            .dwattr $C$DW$30, DW_AT_name("DIN")
     610                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("DIN")
     611                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     612                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     613                            .dwattr $C$DW$30, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     614                            .dwattr $C$DW$30, DW_AT_decl_line(0x35)
     615                            .dwattr $C$DW$30, DW_AT_decl_column(0x0b)
     616                    
     617                    $C$DW$31        .dwtag  DW_TAG_member
     618                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$25)
     619                            .dwattr $C$DW$31, DW_AT_name("DOUT")
     620                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("DOUT")
     621                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     622                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     623                            .dwattr $C$DW$31, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     624                            .dwattr $C$DW$31, DW_AT_decl_line(0x36)
     625                            .dwattr $C$DW$31, DW_AT_decl_column(0x0b)
     626                    
     627                    $C$DW$32        .dwtag  DW_TAG_member
     628                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$25)
     629                            .dwattr $C$DW$32, DW_AT_name("DS")
     630                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("DS")
     631                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     632                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     633                            .dwattr $C$DW$32, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     634                            .dwattr $C$DW$32, DW_AT_decl_line(0x37)
     635                            .dwattr $C$DW$32, DW_AT_decl_column(0x0b)
     636                    
     637                    $C$DW$33        .dwtag  DW_TAG_member
     638                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$26)
     639                            .dwattr $C$DW$33, DW_AT_name("DATOA")
     640                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("DATOA")
     641                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     642                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     643                            .dwattr $C$DW$33, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     644                            .dwattr $C$DW$33, DW_AT_decl_line(0x38)
     645                            .dwattr $C$DW$33, DW_AT_decl_column(0x0c)
     646                    
     647                    $C$DW$34        .dwtag  DW_TAG_member
     648                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$26)
     649                            .dwattr $C$DW$34, DW_AT_name("DATOB")
     650                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("DATOB")
     651                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     652                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     653                            .dwattr $C$DW$34, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     654                            .dwattr $C$DW$34, DW_AT_decl_line(0x39)
     655                            .dwattr $C$DW$34, DW_AT_decl_column(0x0c)
     656                    
     657                    $C$DW$35        .dwtag  DW_TAG_member
     658                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$26)
     659                            .dwattr $C$DW$35, DW_AT_name("DATOC")
     660                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("DATOC")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   13

     661                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     662                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     663                            .dwattr $C$DW$35, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     664                            .dwattr $C$DW$35, DW_AT_decl_line(0x3a)
     665                            .dwattr $C$DW$35, DW_AT_decl_column(0x0c)
     666                    
     667                    $C$DW$36        .dwtag  DW_TAG_member
     668                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$26)
     669                            .dwattr $C$DW$36, DW_AT_name("DATIA")
     670                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("DATIA")
     671                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     672                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     673                            .dwattr $C$DW$36, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     674                            .dwattr $C$DW$36, DW_AT_decl_line(0x3b)
     675                            .dwattr $C$DW$36, DW_AT_decl_column(0x0c)
     676                    
     677                    $C$DW$37        .dwtag  DW_TAG_member
     678                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$26)
     679                            .dwattr $C$DW$37, DW_AT_name("DATIB")
     680                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("DATIB")
     681                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     682                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     683                            .dwattr $C$DW$37, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     684                            .dwattr $C$DW$37, DW_AT_decl_line(0x3c)
     685                            .dwattr $C$DW$37, DW_AT_decl_column(0x0c)
     686                    
     687                    $C$DW$38        .dwtag  DW_TAG_member
     688                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$26)
     689                            .dwattr $C$DW$38, DW_AT_name("DATIC")
     690                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("DATIC")
     691                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     692                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     693                            .dwattr $C$DW$38, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     694                            .dwattr $C$DW$38, DW_AT_decl_line(0x3d)
     695                            .dwattr $C$DW$38, DW_AT_decl_column(0x0c)
     696                    
     697                    $C$DW$39        .dwtag  DW_TAG_member
     698                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$26)
     699                            .dwattr $C$DW$39, DW_AT_name("STRT")
     700                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("STRT")
     701                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     702                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     703                            .dwattr $C$DW$39, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     704                            .dwattr $C$DW$39, DW_AT_decl_line(0x3e)
     705                            .dwattr $C$DW$39, DW_AT_decl_column(0x0c)
     706                    
     707                    $C$DW$40        .dwtag  DW_TAG_member
     708                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$26)
     709                            .dwattr $C$DW$40, DW_AT_name("CLR")
     710                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("CLR")
     711                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     712                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     713                            .dwattr $C$DW$40, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     714                            .dwattr $C$DW$40, DW_AT_decl_line(0x3f)
     715                            .dwattr $C$DW$40, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   14

     716                    
     717                    $C$DW$41        .dwtag  DW_TAG_member
     718                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$26)
     719                            .dwattr $C$DW$41, DW_AT_name("IOPLS")
     720                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("IOPLS")
     721                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     722                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     723                            .dwattr $C$DW$41, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     724                            .dwattr $C$DW$41, DW_AT_decl_line(0x40)
     725                            .dwattr $C$DW$41, DW_AT_decl_column(0x0c)
     726                    
     727                    $C$DW$42        .dwtag  DW_TAG_member
     728                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$26)
     729                            .dwattr $C$DW$42, DW_AT_name("SELB")
     730                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("SELB")
     731                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     732                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     733                            .dwattr $C$DW$42, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     734                            .dwattr $C$DW$42, DW_AT_decl_line(0x41)
     735                            .dwattr $C$DW$42, DW_AT_decl_column(0x0c)
     736                    
     737                    $C$DW$43        .dwtag  DW_TAG_member
     738                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$26)
     739                            .dwattr $C$DW$43, DW_AT_name("SELD")
     740                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("SELD")
     741                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     742                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     743                            .dwattr $C$DW$43, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     744                            .dwattr $C$DW$43, DW_AT_decl_line(0x42)
     745                            .dwattr $C$DW$43, DW_AT_decl_column(0x0c)
     746                    
     747                    $C$DW$44        .dwtag  DW_TAG_member
     748                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$26)
     749                            .dwattr $C$DW$44, DW_AT_name("IORST")
     750                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("IORST")
     751                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     752                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     753                            .dwattr $C$DW$44, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     754                            .dwattr $C$DW$44, DW_AT_decl_line(0x43)
     755                            .dwattr $C$DW$44, DW_AT_decl_column(0x0c)
     756                    
     757                    $C$DW$45        .dwtag  DW_TAG_member
     758                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$26)
     759                            .dwattr $C$DW$45, DW_AT_name("INTR")
     760                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("INTR")
     761                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     762                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     763                            .dwattr $C$DW$45, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     764                            .dwattr $C$DW$45, DW_AT_decl_line(0x44)
     765                            .dwattr $C$DW$45, DW_AT_decl_column(0x0c)
     766                    
     767                    $C$DW$46        .dwtag  DW_TAG_member
     768                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$26)
     769                            .dwattr $C$DW$46, DW_AT_name("INTA")
     770                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("INTA")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   15

     771                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     772                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     773                            .dwattr $C$DW$46, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     774                            .dwattr $C$DW$46, DW_AT_decl_line(0x45)
     775                            .dwattr $C$DW$46, DW_AT_decl_column(0x0c)
     776                    
     777                    $C$DW$47        .dwtag  DW_TAG_member
     778                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$26)
     779                            .dwattr $C$DW$47, DW_AT_name("INTP")
     780                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("INTP")
     781                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     782                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     783                            .dwattr $C$DW$47, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     784                            .dwattr $C$DW$47, DW_AT_decl_line(0x46)
     785                            .dwattr $C$DW$47, DW_AT_decl_column(0x0c)
     786                    
     787                    $C$DW$48        .dwtag  DW_TAG_member
     788                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$26)
     789                            .dwattr $C$DW$48, DW_AT_name("MSKO")
     790                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("MSKO")
     791                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     792                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     793                            .dwattr $C$DW$48, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     794                            .dwattr $C$DW$48, DW_AT_decl_line(0x47)
     795                            .dwattr $C$DW$48, DW_AT_decl_column(0x0c)
     796                    
     797                    $C$DW$49        .dwtag  DW_TAG_member
     798                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$26)
     799                            .dwattr $C$DW$49, DW_AT_name("RQENB")
     800                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("RQENB")
     801                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     802                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     803                            .dwattr $C$DW$49, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     804                            .dwattr $C$DW$49, DW_AT_decl_line(0x48)
     805                            .dwattr $C$DW$49, DW_AT_decl_column(0x0c)
     806                    
     807                    $C$DW$50        .dwtag  DW_TAG_member
     808                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$26)
     809                            .dwattr $C$DW$50, DW_AT_name("DCHR")
     810                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("DCHR")
     811                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     812                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     813                            .dwattr $C$DW$50, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     814                            .dwattr $C$DW$50, DW_AT_decl_line(0x49)
     815                            .dwattr $C$DW$50, DW_AT_decl_column(0x0c)
     816                    
     817                    $C$DW$51        .dwtag  DW_TAG_member
     818                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$26)
     819                            .dwattr $C$DW$51, DW_AT_name("DCHA")
     820                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DCHA")
     821                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     822                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     823                            .dwattr $C$DW$51, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     824                            .dwattr $C$DW$51, DW_AT_decl_line(0x4a)
     825                            .dwattr $C$DW$51, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   16

     826                    
     827                    $C$DW$52        .dwtag  DW_TAG_member
     828                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$26)
     829                            .dwattr $C$DW$52, DW_AT_name("DCHP")
     830                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("DCHP")
     831                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     832                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     833                            .dwattr $C$DW$52, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     834                            .dwattr $C$DW$52, DW_AT_decl_line(0x4b)
     835                            .dwattr $C$DW$52, DW_AT_decl_column(0x0c)
     836                    
     837                    $C$DW$53        .dwtag  DW_TAG_member
     838                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$26)
     839                            .dwattr $C$DW$53, DW_AT_name("DCHM0")
     840                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("DCHM0")
     841                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     842                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     843                            .dwattr $C$DW$53, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     844                            .dwattr $C$DW$53, DW_AT_decl_line(0x4c)
     845                            .dwattr $C$DW$53, DW_AT_decl_column(0x0c)
     846                    
     847                    $C$DW$54        .dwtag  DW_TAG_member
     848                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$26)
     849                            .dwattr $C$DW$54, DW_AT_name("DCHM1")
     850                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("DCHM1")
     851                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     852                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     853                            .dwattr $C$DW$54, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     854                            .dwattr $C$DW$54, DW_AT_decl_line(0x4d)
     855                            .dwattr $C$DW$54, DW_AT_decl_column(0x0c)
     856                    
     857                    $C$DW$55        .dwtag  DW_TAG_member
     858                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$26)
     859                            .dwattr $C$DW$55, DW_AT_name("DCHS")
     860                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("DCHS")
     861                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     862                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     863                            .dwattr $C$DW$55, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     864                            .dwattr $C$DW$55, DW_AT_decl_line(0x4e)
     865                            .dwattr $C$DW$55, DW_AT_decl_column(0x0c)
     866                    
     867                    $C$DW$56        .dwtag  DW_TAG_member
     868                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$26)
     869                            .dwattr $C$DW$56, DW_AT_name("DCHO")
     870                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("DCHO")
     871                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     872                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     873                            .dwattr $C$DW$56, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     874                            .dwattr $C$DW$56, DW_AT_decl_line(0x4f)
     875                            .dwattr $C$DW$56, DW_AT_decl_column(0x0c)
     876                    
     877                    $C$DW$57        .dwtag  DW_TAG_member
     878                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$26)
     879                            .dwattr $C$DW$57, DW_AT_name("OVFLO")
     880                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("OVFLO")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   17

     881                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     882                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     883                            .dwattr $C$DW$57, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
     884                            .dwattr $C$DW$57, DW_AT_decl_line(0x50)
     885                            .dwattr $C$DW$57, DW_AT_decl_column(0x0c)
     886                    
     887                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
     888                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x34)
     889                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x19)
     890                            .dwendtag $C$DW$T$27
     891                    
     892                    $C$DW$T$53      .dwtag  DW_TAG_volatile_type
     893                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
     894                    
     895                    $C$DW$T$54      .dwtag  DW_TAG_typedef
     896                            .dwattr $C$DW$T$54, DW_AT_name("ROLMIO_t")
     897                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
     898                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
     899                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
     900                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x51)
     901                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x03)
     902                    
     903                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     904                            .dwattr $C$DW$T$2, DW_AT_name("void")
     905                    
     906                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     907                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     908                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     909                    
     910                    $C$DW$T$4       .dwtag  DW_TAG_base_type
     911                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     912                            .dwattr $C$DW$T$4, DW_AT_name("bool")
     913                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     914                    
     915                    $C$DW$T$5       .dwtag  DW_TAG_base_type
     916                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     917                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
     918                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     919                    
     920                    $C$DW$T$57      .dwtag  DW_TAG_typedef
     921                            .dwattr $C$DW$T$57, DW_AT_name("int8_t")
     922                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$5)
     923                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     924                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     925                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x2a)
     926                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x1d)
     927                    
     928                    $C$DW$T$58      .dwtag  DW_TAG_typedef
     929                            .dwattr $C$DW$T$58, DW_AT_name("int_least8_t")
     930                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
     931                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     932                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     933                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x37)
     934                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x17)
     935                    
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   18

     936                    $C$DW$T$6       .dwtag  DW_TAG_base_type
     937                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     938                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     939                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     940                    
     941                    $C$DW$T$19      .dwtag  DW_TAG_pointer_type
     942                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
     943                            .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
     944                    
     945                    $C$DW$T$26      .dwtag  DW_TAG_typedef
     946                            .dwattr $C$DW$T$26, DW_AT_name("uint8_t")
     947                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$6)
     948                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     949                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     950                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x2b)
     951                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1c)
     952                    
     953                    $C$DW$T$59      .dwtag  DW_TAG_typedef
     954                            .dwattr $C$DW$T$59, DW_AT_name("uint_least8_t")
     955                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$26)
     956                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     957                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     958                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x38)
     959                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x16)
     960                    
     961                    $C$DW$T$7       .dwtag  DW_TAG_base_type
     962                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     963                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     964                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
     965                    
     966                    $C$DW$T$8       .dwtag  DW_TAG_base_type
     967                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     968                            .dwattr $C$DW$T$8, DW_AT_name("short")
     969                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
     970                    
     971                    $C$DW$T$60      .dwtag  DW_TAG_typedef
     972                            .dwattr $C$DW$T$60, DW_AT_name("int16_t")
     973                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
     974                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
     975                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     976                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x2c)
     977                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x1d)
     978                    
     979                    $C$DW$T$61      .dwtag  DW_TAG_typedef
     980                            .dwattr $C$DW$T$61, DW_AT_name("int_least16_t")
     981                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
     982                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     983                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     984                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x3a)
     985                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x17)
     986                    
     987                    $C$DW$T$9       .dwtag  DW_TAG_base_type
     988                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     989                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     990                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   19

     991                    
     992                    $C$DW$T$25      .dwtag  DW_TAG_typedef
     993                            .dwattr $C$DW$T$25, DW_AT_name("uint16_t")
     994                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$9)
     995                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     996                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
     997                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x2d)
     998                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x1c)
     999                    
    1000                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    1001                            .dwattr $C$DW$T$63, DW_AT_name("uint_least16_t")
    1002                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$25)
    1003                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1004                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1005                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x3b)
    1006                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x16)
    1007                    
    1008                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1009                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1010                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1011                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1012                    
    1013                    $C$DW$T$64      .dwtag  DW_TAG_typedef
    1014                            .dwattr $C$DW$T$64, DW_AT_name("int32_t")
    1015                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$10)
    1016                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1017                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1018                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x2e)
    1019                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x1d)
    1020                    
    1021                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    1022                            .dwattr $C$DW$T$65, DW_AT_name("int_fast16_t")
    1023                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    1024                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1025                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1026                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x47)
    1027                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x17)
    1028                    
    1029                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    1030                            .dwattr $C$DW$T$66, DW_AT_name("int_fast32_t")
    1031                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
    1032                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1033                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1034                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x4a)
    1035                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x17)
    1036                    
    1037                    $C$DW$T$67      .dwtag  DW_TAG_typedef
    1038                            .dwattr $C$DW$T$67, DW_AT_name("int_fast8_t")
    1039                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$64)
    1040                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1041                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1042                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x45)
    1043                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x17)
    1044                    
    1045                    $C$DW$T$68      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   20

    1046                            .dwattr $C$DW$T$68, DW_AT_name("int_least32_t")
    1047                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$64)
    1048                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1049                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1050                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x3c)
    1051                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x17)
    1052                    
    1053                    $C$DW$T$69      .dwtag  DW_TAG_typedef
    1054                            .dwattr $C$DW$T$69, DW_AT_name("intptr_t")
    1055                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$10)
    1056                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1057                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1058                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x52)
    1059                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x1a)
    1060                    
    1061                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    1062                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1063                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1064                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1065                    
    1066                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    1067                            .dwattr $C$DW$T$70, DW_AT_name("size_t")
    1068                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$11)
    1069                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1070                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1071                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x58)
    1072                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x19)
    1073                    
    1074                    $C$DW$T$21      .dwtag  DW_TAG_typedef
    1075                            .dwattr $C$DW$T$21, DW_AT_name("uint32_t")
    1076                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$11)
    1077                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1078                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1079                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x2f)
    1080                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)
    1081                    
    1082                    
    1083                    $C$DW$T$32      .dwtag  DW_TAG_array_type
    1084                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$21)
    1085                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1086                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x1c)
    1087                    $C$DW$58        .dwtag  DW_TAG_subrange_type
    1088                            .dwattr $C$DW$58, DW_AT_upper_bound(0x06)
    1089                    
    1090                            .dwendtag $C$DW$T$32
    1091                    
    1092                    
    1093                    $C$DW$T$33      .dwtag  DW_TAG_array_type
    1094                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$21)
    1095                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1096                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x14)
    1097                    $C$DW$59        .dwtag  DW_TAG_subrange_type
    1098                            .dwattr $C$DW$59, DW_AT_upper_bound(0x04)
    1099                    
    1100                            .dwendtag $C$DW$T$33
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   21

    1101                    
    1102                    
    1103                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    1104                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$21)
    1105                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1106                            .dwattr $C$DW$T$34, DW_AT_byte_size(0xa0)
    1107                    $C$DW$60        .dwtag  DW_TAG_subrange_type
    1108                            .dwattr $C$DW$60, DW_AT_upper_bound(0x27)
    1109                    
    1110                            .dwendtag $C$DW$T$34
    1111                    
    1112                    
    1113                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    1114                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$21)
    1115                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1116                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    1117                    $C$DW$61        .dwtag  DW_TAG_subrange_type
    1118                            .dwattr $C$DW$61, DW_AT_upper_bound(0x03)
    1119                    
    1120                            .dwendtag $C$DW$T$35
    1121                    
    1122                    
    1123                    $C$DW$T$36      .dwtag  DW_TAG_array_type
    1124                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$21)
    1125                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1126                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x98)
    1127                    $C$DW$62        .dwtag  DW_TAG_subrange_type
    1128                            .dwattr $C$DW$62, DW_AT_upper_bound(0x25)
    1129                    
    1130                            .dwendtag $C$DW$T$36
    1131                    
    1132                    
    1133                    $C$DW$T$37      .dwtag  DW_TAG_array_type
    1134                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$21)
    1135                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1136                            .dwattr $C$DW$T$37, DW_AT_byte_size(0xa8)
    1137                    $C$DW$63        .dwtag  DW_TAG_subrange_type
    1138                            .dwattr $C$DW$63, DW_AT_upper_bound(0x29)
    1139                    
    1140                            .dwendtag $C$DW$T$37
    1141                    
    1142                    
    1143                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    1144                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$21)
    1145                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1146                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x50)
    1147                    $C$DW$64        .dwtag  DW_TAG_subrange_type
    1148                            .dwattr $C$DW$64, DW_AT_upper_bound(0x13)
    1149                    
    1150                            .dwendtag $C$DW$T$38
    1151                    
    1152                    
    1153                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    1154                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$21)
    1155                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   22

    1156                            .dwattr $C$DW$T$39, DW_AT_byte_size(0xf0)
    1157                    $C$DW$65        .dwtag  DW_TAG_subrange_type
    1158                            .dwattr $C$DW$65, DW_AT_upper_bound(0x3b)
    1159                    
    1160                            .dwendtag $C$DW$T$39
    1161                    
    1162                    
    1163                    $C$DW$T$41      .dwtag  DW_TAG_array_type
    1164                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
    1165                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1166                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    1167                    $C$DW$66        .dwtag  DW_TAG_subrange_type
    1168                            .dwattr $C$DW$66, DW_AT_upper_bound(0x01)
    1169                    
    1170                            .dwendtag $C$DW$T$41
    1171                    
    1172                    
    1173                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    1174                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$21)
    1175                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1176                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x138)
    1177                    $C$DW$67        .dwtag  DW_TAG_subrange_type
    1178                            .dwattr $C$DW$67, DW_AT_upper_bound(0x4d)
    1179                    
    1180                            .dwendtag $C$DW$T$42
    1181                    
    1182                    
    1183                    $C$DW$T$43      .dwtag  DW_TAG_array_type
    1184                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$21)
    1185                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1186                            .dwattr $C$DW$T$43, DW_AT_byte_size(0xf4)
    1187                    $C$DW$68        .dwtag  DW_TAG_subrange_type
    1188                            .dwattr $C$DW$68, DW_AT_upper_bound(0x3c)
    1189                    
    1190                            .dwendtag $C$DW$T$43
    1191                    
    1192                    
    1193                    $C$DW$T$47      .dwtag  DW_TAG_array_type
    1194                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$21)
    1195                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1196                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x80)
    1197                    $C$DW$69        .dwtag  DW_TAG_subrange_type
    1198                            .dwattr $C$DW$69, DW_AT_upper_bound(0x1f)
    1199                    
    1200                            .dwendtag $C$DW$T$47
    1201                    
    1202                    
    1203                    $C$DW$T$48      .dwtag  DW_TAG_array_type
    1204                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$21)
    1205                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1206                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x20)
    1207                    $C$DW$70        .dwtag  DW_TAG_subrange_type
    1208                            .dwattr $C$DW$70, DW_AT_upper_bound(0x07)
    1209                    
    1210                            .dwendtag $C$DW$T$48
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   23

    1211                    
    1212                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    1213                            .dwattr $C$DW$T$72, DW_AT_name("uint_fast16_t")
    1214                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$21)
    1215                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1216                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1217                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x48)
    1218                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x16)
    1219                    
    1220                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    1221                            .dwattr $C$DW$T$73, DW_AT_name("uint_fast32_t")
    1222                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$21)
    1223                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1224                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1225                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x4b)
    1226                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x16)
    1227                    
    1228                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    1229                            .dwattr $C$DW$T$74, DW_AT_name("uint_fast8_t")
    1230                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$21)
    1231                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1232                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1233                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x46)
    1234                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x16)
    1235                    
    1236                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    1237                            .dwattr $C$DW$T$75, DW_AT_name("uint_least32_t")
    1238                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$21)
    1239                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1240                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1241                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x3d)
    1242                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x16)
    1243                    
    1244                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    1245                            .dwattr $C$DW$T$76, DW_AT_name("uintptr_t")
    1246                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$11)
    1247                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1248                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1249                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x53)
    1250                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x1a)
    1251                    
    1252                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1253                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1254                            .dwattr $C$DW$T$12, DW_AT_name("long")
    1255                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1256                    
    1257                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    1258                            .dwattr $C$DW$T$77, DW_AT_name("fpos_t")
    1259                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$12)
    1260                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1261                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1262                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x6e)
    1263                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x0e)
    1264                    
    1265                    $C$DW$T$13      .dwtag  DW_TAG_base_type
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   24

    1266                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1267                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1268                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1269                    
    1270                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1271                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1272                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1273                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1274                    
    1275                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1276                            .dwattr $C$DW$T$78, DW_AT_name("int64_t")
    1277                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$14)
    1278                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1279                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1280                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x32)
    1281                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x21)
    1282                    
    1283                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    1284                            .dwattr $C$DW$T$79, DW_AT_name("int_fast64_t")
    1285                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    1286                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1287                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1288                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x4e)
    1289                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x17)
    1290                    
    1291                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    1292                            .dwattr $C$DW$T$80, DW_AT_name("int_least64_t")
    1293                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$78)
    1294                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1295                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1296                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x40)
    1297                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x17)
    1298                    
    1299                    $C$DW$T$81      .dwtag  DW_TAG_typedef
    1300                            .dwattr $C$DW$T$81, DW_AT_name("intmax_t")
    1301                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$14)
    1302                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1303                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1304                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x56)
    1305                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x20)
    1306                    
    1307                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1308                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1309                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1310                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1311                    
    1312                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    1313                            .dwattr $C$DW$T$82, DW_AT_name("uint64_t")
    1314                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$15)
    1315                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1316                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1317                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x33)
    1318                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x20)
    1319                    
    1320                    $C$DW$T$83      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   25

    1321                            .dwattr $C$DW$T$83, DW_AT_name("uint_fast64_t")
    1322                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    1323                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1324                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1325                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x4f)
    1326                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x16)
    1327                    
    1328                    $C$DW$T$84      .dwtag  DW_TAG_typedef
    1329                            .dwattr $C$DW$T$84, DW_AT_name("uint_least64_t")
    1330                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$82)
    1331                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1332                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1333                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x41)
    1334                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x16)
    1335                    
    1336                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1337                            .dwattr $C$DW$T$85, DW_AT_name("uintmax_t")
    1338                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$15)
    1339                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1340                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1341                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x57)
    1342                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x20)
    1343                    
    1344                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1345                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1346                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1347                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1348                    
    1349                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1350                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1351                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1352                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1353                    
    1354                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1355                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1356                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1357                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1358                    
    1359                    
    1360                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1361                            .dwattr $C$DW$T$28, DW_AT_name("__va_list")
    1362                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1363                    $C$DW$71        .dwtag  DW_TAG_member
    1364                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$3)
    1365                            .dwattr $C$DW$71, DW_AT_name("__ap")
    1366                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("__ap")
    1367                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1369                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/st
    1370                            .dwattr $C$DW$71, DW_AT_decl_line(0x38)
    1371                            .dwattr $C$DW$71, DW_AT_decl_column(0x0c)
    1372                    
    1373                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1374                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x37)
    1375                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   26

    1376                            .dwendtag $C$DW$T$28
    1377                    
    1378                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    1379                            .dwattr $C$DW$T$86, DW_AT_name("va_list")
    1380                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$28)
    1381                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1382                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1383                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x39)
    1384                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    1385                    
    1386                    
    1387                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1388                            .dwattr $C$DW$T$29, DW_AT_name("gioCntlRegDefs")
    1389                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x34)
    1390                    $C$DW$72        .dwtag  DW_TAG_member
    1391                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
    1392                            .dwattr $C$DW$72, DW_AT_name("GCR0")
    1393                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("GCR0")
    1394                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1396                            .dwattr $C$DW$72, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1397                            .dwattr $C$DW$72, DW_AT_decl_line(0x8c)
    1398                            .dwattr $C$DW$72, DW_AT_decl_column(0x0b)
    1399                    
    1400                    $C$DW$73        .dwtag  DW_TAG_member
    1401                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
    1402                            .dwattr $C$DW$73, DW_AT_name("rsvd1")
    1403                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("rsvd1")
    1404                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1405                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1406                            .dwattr $C$DW$73, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1407                            .dwattr $C$DW$73, DW_AT_decl_line(0x8d)
    1408                            .dwattr $C$DW$73, DW_AT_decl_column(0x0b)
    1409                    
    1410                    $C$DW$74        .dwtag  DW_TAG_member
    1411                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1412                            .dwattr $C$DW$74, DW_AT_name("INTDET")
    1413                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("INTDET")
    1414                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1415                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1416                            .dwattr $C$DW$74, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1417                            .dwattr $C$DW$74, DW_AT_decl_line(0x8e)
    1418                            .dwattr $C$DW$74, DW_AT_decl_column(0x0b)
    1419                    
    1420                    $C$DW$75        .dwtag  DW_TAG_member
    1421                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    1422                            .dwattr $C$DW$75, DW_AT_name("POL")
    1423                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("POL")
    1424                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1425                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1426                            .dwattr $C$DW$75, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1427                            .dwattr $C$DW$75, DW_AT_decl_line(0x8f)
    1428                            .dwattr $C$DW$75, DW_AT_decl_column(0x0b)
    1429                    
    1430                    $C$DW$76        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   27

    1431                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
    1432                            .dwattr $C$DW$76, DW_AT_name("ENASET")
    1433                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("ENASET")
    1434                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1435                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1436                            .dwattr $C$DW$76, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1437                            .dwattr $C$DW$76, DW_AT_decl_line(0x90)
    1438                            .dwattr $C$DW$76, DW_AT_decl_column(0x0b)
    1439                    
    1440                    $C$DW$77        .dwtag  DW_TAG_member
    1441                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
    1442                            .dwattr $C$DW$77, DW_AT_name("ENACLR")
    1443                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("ENACLR")
    1444                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1445                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1446                            .dwattr $C$DW$77, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1447                            .dwattr $C$DW$77, DW_AT_decl_line(0x91)
    1448                            .dwattr $C$DW$77, DW_AT_decl_column(0x0b)
    1449                    
    1450                    $C$DW$78        .dwtag  DW_TAG_member
    1451                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
    1452                            .dwattr $C$DW$78, DW_AT_name("LVLSET")
    1453                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("LVLSET")
    1454                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1455                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1456                            .dwattr $C$DW$78, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1457                            .dwattr $C$DW$78, DW_AT_decl_line(0x92)
    1458                            .dwattr $C$DW$78, DW_AT_decl_column(0x0b)
    1459                    
    1460                    $C$DW$79        .dwtag  DW_TAG_member
    1461                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1462                            .dwattr $C$DW$79, DW_AT_name("LVLCLR")
    1463                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("LVLCLR")
    1464                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1465                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1466                            .dwattr $C$DW$79, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1467                            .dwattr $C$DW$79, DW_AT_decl_line(0x93)
    1468                            .dwattr $C$DW$79, DW_AT_decl_column(0x0b)
    1469                    
    1470                    $C$DW$80        .dwtag  DW_TAG_member
    1471                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1472                            .dwattr $C$DW$80, DW_AT_name("FLG")
    1473                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("FLG")
    1474                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1475                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1476                            .dwattr $C$DW$80, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1477                            .dwattr $C$DW$80, DW_AT_decl_line(0x94)
    1478                            .dwattr $C$DW$80, DW_AT_decl_column(0x0b)
    1479                    
    1480                    $C$DW$81        .dwtag  DW_TAG_member
    1481                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
    1482                            .dwattr $C$DW$81, DW_AT_name("OFF1")
    1483                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("OFF1")
    1484                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1485                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   28

    1486                            .dwattr $C$DW$81, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1487                            .dwattr $C$DW$81, DW_AT_decl_line(0x95)
    1488                            .dwattr $C$DW$81, DW_AT_decl_column(0x0b)
    1489                    
    1490                    $C$DW$82        .dwtag  DW_TAG_member
    1491                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1492                            .dwattr $C$DW$82, DW_AT_name("OFF2")
    1493                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("OFF2")
    1494                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1495                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1496                            .dwattr $C$DW$82, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1497                            .dwattr $C$DW$82, DW_AT_decl_line(0x96)
    1498                            .dwattr $C$DW$82, DW_AT_decl_column(0x0b)
    1499                    
    1500                    $C$DW$83        .dwtag  DW_TAG_member
    1501                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1502                            .dwattr $C$DW$83, DW_AT_name("EMU1")
    1503                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("EMU1")
    1504                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1505                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1506                            .dwattr $C$DW$83, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1507                            .dwattr $C$DW$83, DW_AT_decl_line(0x97)
    1508                            .dwattr $C$DW$83, DW_AT_decl_column(0x0b)
    1509                    
    1510                    $C$DW$84        .dwtag  DW_TAG_member
    1511                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1512                            .dwattr $C$DW$84, DW_AT_name("EMU2")
    1513                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("EMU2")
    1514                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1515                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1516                            .dwattr $C$DW$84, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1517                            .dwattr $C$DW$84, DW_AT_decl_line(0x98)
    1518                            .dwattr $C$DW$84, DW_AT_decl_column(0x0b)
    1519                    
    1520                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1521                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x8b)
    1522                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x1a)
    1523                            .dwendtag $C$DW$T$29
    1524                    
    1525                    $C$DW$T$87      .dwtag  DW_TAG_volatile_type
    1526                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$29)
    1527                    
    1528                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    1529                            .dwattr $C$DW$T$88, DW_AT_name("gioCntlRegDefs_t")
    1530                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1531                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1532                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1533                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x99)
    1534                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1535                    
    1536                    
    1537                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1538                            .dwattr $C$DW$T$30, DW_AT_name("gioPortRegDefs")
    1539                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x20)
    1540                    $C$DW$85        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:51:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1084010                              PAGE   29

    1541                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1542                            .dwattr $C$DW$85, DW_AT_name("DIR")
    1543                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("DIR")
    1544                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1546                            .dwattr $C$DW$85, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1547                            .dwattr $C$DW$85, DW_AT_decl_line(0xa3)
    1548                            .dwattr $C$DW$85, DW_AT_decl_column(0x0b)
    1549                    
    1550                    $C$DW$86        .dwtag  DW_TAG_member
    1551                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1552                            .dwattr $C$DW$86, DW_AT_name("DIN")
    1553                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("DIN")
    1554                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1555                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1556                            .dwattr $C$DW$86, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1557                            .dwattr $C$DW$86, DW_AT_decl_line(0xa4)
    1558                            .dwattr $C$DW$86, DW_AT_decl_column(0x0b)
    1559                    
    1560                    $C$DW$87        .dwtag  DW_TAG_member
    1561                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1562                            .dwattr $C$DW$87, DW_AT_name("DOUT")
    1563                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("DOUT")
    1564                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1565                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1566                            .dwattr $C$DW$87, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1567                            .dwattr $C$DW$87, DW_AT_decl_line(0xa5)
    1568                            .dwattr $C$DW$87, DW_AT_decl_column(0x0b)
    1569                    
    1570                    $C$DW$88        .dwtag  DW_TAG_member
    1571                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1572                            .dwattr $C$DW$88, DW_AT_name("DSET")
    1573                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("DSET")
    1574                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1575                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1576                            .dwattr $C$DW$88, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1577                            .dwattr $C$DW$88, DW_AT_decl_line(0xa6)
    1578                            .dwattr $C$DW$88, DW_AT_decl_column(0x0b)
    1579                    
    1580                    $C$DW$89        .dwtag  DW_TAG_member
