TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 13:27:08 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_esm.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    3209                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3210                            .dwattr $C$DW$T$17, DW_AT_name("double")
    3211                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    3212                    
    3213                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    3214                            .dwattr $C$DW$T$87, DW_AT_name("float64")
    3215                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$17)
    3216                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3217                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3218                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x72)
    3219                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x10)
    3220                    
    3221                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    3222                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3223                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    3224                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    3225                    
    3226                    $C$DW$T$88      .dwtag  DW_TAG_base_type
    3227                            .dwattr $C$DW$T$88, DW_AT_encoding(DW_ATE_unsigned_char)
    3228                            .dwattr $C$DW$T$88, DW_AT_name("unsigned char")
    3229                            .dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
    3230                    
    3231                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    3232                            .dwattr $C$DW$T$89, DW_AT_name("boolean")
    3233                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3234                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3235                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3236                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x53)
    3237                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x0f)
    3238                    
    3239                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    3240                            .dwattr $C$DW$T$90, DW_AT_name("tBoolean")
    3241                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    3242                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3243                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3244                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x40)
    3245                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   60

    3246                    
    3247                    
    3248                    $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    3249                            .dwattr $C$DW$T$45, DW_AT_name("config_value_type")
    3250                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    3251                    $C$DW$133       .dwtag  DW_TAG_enumerator
    3252                            .dwattr $C$DW$133, DW_AT_name("InitialValue")
    3253                            .dwattr $C$DW$133, DW_AT_const_value(0x00)
    3254                            .dwattr $C$DW$133, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3255                            .dwattr $C$DW$133, DW_AT_decl_line(0x5c)
    3256                            .dwattr $C$DW$133, DW_AT_decl_column(0x02)
    3257                    
    3258                    $C$DW$134       .dwtag  DW_TAG_enumerator
    3259                            .dwattr $C$DW$134, DW_AT_name("CurrentValue")
    3260                            .dwattr $C$DW$134, DW_AT_const_value(0x01)
    3261                            .dwattr $C$DW$134, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3262                            .dwattr $C$DW$134, DW_AT_decl_line(0x5d)
    3263                            .dwattr $C$DW$134, DW_AT_decl_column(0x02)
    3264                    
    3265                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3266                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x5a)
    3267                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0e)
    3268                            .dwendtag $C$DW$T$45
    3269                    
    3270                    $C$DW$T$46      .dwtag  DW_TAG_typedef
    3271                            .dwattr $C$DW$T$46, DW_AT_name("config_value_type_t")
    3272                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3273                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3274                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3275                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x5e)
    3276                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x02)
    3277                    
    3278                    
    3279                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3280                            .dwattr $C$DW$T$23, DW_AT_name("esmBase")
    3281                            .dwattr $C$DW$T$23, DW_AT_byte_size(0xa4)
    3282                    $C$DW$135       .dwtag  DW_TAG_member
    3283                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    3284                            .dwattr $C$DW$135, DW_AT_name("EEPAPR1")
    3285                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("EEPAPR1")
    3286                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3287                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    3288                            .dwattr $C$DW$135, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3289                            .dwattr $C$DW$135, DW_AT_decl_line(0x48)
    3290                            .dwattr $C$DW$135, DW_AT_decl_column(0x0c)
    3291                    
    3292                    $C$DW$136       .dwtag  DW_TAG_member
    3293                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    3294                            .dwattr $C$DW$136, DW_AT_name("DEPAPR1")
    3295                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("DEPAPR1")
    3296                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3297                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    3298                            .dwattr $C$DW$136, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3299                            .dwattr $C$DW$136, DW_AT_decl_line(0x49)
    3300                            .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   61

    3301                    
    3302                    $C$DW$137       .dwtag  DW_TAG_member
    3303                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    3304                            .dwattr $C$DW$137, DW_AT_name("IESR1")
    3305                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("IESR1")
    3306                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3307                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    3308                            .dwattr $C$DW$137, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3309                            .dwattr $C$DW$137, DW_AT_decl_line(0x4a)
    3310                            .dwattr $C$DW$137, DW_AT_decl_column(0x0c)
    3311                    
    3312                    $C$DW$138       .dwtag  DW_TAG_member
    3313                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    3314                            .dwattr $C$DW$138, DW_AT_name("IECR1")
    3315                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("IECR1")
    3316                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3317                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    3318                            .dwattr $C$DW$138, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3319                            .dwattr $C$DW$138, DW_AT_decl_line(0x4b)
    3320                            .dwattr $C$DW$138, DW_AT_decl_column(0x0c)
    3321                    
    3322                    $C$DW$139       .dwtag  DW_TAG_member
    3323                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    3324                            .dwattr $C$DW$139, DW_AT_name("ILSR1")
    3325                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("ILSR1")
    3326                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3327                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    3328                            .dwattr $C$DW$139, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3329                            .dwattr $C$DW$139, DW_AT_decl_line(0x4c)
    3330                            .dwattr $C$DW$139, DW_AT_decl_column(0x0c)
    3331                    
    3332                    $C$DW$140       .dwtag  DW_TAG_member
    3333                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    3334                            .dwattr $C$DW$140, DW_AT_name("ILCR1")
    3335                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("ILCR1")
    3336                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3337                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    3338                            .dwattr $C$DW$140, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3339                            .dwattr $C$DW$140, DW_AT_decl_line(0x4d)
    3340                            .dwattr $C$DW$140, DW_AT_decl_column(0x0c)
    3341                    
    3342                    $C$DW$141       .dwtag  DW_TAG_member
    3343                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
    3344                            .dwattr $C$DW$141, DW_AT_name("SR1")
    3345                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("SR1")
    3346                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3347                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    3348                            .dwattr $C$DW$141, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3349                            .dwattr $C$DW$141, DW_AT_decl_line(0x4e)
    3350                            .dwattr $C$DW$141, DW_AT_decl_column(0x0c)
    3351                    
    3352                    $C$DW$142       .dwtag  DW_TAG_member
    3353                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    3354                            .dwattr $C$DW$142, DW_AT_name("EPSR")
    3355                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("EPSR")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   62

    3356                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3357                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    3358                            .dwattr $C$DW$142, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3359                            .dwattr $C$DW$142, DW_AT_decl_line(0x4f)
    3360                            .dwattr $C$DW$142, DW_AT_decl_column(0x0c)
    3361                    
    3362                    $C$DW$143       .dwtag  DW_TAG_member
    3363                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    3364                            .dwattr $C$DW$143, DW_AT_name("IOFFHR")
    3365                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("IOFFHR")
    3366                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3367                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    3368                            .dwattr $C$DW$143, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3369                            .dwattr $C$DW$143, DW_AT_decl_line(0x50)
    3370                            .dwattr $C$DW$143, DW_AT_decl_column(0x0c)
    3371                    
    3372                    $C$DW$144       .dwtag  DW_TAG_member
    3373                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    3374                            .dwattr $C$DW$144, DW_AT_name("IOFFLR")
    3375                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("IOFFLR")
    3376                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3377                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    3378                            .dwattr $C$DW$144, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3379                            .dwattr $C$DW$144, DW_AT_decl_line(0x51)
    3380                            .dwattr $C$DW$144, DW_AT_decl_column(0x0c)
    3381                    
    3382                    $C$DW$145       .dwtag  DW_TAG_member
    3383                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    3384                            .dwattr $C$DW$145, DW_AT_name("LTCR")
    3385                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("LTCR")
    3386                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3387                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    3388                            .dwattr $C$DW$145, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3389                            .dwattr $C$DW$145, DW_AT_decl_line(0x52)
    3390                            .dwattr $C$DW$145, DW_AT_decl_column(0x0c)
    3391                    
    3392                    $C$DW$146       .dwtag  DW_TAG_member
    3393                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    3394                            .dwattr $C$DW$146, DW_AT_name("LTCPR")
    3395                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("LTCPR")
    3396                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3397                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    3398                            .dwattr $C$DW$146, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3399                            .dwattr $C$DW$146, DW_AT_decl_line(0x53)
    3400                            .dwattr $C$DW$146, DW_AT_decl_column(0x0c)
    3401                    
    3402                    $C$DW$147       .dwtag  DW_TAG_member
    3403                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    3404                            .dwattr $C$DW$147, DW_AT_name("EKR")
    3405                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("EKR")
    3406                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3407                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3408                            .dwattr $C$DW$147, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3409                            .dwattr $C$DW$147, DW_AT_decl_line(0x54)
    3410                            .dwattr $C$DW$147, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   63

    3411                    
    3412                    $C$DW$148       .dwtag  DW_TAG_member
    3413                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    3414                            .dwattr $C$DW$148, DW_AT_name("SSR2")
    3415                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("SSR2")
    3416                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3417                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3418                            .dwattr $C$DW$148, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3419                            .dwattr $C$DW$148, DW_AT_decl_line(0x55)
    3420                            .dwattr $C$DW$148, DW_AT_decl_column(0x0c)
    3421                    
    3422                    $C$DW$149       .dwtag  DW_TAG_member
    3423                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    3424                            .dwattr $C$DW$149, DW_AT_name("IEPSR4")
    3425                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("IEPSR4")
    3426                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3427                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3428                            .dwattr $C$DW$149, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3429                            .dwattr $C$DW$149, DW_AT_decl_line(0x56)
    3430                            .dwattr $C$DW$149, DW_AT_decl_column(0x0c)
    3431                    
    3432                    $C$DW$150       .dwtag  DW_TAG_member
    3433                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    3434                            .dwattr $C$DW$150, DW_AT_name("IEPCR4")
    3435                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("IEPCR4")
    3436                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3437                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3438                            .dwattr $C$DW$150, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3439                            .dwattr $C$DW$150, DW_AT_decl_line(0x57)
    3440                            .dwattr $C$DW$150, DW_AT_decl_column(0x0c)
    3441                    
    3442                    $C$DW$151       .dwtag  DW_TAG_member
    3443                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    3444                            .dwattr $C$DW$151, DW_AT_name("IESR4")
    3445                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("IESR4")
    3446                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3447                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3448                            .dwattr $C$DW$151, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3449                            .dwattr $C$DW$151, DW_AT_decl_line(0x58)
    3450                            .dwattr $C$DW$151, DW_AT_decl_column(0x0c)
    3451                    
    3452                    $C$DW$152       .dwtag  DW_TAG_member
    3453                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    3454                            .dwattr $C$DW$152, DW_AT_name("IECR4")
    3455                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("IECR4")
    3456                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3457                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3458                            .dwattr $C$DW$152, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3459                            .dwattr $C$DW$152, DW_AT_decl_line(0x59)
    3460                            .dwattr $C$DW$152, DW_AT_decl_column(0x0c)
    3461                    
    3462                    $C$DW$153       .dwtag  DW_TAG_member
    3463                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    3464                            .dwattr $C$DW$153, DW_AT_name("ILSR4")
    3465                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("ILSR4")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   64

    3466                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3467                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3468                            .dwattr $C$DW$153, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3469                            .dwattr $C$DW$153, DW_AT_decl_line(0x5a)
    3470                            .dwattr $C$DW$153, DW_AT_decl_column(0x0c)
    3471                    
    3472                    $C$DW$154       .dwtag  DW_TAG_member
    3473                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    3474                            .dwattr $C$DW$154, DW_AT_name("ILCR4")
    3475                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("ILCR4")
    3476                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3477                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3478                            .dwattr $C$DW$154, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3479                            .dwattr $C$DW$154, DW_AT_decl_line(0x5b)
    3480                            .dwattr $C$DW$154, DW_AT_decl_column(0x0c)
    3481                    
    3482                    $C$DW$155       .dwtag  DW_TAG_member
    3483                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    3484                            .dwattr $C$DW$155, DW_AT_name("SR4")
    3485                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("SR4")
    3486                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3487                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3488                            .dwattr $C$DW$155, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3489                            .dwattr $C$DW$155, DW_AT_decl_line(0x5c)
    3490                            .dwattr $C$DW$155, DW_AT_decl_column(0x0c)
    3491                    
    3492                    $C$DW$156       .dwtag  DW_TAG_member
    3493                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$22)
    3494                            .dwattr $C$DW$156, DW_AT_name("rsvd1")
    3495                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("rsvd1")
    3496                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3497                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3498                            .dwattr $C$DW$156, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3499                            .dwattr $C$DW$156, DW_AT_decl_line(0x5d)
    3500                            .dwattr $C$DW$156, DW_AT_decl_column(0x0c)
    3501                    
    3502                    $C$DW$157       .dwtag  DW_TAG_member
    3503                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    3504                            .dwattr $C$DW$157, DW_AT_name("IEPSR7")
    3505                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("IEPSR7")
    3506                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3507                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3508                            .dwattr $C$DW$157, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3509                            .dwattr $C$DW$157, DW_AT_decl_line(0x5e)
    3510                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    3511                    
    3512                    $C$DW$158       .dwtag  DW_TAG_member
    3513                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    3514                            .dwattr $C$DW$158, DW_AT_name("IEPCR7")
    3515                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("IEPCR7")
    3516                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3517                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3518                            .dwattr $C$DW$158, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3519                            .dwattr $C$DW$158, DW_AT_decl_line(0x5f)
    3520                            .dwattr $C$DW$158, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   65

    3521                    
    3522                    $C$DW$159       .dwtag  DW_TAG_member
    3523                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    3524                            .dwattr $C$DW$159, DW_AT_name("IESR7")
    3525                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("IESR7")
    3526                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3527                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3528                            .dwattr $C$DW$159, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3529                            .dwattr $C$DW$159, DW_AT_decl_line(0x60)
    3530                            .dwattr $C$DW$159, DW_AT_decl_column(0x0c)
    3531                    
    3532                    $C$DW$160       .dwtag  DW_TAG_member
    3533                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    3534                            .dwattr $C$DW$160, DW_AT_name("IECR7")
    3535                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("IECR7")
    3536                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    3537                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3538                            .dwattr $C$DW$160, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3539                            .dwattr $C$DW$160, DW_AT_decl_line(0x61)
    3540                            .dwattr $C$DW$160, DW_AT_decl_column(0x0c)
    3541                    
    3542                    $C$DW$161       .dwtag  DW_TAG_member
    3543                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    3544                            .dwattr $C$DW$161, DW_AT_name("ILSR7")
    3545                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("ILSR7")
    3546                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3547                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3548                            .dwattr $C$DW$161, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3549                            .dwattr $C$DW$161, DW_AT_decl_line(0x62)
    3550                            .dwattr $C$DW$161, DW_AT_decl_column(0x0c)
    3551                    
    3552                    $C$DW$162       .dwtag  DW_TAG_member
    3553                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    3554                            .dwattr $C$DW$162, DW_AT_name("ILCR7")
    3555                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("ILCR7")
    3556                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    3557                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3558                            .dwattr $C$DW$162, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3559                            .dwattr $C$DW$162, DW_AT_decl_line(0x63)
    3560                            .dwattr $C$DW$162, DW_AT_decl_column(0x0c)
    3561                    
    3562                    $C$DW$163       .dwtag  DW_TAG_member
    3563                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    3564                            .dwattr $C$DW$163, DW_AT_name("SR7")
    3565                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("SR7")
    3566                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    3567                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3568                            .dwattr $C$DW$163, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3569                            .dwattr $C$DW$163, DW_AT_decl_line(0x64)
    3570                            .dwattr $C$DW$163, DW_AT_decl_column(0x0c)
    3571                    
    3572                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3573                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x46)
    3574                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x19)
    3575                            .dwendtag $C$DW$T$23
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   66

    3576                    
    3577                    $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    3578                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3579                    
    3580                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    3581                            .dwattr $C$DW$T$30, DW_AT_name("esmBASE_t")
    3582                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3583                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3584                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3585                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x65)
    3586                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    3587                    
    3588                    $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    3589                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3590                            .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    3591                    
    3592                    
    3593                    $C$DW$T$91      .dwtag  DW_TAG_enumeration_type
    3594                            .dwattr $C$DW$T$91, DW_AT_name("esmSelfTestFlag")
    3595                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
    3596                    $C$DW$164       .dwtag  DW_TAG_enumerator
    3597                            .dwattr $C$DW$164, DW_AT_name("esmSelfTest_Passed")
    3598                            .dwattr $C$DW$164, DW_AT_const_value(0x00)
    3599                            .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3600                            .dwattr $C$DW$164, DW_AT_decl_line(0x3c2)
    3601                            .dwattr $C$DW$164, DW_AT_decl_column(0x05)
    3602                    
    3603                    $C$DW$165       .dwtag  DW_TAG_enumerator
    3604                            .dwattr $C$DW$165, DW_AT_name("esmSelfTest_Active")
    3605                            .dwattr $C$DW$165, DW_AT_const_value(0x01)
    3606                            .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3607                            .dwattr $C$DW$165, DW_AT_decl_line(0x3c3)
    3608                            .dwattr $C$DW$165, DW_AT_decl_column(0x05)
    3609                    
    3610                    $C$DW$166       .dwtag  DW_TAG_enumerator
    3611                            .dwattr $C$DW$166, DW_AT_name("esmSelfTest_NotStarted")
    3612                            .dwattr $C$DW$166, DW_AT_const_value(0x02)
    3613                            .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3614                            .dwattr $C$DW$166, DW_AT_decl_line(0x3c4)
    3615                            .dwattr $C$DW$166, DW_AT_decl_column(0x05)
    3616                    
    3617                    $C$DW$167       .dwtag  DW_TAG_enumerator
    3618                            .dwattr $C$DW$167, DW_AT_name("esmSelfTest_Failed")
    3619                            .dwattr $C$DW$167, DW_AT_const_value(0x03)
    3620                            .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3621                            .dwattr $C$DW$167, DW_AT_decl_line(0x3c5)
    3622                            .dwattr $C$DW$167, DW_AT_decl_column(0x05)
    3623                    
    3624                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3625                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x3c0)
    3626                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x0e)
    3627                            .dwendtag $C$DW$T$91
    3628                    
    3629                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    3630                            .dwattr $C$DW$T$92, DW_AT_name("esmSelfTestFlag_t")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   67

    3631                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    3632                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    3633                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3634                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x3c6)
    3635                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x02)
    3636                    
    3637                    
    3638                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3639                            .dwattr $C$DW$T$24, DW_AT_name("esm_config_reg")
    3640                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x2c)
    3641                    $C$DW$168       .dwtag  DW_TAG_member
    3642                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    3643                            .dwattr $C$DW$168, DW_AT_name("CONFIG_EEPAPR1")
    3644                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("CONFIG_EEPAPR1")
    3645                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3646                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3647                            .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3648                            .dwattr $C$DW$168, DW_AT_decl_line(0x3cb)
    3649                            .dwattr $C$DW$168, DW_AT_decl_column(0x0c)
    3650                    
    3651                    $C$DW$169       .dwtag  DW_TAG_member
    3652                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    3653                            .dwattr $C$DW$169, DW_AT_name("CONFIG_IESR1")
    3654                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("CONFIG_IESR1")
    3655                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3656                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3657                            .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3658                            .dwattr $C$DW$169, DW_AT_decl_line(0x3cc)
    3659                            .dwattr $C$DW$169, DW_AT_decl_column(0x0c)
    3660                    
    3661                    $C$DW$170       .dwtag  DW_TAG_member
    3662                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    3663                            .dwattr $C$DW$170, DW_AT_name("CONFIG_ILSR1")
    3664                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("CONFIG_ILSR1")
    3665                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3666                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3667                            .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3668                            .dwattr $C$DW$170, DW_AT_decl_line(0x3cd)
    3669                            .dwattr $C$DW$170, DW_AT_decl_column(0x0c)
    3670                    
    3671                    $C$DW$171       .dwtag  DW_TAG_member
    3672                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    3673                            .dwattr $C$DW$171, DW_AT_name("CONFIG_LTCPR")
    3674                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("CONFIG_LTCPR")
    3675                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3676                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3677                            .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3678                            .dwattr $C$DW$171, DW_AT_decl_line(0x3ce)
    3679                            .dwattr $C$DW$171, DW_AT_decl_column(0x0c)
    3680                    
    3681                    $C$DW$172       .dwtag  DW_TAG_member
    3682                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    3683                            .dwattr $C$DW$172, DW_AT_name("CONFIG_EKR")
    3684                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("CONFIG_EKR")
    3685                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   68

    3686                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3687                            .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3688                            .dwattr $C$DW$172, DW_AT_decl_line(0x3cf)
    3689                            .dwattr $C$DW$172, DW_AT_decl_column(0x0c)
    3690                    
    3691                    $C$DW$173       .dwtag  DW_TAG_member
    3692                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    3693                            .dwattr $C$DW$173, DW_AT_name("CONFIG_IEPSR4")
    3694                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("CONFIG_IEPSR4")
    3695                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3696                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3697                            .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3698                            .dwattr $C$DW$173, DW_AT_decl_line(0x3d0)
    3699                            .dwattr $C$DW$173, DW_AT_decl_column(0x0c)
    3700                    
    3701                    $C$DW$174       .dwtag  DW_TAG_member
    3702                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    3703                            .dwattr $C$DW$174, DW_AT_name("CONFIG_IESR4")
    3704                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("CONFIG_IESR4")
    3705                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3706                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3707                            .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3708                            .dwattr $C$DW$174, DW_AT_decl_line(0x3d1)
    3709                            .dwattr $C$DW$174, DW_AT_decl_column(0x0c)
    3710                    
    3711                    $C$DW$175       .dwtag  DW_TAG_member
    3712                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    3713                            .dwattr $C$DW$175, DW_AT_name("CONFIG_ILSR4")
    3714                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("CONFIG_ILSR4")
    3715                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3716                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3717                            .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3718                            .dwattr $C$DW$175, DW_AT_decl_line(0x3d2)
    3719                            .dwattr $C$DW$175, DW_AT_decl_column(0x0c)
    3720                    
    3721                    $C$DW$176       .dwtag  DW_TAG_member
    3722                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    3723                            .dwattr $C$DW$176, DW_AT_name("CONFIG_IEPSR7")
    3724                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("CONFIG_IEPSR7")
    3725                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3726                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3727                            .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3728                            .dwattr $C$DW$176, DW_AT_decl_line(0x3d3)
    3729                            .dwattr $C$DW$176, DW_AT_decl_column(0x0c)
    3730                    
    3731                    $C$DW$177       .dwtag  DW_TAG_member
    3732                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    3733                            .dwattr $C$DW$177, DW_AT_name("CONFIG_IESR7")
    3734                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("CONFIG_IESR7")
    3735                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3736                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3737                            .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3738                            .dwattr $C$DW$177, DW_AT_decl_line(0x3d4)
    3739                            .dwattr $C$DW$177, DW_AT_decl_column(0x0c)
    3740                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   69

    3741                    $C$DW$178       .dwtag  DW_TAG_member
    3742                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    3743                            .dwattr $C$DW$178, DW_AT_name("CONFIG_ILSR7")
    3744                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("CONFIG_ILSR7")
    3745                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3746                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3747                            .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3748                            .dwattr $C$DW$178, DW_AT_decl_line(0x3d5)
    3749                            .dwattr $C$DW$178, DW_AT_decl_column(0x0c)
    3750                    
    3751                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3752                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x3c9)
    3753                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    3754                            .dwendtag $C$DW$T$24
    3755                    
    3756                    $C$DW$T$43      .dwtag  DW_TAG_typedef
    3757                            .dwattr $C$DW$T$43, DW_AT_name("esm_config_reg_t")
    3758                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$24)
    3759                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3760                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3761                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x3d6)
    3762                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    3763                    
    3764                    $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    3765                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3766                            .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    3767                    
    3768                    
    3769                    $C$DW$T$94      .dwtag  DW_TAG_enumeration_type
    3770                            .dwattr $C$DW$T$94, DW_AT_name("loopBackType")
    3771                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x01)
    3772                    $C$DW$179       .dwtag  DW_TAG_enumerator
    3773                            .dwattr $C$DW$179, DW_AT_name("Digital_Lbk")
    3774                            .dwattr $C$DW$179, DW_AT_const_value(0x00)
    3775                            .dwattr $C$DW$179, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3776                            .dwattr $C$DW$179, DW_AT_decl_line(0x4e)
    3777                            .dwattr $C$DW$179, DW_AT_decl_column(0x05)
    3778                    
    3779                    $C$DW$180       .dwtag  DW_TAG_enumerator
    3780                            .dwattr $C$DW$180, DW_AT_name("Analog_Lbk")
    3781                            .dwattr $C$DW$180, DW_AT_const_value(0x01)
    3782                            .dwattr $C$DW$180, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3783                            .dwattr $C$DW$180, DW_AT_decl_line(0x4f)
    3784                            .dwattr $C$DW$180, DW_AT_decl_column(0x05)
    3785                    
    3786                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3787                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x4c)
    3788                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x0e)
    3789                            .dwendtag $C$DW$T$94
    3790                    
    3791                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    3792                            .dwattr $C$DW$T$95, DW_AT_name("loopBackType_t")
    3793                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    3794                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    3795                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   70

    3796                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x50)
    3797                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x02)
    3798                    
    3799                    
    3800                    $C$DW$T$96      .dwtag  DW_TAG_enumeration_type
    3801                            .dwattr $C$DW$T$96, DW_AT_name("systemInterrupt")
    3802                            .dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
    3803                    $C$DW$181       .dwtag  DW_TAG_enumerator
    3804                            .dwattr $C$DW$181, DW_AT_name("SYS_IRQ")
    3805                            .dwattr $C$DW$181, DW_AT_const_value(0x00)
    3806                            .dwattr $C$DW$181, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3807                            .dwattr $C$DW$181, DW_AT_decl_line(0x4b)
    3808                            .dwattr $C$DW$181, DW_AT_decl_column(0x05)
    3809                    
    3810                    $C$DW$182       .dwtag  DW_TAG_enumerator
    3811                            .dwattr $C$DW$182, DW_AT_name("SYS_FIQ")
    3812                            .dwattr $C$DW$182, DW_AT_const_value(0x01)
    3813                            .dwattr $C$DW$182, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3814                            .dwattr $C$DW$182, DW_AT_decl_line(0x4c)
    3815                            .dwattr $C$DW$182, DW_AT_decl_column(0x05)
    3816                    
    3817                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3818                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x49)
    3819                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x0e)
    3820                            .dwendtag $C$DW$T$96
    3821                    
    3822                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    3823                            .dwattr $C$DW$T$97, DW_AT_name("systemInterrupt_t")
    3824                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    3825                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    3826                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3827                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x4d)
    3828                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x02)
    3829                    
    3830                    
    3831                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3832                            .dwattr $C$DW$T$27, DW_AT_name("vimBase")
    3833                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x1e0)
    3834                    $C$DW$183       .dwtag  DW_TAG_member
    3835                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$25)
    3836                            .dwattr $C$DW$183, DW_AT_name("rsvd1")
    3837                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("rsvd1")
    3838                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3839                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3840                            .dwattr $C$DW$183, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3841                            .dwattr $C$DW$183, DW_AT_decl_line(0x45)
    3842                            .dwattr $C$DW$183, DW_AT_decl_column(0x11)
    3843                    
    3844                    $C$DW$184       .dwtag  DW_TAG_member
    3845                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    3846                            .dwattr $C$DW$184, DW_AT_name("ECCSTAT")
    3847                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("ECCSTAT")
    3848                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3849                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3850                            .dwattr $C$DW$184, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   71

    3851                            .dwattr $C$DW$184, DW_AT_decl_line(0x46)
    3852                            .dwattr $C$DW$184, DW_AT_decl_column(0x11)
    3853                    
    3854                    $C$DW$185       .dwtag  DW_TAG_member
    3855                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    3856                            .dwattr $C$DW$185, DW_AT_name("ECCCTL")
    3857                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("ECCCTL")
    3858                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3859                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3860                            .dwattr $C$DW$185, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3861                            .dwattr $C$DW$185, DW_AT_decl_line(0x47)
    3862                            .dwattr $C$DW$185, DW_AT_decl_column(0x11)
    3863                    
    3864                    $C$DW$186       .dwtag  DW_TAG_member
    3865                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    3866                            .dwattr $C$DW$186, DW_AT_name("UERRADDR")
    3867                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("UERRADDR")
    3868                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3869                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3870                            .dwattr $C$DW$186, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3871                            .dwattr $C$DW$186, DW_AT_decl_line(0x48)
    3872                            .dwattr $C$DW$186, DW_AT_decl_column(0x11)
    3873                    
    3874                    $C$DW$187       .dwtag  DW_TAG_member
    3875                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    3876                            .dwattr $C$DW$187, DW_AT_name("FBVECADDR")
    3877                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("FBVECADDR")
    3878                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3879                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3880                            .dwattr $C$DW$187, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3881                            .dwattr $C$DW$187, DW_AT_decl_line(0x49)
    3882                            .dwattr $C$DW$187, DW_AT_decl_column(0x11)
    3883                    
    3884                    $C$DW$188       .dwtag  DW_TAG_member
    3885                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    3886                            .dwattr $C$DW$188, DW_AT_name("SBERRADDR")
    3887                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("SBERRADDR")
    3888                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3889                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3890                            .dwattr $C$DW$188, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3891                            .dwattr $C$DW$188, DW_AT_decl_line(0x4a)
    3892                            .dwattr $C$DW$188, DW_AT_decl_column(0x11)
    3893                    
    3894                    $C$DW$189       .dwtag  DW_TAG_member
    3895                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    3896                            .dwattr $C$DW$189, DW_AT_name("IRQINDEX")
    3897                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("IRQINDEX")
    3898                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3899                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3900                            .dwattr $C$DW$189, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3901                            .dwattr $C$DW$189, DW_AT_decl_line(0x4b)
    3902                            .dwattr $C$DW$189, DW_AT_decl_column(0x11)
    3903                    
    3904                    $C$DW$190       .dwtag  DW_TAG_member
    3905                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   72

    3906                            .dwattr $C$DW$190, DW_AT_name("FIQINDEX")
    3907                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("FIQINDEX")
    3908                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3909                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3910                            .dwattr $C$DW$190, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3911                            .dwattr $C$DW$190, DW_AT_decl_line(0x4c)
    3912                            .dwattr $C$DW$190, DW_AT_decl_column(0x11)
    3913                    
    3914                    $C$DW$191       .dwtag  DW_TAG_member
    3915                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    3916                            .dwattr $C$DW$191, DW_AT_name("rsvd2")
    3917                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("rsvd2")
    3918                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3919                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3920                            .dwattr $C$DW$191, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3921                            .dwattr $C$DW$191, DW_AT_decl_line(0x4d)
    3922                            .dwattr $C$DW$191, DW_AT_decl_column(0x11)
    3923                    
    3924                    $C$DW$192       .dwtag  DW_TAG_member
    3925                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    3926                            .dwattr $C$DW$192, DW_AT_name("rsvd3")
    3927                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("rsvd3")
    3928                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    3929                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3930                            .dwattr $C$DW$192, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3931                            .dwattr $C$DW$192, DW_AT_decl_line(0x4e)
    3932                            .dwattr $C$DW$192, DW_AT_decl_column(0x11)
    3933                    
    3934                    $C$DW$193       .dwtag  DW_TAG_member
    3935                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    3936                            .dwattr $C$DW$193, DW_AT_name("FIRQPR0")
    3937                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("FIRQPR0")
    3938                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    3939                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3940                            .dwattr $C$DW$193, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3941                            .dwattr $C$DW$193, DW_AT_decl_line(0x4f)
    3942                            .dwattr $C$DW$193, DW_AT_decl_column(0x11)
    3943                    
    3944                    $C$DW$194       .dwtag  DW_TAG_member
    3945                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    3946                            .dwattr $C$DW$194, DW_AT_name("FIRQPR1")
    3947                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("FIRQPR1")
    3948                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    3949                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3950                            .dwattr $C$DW$194, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3951                            .dwattr $C$DW$194, DW_AT_decl_line(0x50)
    3952                            .dwattr $C$DW$194, DW_AT_decl_column(0x11)
    3953                    
    3954                    $C$DW$195       .dwtag  DW_TAG_member
    3955                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    3956                            .dwattr $C$DW$195, DW_AT_name("FIRQPR2")
    3957                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("FIRQPR2")
    3958                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    3959                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3960                            .dwattr $C$DW$195, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   73

    3961                            .dwattr $C$DW$195, DW_AT_decl_line(0x51)
    3962                            .dwattr $C$DW$195, DW_AT_decl_column(0x11)
    3963                    
    3964                    $C$DW$196       .dwtag  DW_TAG_member
    3965                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    3966                            .dwattr $C$DW$196, DW_AT_name("FIRQPR3")
    3967                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("FIRQPR3")
    3968                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    3969                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3970                            .dwattr $C$DW$196, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3971                            .dwattr $C$DW$196, DW_AT_decl_line(0x52)
    3972                            .dwattr $C$DW$196, DW_AT_decl_column(0x11)
    3973                    
    3974                    $C$DW$197       .dwtag  DW_TAG_member
    3975                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    3976                            .dwattr $C$DW$197, DW_AT_name("INTREQ0")
    3977                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("INTREQ0")
    3978                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3979                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3980                            .dwattr $C$DW$197, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3981                            .dwattr $C$DW$197, DW_AT_decl_line(0x53)
    3982                            .dwattr $C$DW$197, DW_AT_decl_column(0x11)
    3983                    
    3984                    $C$DW$198       .dwtag  DW_TAG_member
    3985                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    3986                            .dwattr $C$DW$198, DW_AT_name("INTREQ1")
    3987                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("INTREQ1")
    3988                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    3989                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3990                            .dwattr $C$DW$198, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3991                            .dwattr $C$DW$198, DW_AT_decl_line(0x54)
    3992                            .dwattr $C$DW$198, DW_AT_decl_column(0x11)
    3993                    
    3994                    $C$DW$199       .dwtag  DW_TAG_member
    3995                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    3996                            .dwattr $C$DW$199, DW_AT_name("INTREQ2")
    3997                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("INTREQ2")
    3998                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    3999                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    4000                            .dwattr $C$DW$199, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4001                            .dwattr $C$DW$199, DW_AT_decl_line(0x55)
    4002                            .dwattr $C$DW$199, DW_AT_decl_column(0x11)
    4003                    
    4004                    $C$DW$200       .dwtag  DW_TAG_member
    4005                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    4006                            .dwattr $C$DW$200, DW_AT_name("INTREQ3")
    4007                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("INTREQ3")
    4008                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    4009                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    4010                            .dwattr $C$DW$200, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4011                            .dwattr $C$DW$200, DW_AT_decl_line(0x56)
    4012                            .dwattr $C$DW$200, DW_AT_decl_column(0x11)
    4013                    
    4014                    $C$DW$201       .dwtag  DW_TAG_member
    4015                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   74

    4016                            .dwattr $C$DW$201, DW_AT_name("REQMASKSET0")
    4017                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("REQMASKSET0")
    4018                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    4019                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    4020                            .dwattr $C$DW$201, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4021                            .dwattr $C$DW$201, DW_AT_decl_line(0x57)
    4022                            .dwattr $C$DW$201, DW_AT_decl_column(0x11)
    4023                    
    4024                    $C$DW$202       .dwtag  DW_TAG_member
    4025                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    4026                            .dwattr $C$DW$202, DW_AT_name("REQMASKSET1")
    4027                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("REQMASKSET1")
    4028                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    4029                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    4030                            .dwattr $C$DW$202, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4031                            .dwattr $C$DW$202, DW_AT_decl_line(0x58)
    4032                            .dwattr $C$DW$202, DW_AT_decl_column(0x11)
    4033                    
    4034                    $C$DW$203       .dwtag  DW_TAG_member
    4035                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    4036                            .dwattr $C$DW$203, DW_AT_name("REQMASKSET2")
    4037                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("REQMASKSET2")
    4038                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    4039                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    4040                            .dwattr $C$DW$203, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4041                            .dwattr $C$DW$203, DW_AT_decl_line(0x59)
    4042                            .dwattr $C$DW$203, DW_AT_decl_column(0x11)
    4043                    
    4044                    $C$DW$204       .dwtag  DW_TAG_member
    4045                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    4046                            .dwattr $C$DW$204, DW_AT_name("REQMASKSET3")
    4047                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("REQMASKSET3")
    4048                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    4049                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    4050                            .dwattr $C$DW$204, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4051                            .dwattr $C$DW$204, DW_AT_decl_line(0x5a)
    4052                            .dwattr $C$DW$204, DW_AT_decl_column(0x11)
    4053                    
    4054                    $C$DW$205       .dwtag  DW_TAG_member
    4055                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    4056                            .dwattr $C$DW$205, DW_AT_name("REQMASKCLR0")
    4057                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("REQMASKCLR0")
    4058                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    4059                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4060                            .dwattr $C$DW$205, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4061                            .dwattr $C$DW$205, DW_AT_decl_line(0x5b)
    4062                            .dwattr $C$DW$205, DW_AT_decl_column(0x11)
    4063                    
    4064                    $C$DW$206       .dwtag  DW_TAG_member
    4065                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$20)
    4066                            .dwattr $C$DW$206, DW_AT_name("REQMASKCLR1")
    4067                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("REQMASKCLR1")
    4068                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    4069                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4070                            .dwattr $C$DW$206, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   75

    4071                            .dwattr $C$DW$206, DW_AT_decl_line(0x5c)
    4072                            .dwattr $C$DW$206, DW_AT_decl_column(0x11)
    4073                    
    4074                    $C$DW$207       .dwtag  DW_TAG_member
    4075                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    4076                            .dwattr $C$DW$207, DW_AT_name("REQMASKCLR2")
    4077                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("REQMASKCLR2")
    4078                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    4079                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4080                            .dwattr $C$DW$207, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4081                            .dwattr $C$DW$207, DW_AT_decl_line(0x5d)
    4082                            .dwattr $C$DW$207, DW_AT_decl_column(0x11)
    4083                    
    4084                    $C$DW$208       .dwtag  DW_TAG_member
    4085                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    4086                            .dwattr $C$DW$208, DW_AT_name("REQMASKCLR3")
    4087                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("REQMASKCLR3")
    4088                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
    4089                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4090                            .dwattr $C$DW$208, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4091                            .dwattr $C$DW$208, DW_AT_decl_line(0x5e)
    4092                            .dwattr $C$DW$208, DW_AT_decl_column(0x11)
    4093                    
    4094                    $C$DW$209       .dwtag  DW_TAG_member
    4095                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    4096                            .dwattr $C$DW$209, DW_AT_name("WAKEMASKSET0")
    4097                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("WAKEMASKSET0")
    4098                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    4099                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4100                            .dwattr $C$DW$209, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4101                            .dwattr $C$DW$209, DW_AT_decl_line(0x5f)
    4102                            .dwattr $C$DW$209, DW_AT_decl_column(0x11)
    4103                    
    4104                    $C$DW$210       .dwtag  DW_TAG_member
    4105                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    4106                            .dwattr $C$DW$210, DW_AT_name("WAKEMASKSET1")
    4107                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("WAKEMASKSET1")
    4108                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
    4109                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4110                            .dwattr $C$DW$210, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4111                            .dwattr $C$DW$210, DW_AT_decl_line(0x60)
    4112                            .dwattr $C$DW$210, DW_AT_decl_column(0x11)
    4113                    
    4114                    $C$DW$211       .dwtag  DW_TAG_member
    4115                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    4116                            .dwattr $C$DW$211, DW_AT_name("WAKEMASKSET2")
    4117                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("WAKEMASKSET2")
    4118                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    4119                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4120                            .dwattr $C$DW$211, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4121                            .dwattr $C$DW$211, DW_AT_decl_line(0x61)
    4122                            .dwattr $C$DW$211, DW_AT_decl_column(0x11)
    4123                    
    4124                    $C$DW$212       .dwtag  DW_TAG_member
    4125                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   76

    4126                            .dwattr $C$DW$212, DW_AT_name("WAKEMASKSET3")
    4127                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("WAKEMASKSET3")
    4128                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
    4129                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4130                            .dwattr $C$DW$212, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4131                            .dwattr $C$DW$212, DW_AT_decl_line(0x62)
    4132                            .dwattr $C$DW$212, DW_AT_decl_column(0x11)
    4133                    
    4134                    $C$DW$213       .dwtag  DW_TAG_member
    4135                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    4136                            .dwattr $C$DW$213, DW_AT_name("WAKEMASKCLR0")
    4137                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("WAKEMASKCLR0")
    4138                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
    4139                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4140                            .dwattr $C$DW$213, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4141                            .dwattr $C$DW$213, DW_AT_decl_line(0x63)
    4142                            .dwattr $C$DW$213, DW_AT_decl_column(0x11)
    4143                    
    4144                    $C$DW$214       .dwtag  DW_TAG_member
    4145                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    4146                            .dwattr $C$DW$214, DW_AT_name("WAKEMASKCLR1")
    4147                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("WAKEMASKCLR1")
    4148                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    4149                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4150                            .dwattr $C$DW$214, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4151                            .dwattr $C$DW$214, DW_AT_decl_line(0x64)
    4152                            .dwattr $C$DW$214, DW_AT_decl_column(0x11)
    4153                    
    4154                    $C$DW$215       .dwtag  DW_TAG_member
    4155                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    4156                            .dwattr $C$DW$215, DW_AT_name("WAKEMASKCLR2")
    4157                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("WAKEMASKCLR2")
    4158                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    4159                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4160                            .dwattr $C$DW$215, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4161                            .dwattr $C$DW$215, DW_AT_decl_line(0x65)
    4162                            .dwattr $C$DW$215, DW_AT_decl_column(0x11)
    4163                    
    4164                    $C$DW$216       .dwtag  DW_TAG_member
    4165                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    4166                            .dwattr $C$DW$216, DW_AT_name("WAKEMASKCLR3")
    4167                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("WAKEMASKCLR3")
    4168                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
    4169                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4170                            .dwattr $C$DW$216, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4171                            .dwattr $C$DW$216, DW_AT_decl_line(0x66)
    4172                            .dwattr $C$DW$216, DW_AT_decl_column(0x11)
    4173                    
    4174                    $C$DW$217       .dwtag  DW_TAG_member
    4175                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    4176                            .dwattr $C$DW$217, DW_AT_name("IRQVECREG")
    4177                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("IRQVECREG")
    4178                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    4179                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4180                            .dwattr $C$DW$217, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   77

    4181                            .dwattr $C$DW$217, DW_AT_decl_line(0x67)
    4182                            .dwattr $C$DW$217, DW_AT_decl_column(0x11)
    4183                    
    4184                    $C$DW$218       .dwtag  DW_TAG_member
    4185                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    4186                            .dwattr $C$DW$218, DW_AT_name("FIQVECREG")
    4187                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("FIQVECREG")
    4188                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
    4189                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4190                            .dwattr $C$DW$218, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4191                            .dwattr $C$DW$218, DW_AT_decl_line(0x68)
    4192                            .dwattr $C$DW$218, DW_AT_decl_column(0x11)
    4193                    
    4194                    $C$DW$219       .dwtag  DW_TAG_member
    4195                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    4196                            .dwattr $C$DW$219, DW_AT_name("CAPEVT")
    4197                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("CAPEVT")
    4198                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    4199                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4200                            .dwattr $C$DW$219, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4201                            .dwattr $C$DW$219, DW_AT_decl_line(0x69)
    4202                            .dwattr $C$DW$219, DW_AT_decl_column(0x11)
    4203                    
    4204                    $C$DW$220       .dwtag  DW_TAG_member
    4205                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    4206                            .dwattr $C$DW$220, DW_AT_name("rsvd4")
    4207                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("rsvd4")
    4208                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
    4209                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4210                            .dwattr $C$DW$220, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4211                            .dwattr $C$DW$220, DW_AT_decl_line(0x6a)
    4212                            .dwattr $C$DW$220, DW_AT_decl_column(0x11)
    4213                    
    4214                    $C$DW$221       .dwtag  DW_TAG_member
    4215                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$26)
    4216                            .dwattr $C$DW$221, DW_AT_name("CHANCTRL")
    4217                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("CHANCTRL")
    4218                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    4219                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4220                            .dwattr $C$DW$221, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4221                            .dwattr $C$DW$221, DW_AT_decl_line(0x6b)
    4222                            .dwattr $C$DW$221, DW_AT_decl_column(0x11)
    4223                    
    4224                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4225                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x43)
    4226                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x19)
    4227                            .dwendtag $C$DW$T$27
    4228                    
    4229                    $C$DW$T$98      .dwtag  DW_TAG_volatile_type
    4230                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$27)
    4231                    
    4232                    $C$DW$T$99      .dwtag  DW_TAG_typedef
    4233                            .dwattr $C$DW$T$99, DW_AT_name("vimBASE_t")
    4234                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    4235                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   78

    4236                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4237                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x6c)
    4238                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x03)
    4239                    
    4240                    
    4241                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4242                            .dwattr $C$DW$T$28, DW_AT_name("vim_config_reg")
    4243                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x94)
    4244                    $C$DW$222       .dwtag  DW_TAG_member
    4245                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    4246                            .dwattr $C$DW$222, DW_AT_name("CONFIG_FIRQPR0")
    4247                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("CONFIG_FIRQPR0")
    4248                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4249                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4250                            .dwattr $C$DW$222, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4251                            .dwattr $C$DW$222, DW_AT_decl_line(0x73)
    4252                            .dwattr $C$DW$222, DW_AT_decl_column(0x0c)
    4253                    
    4254                    $C$DW$223       .dwtag  DW_TAG_member
    4255                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    4256                            .dwattr $C$DW$223, DW_AT_name("CONFIG_FIRQPR1")
    4257                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("CONFIG_FIRQPR1")
    4258                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4259                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4260                            .dwattr $C$DW$223, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4261                            .dwattr $C$DW$223, DW_AT_decl_line(0x74)
    4262                            .dwattr $C$DW$223, DW_AT_decl_column(0x0c)
    4263                    
    4264                    $C$DW$224       .dwtag  DW_TAG_member
    4265                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    4266                            .dwattr $C$DW$224, DW_AT_name("CONFIG_FIRQPR2")
    4267                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("CONFIG_FIRQPR2")
    4268                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4269                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4270                            .dwattr $C$DW$224, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4271                            .dwattr $C$DW$224, DW_AT_decl_line(0x75)
    4272                            .dwattr $C$DW$224, DW_AT_decl_column(0x0c)
    4273                    
    4274                    $C$DW$225       .dwtag  DW_TAG_member
    4275                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    4276                            .dwattr $C$DW$225, DW_AT_name("CONFIG_FIRQPR3")
    4277                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("CONFIG_FIRQPR3")
    4278                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4279                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4280                            .dwattr $C$DW$225, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4281                            .dwattr $C$DW$225, DW_AT_decl_line(0x76)
    4282                            .dwattr $C$DW$225, DW_AT_decl_column(0x0c)
    4283                    
    4284                    $C$DW$226       .dwtag  DW_TAG_member
    4285                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    4286                            .dwattr $C$DW$226, DW_AT_name("CONFIG_REQMASKSET0")
    4287                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("CONFIG_REQMASKSET0")
    4288                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4289                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4290                            .dwattr $C$DW$226, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   79

    4291                            .dwattr $C$DW$226, DW_AT_decl_line(0x77)
    4292                            .dwattr $C$DW$226, DW_AT_decl_column(0x0c)
    4293                    
    4294                    $C$DW$227       .dwtag  DW_TAG_member
    4295                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    4296                            .dwattr $C$DW$227, DW_AT_name("CONFIG_REQMASKSET1")
    4297                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("CONFIG_REQMASKSET1")
    4298                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4299                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4300                            .dwattr $C$DW$227, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4301                            .dwattr $C$DW$227, DW_AT_decl_line(0x78)
    4302                            .dwattr $C$DW$227, DW_AT_decl_column(0x0c)
    4303                    
    4304                    $C$DW$228       .dwtag  DW_TAG_member
    4305                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    4306                            .dwattr $C$DW$228, DW_AT_name("CONFIG_REQMASKSET2")
    4307                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("CONFIG_REQMASKSET2")
    4308                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4309                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4310                            .dwattr $C$DW$228, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4311                            .dwattr $C$DW$228, DW_AT_decl_line(0x79)
    4312                            .dwattr $C$DW$228, DW_AT_decl_column(0x0c)
    4313                    
    4314                    $C$DW$229       .dwtag  DW_TAG_member
    4315                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    4316                            .dwattr $C$DW$229, DW_AT_name("CONFIG_REQMASKSET3")
    4317                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("CONFIG_REQMASKSET3")
    4318                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4319                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4320                            .dwattr $C$DW$229, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4321                            .dwattr $C$DW$229, DW_AT_decl_line(0x7a)
    4322                            .dwattr $C$DW$229, DW_AT_decl_column(0x0c)
    4323                    
    4324                    $C$DW$230       .dwtag  DW_TAG_member
    4325                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    4326                            .dwattr $C$DW$230, DW_AT_name("CONFIG_WAKEMASKSET0")
    4327                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("CONFIG_WAKEMASKSET0")
    4328                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4329                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4330                            .dwattr $C$DW$230, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4331                            .dwattr $C$DW$230, DW_AT_decl_line(0x7b)
    4332                            .dwattr $C$DW$230, DW_AT_decl_column(0x0c)
    4333                    
    4334                    $C$DW$231       .dwtag  DW_TAG_member
    4335                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    4336                            .dwattr $C$DW$231, DW_AT_name("CONFIG_WAKEMASKSET1")
    4337                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("CONFIG_WAKEMASKSET1")
    4338                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4339                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4340                            .dwattr $C$DW$231, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4341                            .dwattr $C$DW$231, DW_AT_decl_line(0x7c)
    4342                            .dwattr $C$DW$231, DW_AT_decl_column(0x0c)
    4343                    
    4344                    $C$DW$232       .dwtag  DW_TAG_member
    4345                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1063210                              PAGE   80

    4346                            .dwattr $C$DW$232, DW_AT_name("CONFIG_WAKEMASKSET2")
    4347                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("CONFIG_WAKEMASKSET2")
    4348                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4349                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4350                            .dwattr $C$DW$232, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4351                            .dwattr $C$DW$232, DW_AT_decl_line(0x7d)
    4352                            .dwattr $C$DW$232, DW_AT_decl_column(0x0c)
    4353                    
    4354                    $C$DW$233       .dwtag  DW_TAG_member
    4355                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    4356                            .dwattr $C$DW$233, DW_AT_name("CONFIG_WAKEMASKSET3")
    4357                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("CONFIG_WAKEMASKSET3")
    4358                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4359                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4360                            .dwattr $C$DW$233, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4361                            .dwattr $C$DW$233, DW_AT_decl_line(0x7e)
    4362                            .dwattr $C$DW$233, DW_AT_decl_column(0x0c)
    4363                    
    4364                    $C$DW$234       .dwtag  DW_TAG_member
    4365                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    4366                            .dwattr $C$DW$234, DW_AT_name("CONFIG_CAPEVT")
    4367                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("CONFIG_CAPEVT")
    4368                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4369                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4370                            .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
