TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 13:27:08 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_epc.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    ;       C:\ti\ccsv7\tools\compiler\ti-cgt-arm_16.9.0.LTS\bin\armacpia.exe -@C:\\Users\\bob\\AppData\\L

    1862                            .dwattr $C$DW$T$92, DW_AT_name("uint_least64_t")
    1863                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$89)
    1864                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1865                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1866                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x41)
    1867                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x16)
    1868                    
    1869                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    1870                            .dwattr $C$DW$T$93, DW_AT_name("uintmax_t")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   35

    1871                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$15)
    1872                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1873                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    1874                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x57)
    1875                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x20)
    1876                    
    1877                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1878                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1879                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1880                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1881                    
    1882                    $C$DW$T$94      .dwtag  DW_TAG_typedef
    1883                            .dwattr $C$DW$T$94, DW_AT_name("float32")
    1884                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$16)
    1885                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    1886                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1887                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x6d)
    1888                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x0f)
    1889                    
    1890                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1891                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1892                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1893                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1894                    
    1895                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    1896                            .dwattr $C$DW$T$95, DW_AT_name("float64")
    1897                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$17)
    1898                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1899                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1900                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x72)
    1901                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x10)
    1902                    
    1903                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1904                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1905                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1906                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1907                    
    1908                    $C$DW$T$96      .dwtag  DW_TAG_base_type
    1909                            .dwattr $C$DW$T$96, DW_AT_encoding(DW_ATE_unsigned_char)
    1910                            .dwattr $C$DW$T$96, DW_AT_name("unsigned char")
    1911                            .dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
    1912                    
    1913                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    1914                            .dwattr $C$DW$T$97, DW_AT_name("boolean")
    1915                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    1916                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1917                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1918                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x53)
    1919                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x0f)
    1920                    
    1921                    $C$DW$T$101     .dwtag  DW_TAG_typedef
    1922                            .dwattr $C$DW$T$101, DW_AT_name("tBoolean")
    1923                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$97)
    1924                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    1925                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   36

    1926                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x40)
    1927                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x11)
    1928                    
    1929                    
    1930                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1931                            .dwattr $C$DW$T$21, DW_AT_name("ccmr5Base")
    1932                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x28)
    1933                    $C$DW$101       .dwtag  DW_TAG_member
    1934                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    1935                            .dwattr $C$DW$101, DW_AT_name("CCMSR1")
    1936                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("CCMSR1")
    1937                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1939                            .dwattr $C$DW$101, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    1940                            .dwattr $C$DW$101, DW_AT_decl_line(0x45)
    1941                            .dwattr $C$DW$101, DW_AT_decl_column(0x0c)
    1942                    
    1943                    $C$DW$102       .dwtag  DW_TAG_member
    1944                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    1945                            .dwattr $C$DW$102, DW_AT_name("CCMKEYR1")
    1946                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("CCMKEYR1")
    1947                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1948                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1949                            .dwattr $C$DW$102, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    1950                            .dwattr $C$DW$102, DW_AT_decl_line(0x46)
    1951                            .dwattr $C$DW$102, DW_AT_decl_column(0x0c)
    1952                    
    1953                    $C$DW$103       .dwtag  DW_TAG_member
    1954                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1955                            .dwattr $C$DW$103, DW_AT_name("CCMSR2")
    1956                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("CCMSR2")
    1957                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1958                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1959                            .dwattr $C$DW$103, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    1960                            .dwattr $C$DW$103, DW_AT_decl_line(0x47)
    1961                            .dwattr $C$DW$103, DW_AT_decl_column(0x0c)
    1962                    
    1963                    $C$DW$104       .dwtag  DW_TAG_member
    1964                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1965                            .dwattr $C$DW$104, DW_AT_name("CCMKEYR2")
    1966                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("CCMKEYR2")
    1967                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1968                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1969                            .dwattr $C$DW$104, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    1970                            .dwattr $C$DW$104, DW_AT_decl_line(0x48)
    1971                            .dwattr $C$DW$104, DW_AT_decl_column(0x0c)
    1972                    
    1973                    $C$DW$105       .dwtag  DW_TAG_member
    1974                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    1975                            .dwattr $C$DW$105, DW_AT_name("CCMSR3")
    1976                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("CCMSR3")
    1977                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1978                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1979                            .dwattr $C$DW$105, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    1980                            .dwattr $C$DW$105, DW_AT_decl_line(0x49)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   37

    1981                            .dwattr $C$DW$105, DW_AT_decl_column(0x0c)
    1982                    
    1983                    $C$DW$106       .dwtag  DW_TAG_member
    1984                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1985                            .dwattr $C$DW$106, DW_AT_name("CCMKEYR3")
    1986                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("CCMKEYR3")
    1987                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1988                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1989                            .dwattr $C$DW$106, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    1990                            .dwattr $C$DW$106, DW_AT_decl_line(0x4a)
    1991                            .dwattr $C$DW$106, DW_AT_decl_column(0x0c)
    1992                    
    1993                    $C$DW$107       .dwtag  DW_TAG_member
    1994                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    1995                            .dwattr $C$DW$107, DW_AT_name("CCMPOLCNTRL")
    1996                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("CCMPOLCNTRL")
    1997                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1998                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1999                            .dwattr $C$DW$107, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2000                            .dwattr $C$DW$107, DW_AT_decl_line(0x4b)
    2001                            .dwattr $C$DW$107, DW_AT_decl_column(0x0c)
    2002                    
    2003                    $C$DW$108       .dwtag  DW_TAG_member
    2004                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    2005                            .dwattr $C$DW$108, DW_AT_name("CCMSR4")
    2006                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("CCMSR4")
    2007                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2008                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2009                            .dwattr $C$DW$108, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2010                            .dwattr $C$DW$108, DW_AT_decl_line(0x4c)
    2011                            .dwattr $C$DW$108, DW_AT_decl_column(0x0c)
    2012                    
    2013                    $C$DW$109       .dwtag  DW_TAG_member
    2014                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    2015                            .dwattr $C$DW$109, DW_AT_name("CCMKEYR4")
    2016                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("CCMKEYR4")
    2017                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2018                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2019                            .dwattr $C$DW$109, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2020                            .dwattr $C$DW$109, DW_AT_decl_line(0x4d)
    2021                            .dwattr $C$DW$109, DW_AT_decl_column(0x0c)
    2022                    
    2023                    $C$DW$110       .dwtag  DW_TAG_member
    2024                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    2025                            .dwattr $C$DW$110, DW_AT_name("CCMPDSTAT0")
    2026                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("CCMPDSTAT0")
    2027                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2028                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2029                            .dwattr $C$DW$110, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2030                            .dwattr $C$DW$110, DW_AT_decl_line(0x4e)
    2031                            .dwattr $C$DW$110, DW_AT_decl_column(0x0c)
    2032                    
    2033                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2034                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x43)
    2035                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x19)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   38

    2036                            .dwendtag $C$DW$T$21
    2037                    
    2038                    $C$DW$T$102     .dwtag  DW_TAG_volatile_type
    2039                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$21)
    2040                    
    2041                    $C$DW$T$103     .dwtag  DW_TAG_typedef
    2042                            .dwattr $C$DW$T$103, DW_AT_name("ccmr5BASE_t")
    2043                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    2044                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2045                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2046                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x4f)
    2047                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x03)
    2048                    
    2049                    
    2050                    $C$DW$T$104     .dwtag  DW_TAG_enumeration_type
    2051                            .dwattr $C$DW$T$104, DW_AT_name("config_value_type")
    2052                            .dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
    2053                    $C$DW$111       .dwtag  DW_TAG_enumerator
    2054                            .dwattr $C$DW$111, DW_AT_name("InitialValue")
    2055                            .dwattr $C$DW$111, DW_AT_const_value(0x00)
    2056                            .dwattr $C$DW$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2057                            .dwattr $C$DW$111, DW_AT_decl_line(0x5c)
    2058                            .dwattr $C$DW$111, DW_AT_decl_column(0x02)
    2059                    
    2060                    $C$DW$112       .dwtag  DW_TAG_enumerator
    2061                            .dwattr $C$DW$112, DW_AT_name("CurrentValue")
    2062                            .dwattr $C$DW$112, DW_AT_const_value(0x01)
    2063                            .dwattr $C$DW$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2064                            .dwattr $C$DW$112, DW_AT_decl_line(0x5d)
    2065                            .dwattr $C$DW$112, DW_AT_decl_column(0x02)
    2066                    
    2067                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2068                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x5a)
    2069                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x0e)
    2070                            .dwendtag $C$DW$T$104
    2071                    
    2072                    $C$DW$T$105     .dwtag  DW_TAG_typedef
    2073                            .dwattr $C$DW$T$105, DW_AT_name("config_value_type_t")
    2074                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    2075                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    2076                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2077                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x5e)
    2078                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x02)
    2079                    
    2080                    
    2081                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2082                            .dwattr $C$DW$T$27, DW_AT_name("epcBase")
    2083                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x220)
    2084                    $C$DW$113       .dwtag  DW_TAG_member
    2085                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    2086                            .dwattr $C$DW$113, DW_AT_name("EPCREVID")
    2087                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("EPCREVID")
    2088                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2090                            .dwattr $C$DW$113, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   39

    2091                            .dwattr $C$DW$113, DW_AT_decl_line(0x49)
    2092                            .dwattr $C$DW$113, DW_AT_decl_column(0x0c)
    2093                    
    2094                    $C$DW$114       .dwtag  DW_TAG_member
    2095                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    2096                            .dwattr $C$DW$114, DW_AT_name("EPCCNTRL")
    2097                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("EPCCNTRL")
    2098                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2099                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2100                            .dwattr $C$DW$114, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2101                            .dwattr $C$DW$114, DW_AT_decl_line(0x4a)
    2102                            .dwattr $C$DW$114, DW_AT_decl_column(0x0c)
    2103                    
    2104                    $C$DW$115       .dwtag  DW_TAG_member
    2105                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    2106                            .dwattr $C$DW$115, DW_AT_name("UERRSTAT")
    2107                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("UERRSTAT")
    2108                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2109                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2110                            .dwattr $C$DW$115, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2111                            .dwattr $C$DW$115, DW_AT_decl_line(0x4b)
    2112                            .dwattr $C$DW$115, DW_AT_decl_column(0x0c)
    2113                    
    2114                    $C$DW$116       .dwtag  DW_TAG_member
    2115                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    2116                            .dwattr $C$DW$116, DW_AT_name("EPCERRSTAT")
    2117                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("EPCERRSTAT")
    2118                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2119                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2120                            .dwattr $C$DW$116, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2121                            .dwattr $C$DW$116, DW_AT_decl_line(0x4c)
    2122                            .dwattr $C$DW$116, DW_AT_decl_column(0x0c)
    2123                    
    2124                    $C$DW$117       .dwtag  DW_TAG_member
    2125                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    2126                            .dwattr $C$DW$117, DW_AT_name("FIFOFULLSTAT")
    2127                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("FIFOFULLSTAT")
    2128                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2129                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2130                            .dwattr $C$DW$117, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2131                            .dwattr $C$DW$117, DW_AT_decl_line(0x4d)
    2132                            .dwattr $C$DW$117, DW_AT_decl_column(0x0c)
    2133                    
    2134                    $C$DW$118       .dwtag  DW_TAG_member
    2135                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    2136                            .dwattr $C$DW$118, DW_AT_name("OVRFLWSTAT")
    2137                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("OVRFLWSTAT")
    2138                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2139                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2140                            .dwattr $C$DW$118, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2141                            .dwattr $C$DW$118, DW_AT_decl_line(0x4e)
    2142                            .dwattr $C$DW$118, DW_AT_decl_column(0x0c)
    2143                    
    2144                    $C$DW$119       .dwtag  DW_TAG_member
    2145                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   40

    2146                            .dwattr $C$DW$119, DW_AT_name("CAMAVAILSTAT")
    2147                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("CAMAVAILSTAT")
    2148                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2149                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2150                            .dwattr $C$DW$119, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2151                            .dwattr $C$DW$119, DW_AT_decl_line(0x4f)
    2152                            .dwattr $C$DW$119, DW_AT_decl_column(0x0c)
    2153                    
    2154                    $C$DW$120       .dwtag  DW_TAG_member
    2155                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    2156                            .dwattr $C$DW$120, DW_AT_name("rsvd1")
    2157                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd1")
    2158                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2159                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2160                            .dwattr $C$DW$120, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2161                            .dwattr $C$DW$120, DW_AT_decl_line(0x50)
    2162                            .dwattr $C$DW$120, DW_AT_decl_column(0x0c)
    2163                    
    2164                    $C$DW$121       .dwtag  DW_TAG_member
    2165                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$22)
    2166                            .dwattr $C$DW$121, DW_AT_name("UERRADDR")
    2167                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("UERRADDR")
    2168                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2169                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2170                            .dwattr $C$DW$121, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2171                            .dwattr $C$DW$121, DW_AT_decl_line(0x51)
    2172                            .dwattr $C$DW$121, DW_AT_decl_column(0x0c)
    2173                    
    2174                    $C$DW$122       .dwtag  DW_TAG_member
    2175                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$23)
    2176                            .dwattr $C$DW$122, DW_AT_name("rsvd2")
    2177                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("rsvd2")
    2178                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2179                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2180                            .dwattr $C$DW$122, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2181                            .dwattr $C$DW$122, DW_AT_decl_line(0x52)
    2182                            .dwattr $C$DW$122, DW_AT_decl_column(0x0c)
    2183                    
    2184                    $C$DW$123       .dwtag  DW_TAG_member
    2185                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$24)
    2186                            .dwattr $C$DW$123, DW_AT_name("CAM_CONTENT")
    2187                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("CAM_CONTENT")
    2188                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2189                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2190                            .dwattr $C$DW$123, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2191                            .dwattr $C$DW$123, DW_AT_decl_line(0x53)
    2192                            .dwattr $C$DW$123, DW_AT_decl_column(0x0c)
    2193                    
    2194                    $C$DW$124       .dwtag  DW_TAG_member
    2195                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$25)
    2196                            .dwattr $C$DW$124, DW_AT_name("rsvd3")
    2197                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("rsvd3")
    2198                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2199                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2200                            .dwattr $C$DW$124, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   41

    2201                            .dwattr $C$DW$124, DW_AT_decl_line(0x54)
    2202                            .dwattr $C$DW$124, DW_AT_decl_column(0x0c)
    2203                    
    2204                    $C$DW$125       .dwtag  DW_TAG_member
    2205                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$26)
    2206                            .dwattr $C$DW$125, DW_AT_name("CAM_INDEX")
    2207                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("CAM_INDEX")
    2208                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    2209                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2210                            .dwattr $C$DW$125, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2211                            .dwattr $C$DW$125, DW_AT_decl_line(0x55)
    2212                            .dwattr $C$DW$125, DW_AT_decl_column(0x09)
    2213                    
    2214                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2215                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x47)
    2216                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x19)
    2217                            .dwendtag $C$DW$T$27
    2218                    
    2219                    $C$DW$T$106     .dwtag  DW_TAG_volatile_type
    2220                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$27)
    2221                    
    2222                    $C$DW$T$107     .dwtag  DW_TAG_typedef
    2223                            .dwattr $C$DW$T$107, DW_AT_name("epcBASE_t")
    2224                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    2225                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    2226                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2227                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x56)
    2228                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x03)
    2229                    
    2230                    
    2231                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2232                            .dwattr $C$DW$T$30, DW_AT_name("esmBase")
    2233                            .dwattr $C$DW$T$30, DW_AT_byte_size(0xa4)
    2234                    $C$DW$126       .dwtag  DW_TAG_member
    2235                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    2236                            .dwattr $C$DW$126, DW_AT_name("EEPAPR1")
    2237                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("EEPAPR1")
    2238                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2239                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2240                            .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2241                            .dwattr $C$DW$126, DW_AT_decl_line(0x48)
    2242                            .dwattr $C$DW$126, DW_AT_decl_column(0x0c)
    2243                    
    2244                    $C$DW$127       .dwtag  DW_TAG_member
    2245                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    2246                            .dwattr $C$DW$127, DW_AT_name("DEPAPR1")
    2247                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("DEPAPR1")
    2248                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2249                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2250                            .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2251                            .dwattr $C$DW$127, DW_AT_decl_line(0x49)
    2252                            .dwattr $C$DW$127, DW_AT_decl_column(0x0c)
    2253                    
    2254                    $C$DW$128       .dwtag  DW_TAG_member
    2255                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   42

    2256                            .dwattr $C$DW$128, DW_AT_name("IESR1")
    2257                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("IESR1")
    2258                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2259                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2260                            .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2261                            .dwattr $C$DW$128, DW_AT_decl_line(0x4a)
    2262                            .dwattr $C$DW$128, DW_AT_decl_column(0x0c)
    2263                    
    2264                    $C$DW$129       .dwtag  DW_TAG_member
    2265                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    2266                            .dwattr $C$DW$129, DW_AT_name("IECR1")
    2267                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("IECR1")
    2268                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2269                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2270                            .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2271                            .dwattr $C$DW$129, DW_AT_decl_line(0x4b)
    2272                            .dwattr $C$DW$129, DW_AT_decl_column(0x0c)
    2273                    
    2274                    $C$DW$130       .dwtag  DW_TAG_member
    2275                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    2276                            .dwattr $C$DW$130, DW_AT_name("ILSR1")
    2277                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("ILSR1")
    2278                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2279                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2280                            .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2281                            .dwattr $C$DW$130, DW_AT_decl_line(0x4c)
    2282                            .dwattr $C$DW$130, DW_AT_decl_column(0x0c)
    2283                    
    2284                    $C$DW$131       .dwtag  DW_TAG_member
    2285                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    2286                            .dwattr $C$DW$131, DW_AT_name("ILCR1")
    2287                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("ILCR1")
    2288                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2289                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2290                            .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2291                            .dwattr $C$DW$131, DW_AT_decl_line(0x4d)
    2292                            .dwattr $C$DW$131, DW_AT_decl_column(0x0c)
    2293                    
    2294                    $C$DW$132       .dwtag  DW_TAG_member
    2295                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$28)
    2296                            .dwattr $C$DW$132, DW_AT_name("SR1")
    2297                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("SR1")
    2298                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2299                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2300                            .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2301                            .dwattr $C$DW$132, DW_AT_decl_line(0x4e)
    2302                            .dwattr $C$DW$132, DW_AT_decl_column(0x0c)
    2303                    
    2304                    $C$DW$133       .dwtag  DW_TAG_member
    2305                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    2306                            .dwattr $C$DW$133, DW_AT_name("EPSR")
    2307                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("EPSR")
    2308                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2309                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2310                            .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   43

    2311                            .dwattr $C$DW$133, DW_AT_decl_line(0x4f)
    2312                            .dwattr $C$DW$133, DW_AT_decl_column(0x0c)
    2313                    
    2314                    $C$DW$134       .dwtag  DW_TAG_member
    2315                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    2316                            .dwattr $C$DW$134, DW_AT_name("IOFFHR")
    2317                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("IOFFHR")
    2318                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2319                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2320                            .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2321                            .dwattr $C$DW$134, DW_AT_decl_line(0x50)
    2322                            .dwattr $C$DW$134, DW_AT_decl_column(0x0c)
    2323                    
    2324                    $C$DW$135       .dwtag  DW_TAG_member
    2325                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    2326                            .dwattr $C$DW$135, DW_AT_name("IOFFLR")
    2327                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("IOFFLR")
    2328                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2329                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2330                            .dwattr $C$DW$135, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2331                            .dwattr $C$DW$135, DW_AT_decl_line(0x51)
    2332                            .dwattr $C$DW$135, DW_AT_decl_column(0x0c)
    2333                    
    2334                    $C$DW$136       .dwtag  DW_TAG_member
    2335                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    2336                            .dwattr $C$DW$136, DW_AT_name("LTCR")
    2337                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("LTCR")
    2338                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2339                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2340                            .dwattr $C$DW$136, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2341                            .dwattr $C$DW$136, DW_AT_decl_line(0x52)
    2342                            .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    2343                    
    2344                    $C$DW$137       .dwtag  DW_TAG_member
    2345                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    2346                            .dwattr $C$DW$137, DW_AT_name("LTCPR")
    2347                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("LTCPR")
    2348                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2349                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2350                            .dwattr $C$DW$137, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2351                            .dwattr $C$DW$137, DW_AT_decl_line(0x53)
    2352                            .dwattr $C$DW$137, DW_AT_decl_column(0x0c)
    2353                    
    2354                    $C$DW$138       .dwtag  DW_TAG_member
    2355                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    2356                            .dwattr $C$DW$138, DW_AT_name("EKR")
    2357                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("EKR")
    2358                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2359                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2360                            .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2361                            .dwattr $C$DW$138, DW_AT_decl_line(0x54)
    2362                            .dwattr $C$DW$138, DW_AT_decl_column(0x0c)
    2363                    
    2364                    $C$DW$139       .dwtag  DW_TAG_member
    2365                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   44

    2366                            .dwattr $C$DW$139, DW_AT_name("SSR2")
    2367                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("SSR2")
    2368                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2369                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2370                            .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2371                            .dwattr $C$DW$139, DW_AT_decl_line(0x55)
    2372                            .dwattr $C$DW$139, DW_AT_decl_column(0x0c)
    2373                    
    2374                    $C$DW$140       .dwtag  DW_TAG_member
    2375                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    2376                            .dwattr $C$DW$140, DW_AT_name("IEPSR4")
    2377                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("IEPSR4")
    2378                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2379                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2380                            .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2381                            .dwattr $C$DW$140, DW_AT_decl_line(0x56)
    2382                            .dwattr $C$DW$140, DW_AT_decl_column(0x0c)
    2383                    
    2384                    $C$DW$141       .dwtag  DW_TAG_member
    2385                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    2386                            .dwattr $C$DW$141, DW_AT_name("IEPCR4")
    2387                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("IEPCR4")
    2388                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2389                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2390                            .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2391                            .dwattr $C$DW$141, DW_AT_decl_line(0x57)
    2392                            .dwattr $C$DW$141, DW_AT_decl_column(0x0c)
    2393                    
    2394                    $C$DW$142       .dwtag  DW_TAG_member
    2395                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    2396                            .dwattr $C$DW$142, DW_AT_name("IESR4")
    2397                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("IESR4")
    2398                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2399                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2400                            .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2401                            .dwattr $C$DW$142, DW_AT_decl_line(0x58)
    2402                            .dwattr $C$DW$142, DW_AT_decl_column(0x0c)
    2403                    
    2404                    $C$DW$143       .dwtag  DW_TAG_member
    2405                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    2406                            .dwattr $C$DW$143, DW_AT_name("IECR4")
    2407                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("IECR4")
    2408                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2409                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2410                            .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2411                            .dwattr $C$DW$143, DW_AT_decl_line(0x59)
    2412                            .dwattr $C$DW$143, DW_AT_decl_column(0x0c)
    2413                    
    2414                    $C$DW$144       .dwtag  DW_TAG_member
    2415                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    2416                            .dwattr $C$DW$144, DW_AT_name("ILSR4")
    2417                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("ILSR4")
    2418                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2419                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2420                            .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   45

    2421                            .dwattr $C$DW$144, DW_AT_decl_line(0x5a)
    2422                            .dwattr $C$DW$144, DW_AT_decl_column(0x0c)
    2423                    
    2424                    $C$DW$145       .dwtag  DW_TAG_member
    2425                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    2426                            .dwattr $C$DW$145, DW_AT_name("ILCR4")
    2427                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("ILCR4")
    2428                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2429                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2430                            .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2431                            .dwattr $C$DW$145, DW_AT_decl_line(0x5b)
    2432                            .dwattr $C$DW$145, DW_AT_decl_column(0x0c)
    2433                    
    2434                    $C$DW$146       .dwtag  DW_TAG_member
    2435                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$28)
    2436                            .dwattr $C$DW$146, DW_AT_name("SR4")
    2437                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("SR4")
    2438                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2439                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2440                            .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2441                            .dwattr $C$DW$146, DW_AT_decl_line(0x5c)
    2442                            .dwattr $C$DW$146, DW_AT_decl_column(0x0c)
    2443                    
    2444                    $C$DW$147       .dwtag  DW_TAG_member
    2445                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$29)
    2446                            .dwattr $C$DW$147, DW_AT_name("rsvd1")
    2447                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("rsvd1")
    2448                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2449                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2450                            .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2451                            .dwattr $C$DW$147, DW_AT_decl_line(0x5d)
    2452                            .dwattr $C$DW$147, DW_AT_decl_column(0x0c)
    2453                    
    2454                    $C$DW$148       .dwtag  DW_TAG_member
    2455                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    2456                            .dwattr $C$DW$148, DW_AT_name("IEPSR7")
    2457                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("IEPSR7")
    2458                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2459                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2460                            .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2461                            .dwattr $C$DW$148, DW_AT_decl_line(0x5e)
    2462                            .dwattr $C$DW$148, DW_AT_decl_column(0x0c)
    2463                    
    2464                    $C$DW$149       .dwtag  DW_TAG_member
    2465                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    2466                            .dwattr $C$DW$149, DW_AT_name("IEPCR7")
    2467                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("IEPCR7")
    2468                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2469                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2470                            .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2471                            .dwattr $C$DW$149, DW_AT_decl_line(0x5f)
    2472                            .dwattr $C$DW$149, DW_AT_decl_column(0x0c)
    2473                    
    2474                    $C$DW$150       .dwtag  DW_TAG_member
    2475                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   46

    2476                            .dwattr $C$DW$150, DW_AT_name("IESR7")
    2477                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("IESR7")
    2478                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2479                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2480                            .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2481                            .dwattr $C$DW$150, DW_AT_decl_line(0x60)
    2482                            .dwattr $C$DW$150, DW_AT_decl_column(0x0c)
    2483                    
    2484                    $C$DW$151       .dwtag  DW_TAG_member
    2485                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    2486                            .dwattr $C$DW$151, DW_AT_name("IECR7")
    2487                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("IECR7")
    2488                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2489                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2490                            .dwattr $C$DW$151, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2491                            .dwattr $C$DW$151, DW_AT_decl_line(0x61)
    2492                            .dwattr $C$DW$151, DW_AT_decl_column(0x0c)
    2493                    
    2494                    $C$DW$152       .dwtag  DW_TAG_member
    2495                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    2496                            .dwattr $C$DW$152, DW_AT_name("ILSR7")
    2497                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("ILSR7")
    2498                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2499                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2500                            .dwattr $C$DW$152, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2501                            .dwattr $C$DW$152, DW_AT_decl_line(0x62)
    2502                            .dwattr $C$DW$152, DW_AT_decl_column(0x0c)
    2503                    
    2504                    $C$DW$153       .dwtag  DW_TAG_member
    2505                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    2506                            .dwattr $C$DW$153, DW_AT_name("ILCR7")
    2507                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("ILCR7")
    2508                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2509                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2510                            .dwattr $C$DW$153, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2511                            .dwattr $C$DW$153, DW_AT_decl_line(0x63)
    2512                            .dwattr $C$DW$153, DW_AT_decl_column(0x0c)
    2513                    
    2514                    $C$DW$154       .dwtag  DW_TAG_member
    2515                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$28)
    2516                            .dwattr $C$DW$154, DW_AT_name("SR7")
    2517                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("SR7")
    2518                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2519                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2520                            .dwattr $C$DW$154, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2521                            .dwattr $C$DW$154, DW_AT_decl_line(0x64)
    2522                            .dwattr $C$DW$154, DW_AT_decl_column(0x0c)
    2523                    
    2524                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    2525                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x46)
    2526                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x19)
    2527                            .dwendtag $C$DW$T$30
    2528                    
    2529                    $C$DW$T$109     .dwtag  DW_TAG_volatile_type
    2530                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$30)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   47

    2531                    
    2532                    $C$DW$T$110     .dwtag  DW_TAG_typedef
    2533                            .dwattr $C$DW$T$110, DW_AT_name("esmBASE_t")
    2534                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    2535                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    2536                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    2537                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x65)
    2538                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x03)
    2539                    
    2540                    
    2541                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2542                            .dwattr $C$DW$T$35, DW_AT_name("flashWBase")
    2543                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x410)
    2544                    $C$DW$155       .dwtag  DW_TAG_member
    2545                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2546                            .dwattr $C$DW$155, DW_AT_name("FRDCNTL")
    2547                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("FRDCNTL")
    2548                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2549                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2550                            .dwattr $C$DW$155, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2551                            .dwattr $C$DW$155, DW_AT_decl_line(0x48)
    2552                            .dwattr $C$DW$155, DW_AT_decl_column(0x0c)
    2553                    
    2554                    $C$DW$156       .dwtag  DW_TAG_member
    2555                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    2556                            .dwattr $C$DW$156, DW_AT_name("rsvd1")
    2557                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("rsvd1")
    2558                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2559                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2560                            .dwattr $C$DW$156, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2561                            .dwattr $C$DW$156, DW_AT_decl_line(0x49)
    2562                            .dwattr $C$DW$156, DW_AT_decl_column(0x0c)
    2563                    
    2564                    $C$DW$157       .dwtag  DW_TAG_member
    2565                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    2566                            .dwattr $C$DW$157, DW_AT_name("EE_FEDACCTRL1")
    2567                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("EE_FEDACCTRL1")
    2568                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2569                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2570                            .dwattr $C$DW$157, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2571                            .dwattr $C$DW$157, DW_AT_decl_line(0x4a)
    2572                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    2573                    
    2574                    $C$DW$158       .dwtag  DW_TAG_member
    2575                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2576                            .dwattr $C$DW$158, DW_AT_name("rsvd2")
    2577                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("rsvd2")
    2578                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2579                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2580                            .dwattr $C$DW$158, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2581                            .dwattr $C$DW$158, DW_AT_decl_line(0x4b)
    2582                            .dwattr $C$DW$158, DW_AT_decl_column(0x0c)
    2583                    
    2584                    $C$DW$159       .dwtag  DW_TAG_member
    2585                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   48

    2586                            .dwattr $C$DW$159, DW_AT_name("rsvd3")
    2587                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("rsvd3")
    2588                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2589                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2590                            .dwattr $C$DW$159, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2591                            .dwattr $C$DW$159, DW_AT_decl_line(0x4c)
    2592                            .dwattr $C$DW$159, DW_AT_decl_column(0x0c)
    2593                    
    2594                    $C$DW$160       .dwtag  DW_TAG_member
    2595                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2596                            .dwattr $C$DW$160, DW_AT_name("FEDAC_PASTATUS")
    2597                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("FEDAC_PASTATUS")
    2598                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2599                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2600                            .dwattr $C$DW$160, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2601                            .dwattr $C$DW$160, DW_AT_decl_line(0x4d)
    2602                            .dwattr $C$DW$160, DW_AT_decl_column(0x0c)
    2603                    
    2604                    $C$DW$161       .dwtag  DW_TAG_member
    2605                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2606                            .dwattr $C$DW$161, DW_AT_name("FEDAC_PBSTATUS")
    2607                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("FEDAC_PBSTATUS")
    2608                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2609                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2610                            .dwattr $C$DW$161, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2611                            .dwattr $C$DW$161, DW_AT_decl_line(0x4e)
    2612                            .dwattr $C$DW$161, DW_AT_decl_column(0x0c)
    2613                    
    2614                    $C$DW$162       .dwtag  DW_TAG_member
    2615                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2616                            .dwattr $C$DW$162, DW_AT_name("FEDAC_GBLSTATUS")
    2617                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("FEDAC_GBLSTATUS")
    2618                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2619                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2620                            .dwattr $C$DW$162, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2621                            .dwattr $C$DW$162, DW_AT_decl_line(0x4f)
    2622                            .dwattr $C$DW$162, DW_AT_decl_column(0x0c)
    2623                    
    2624                    $C$DW$163       .dwtag  DW_TAG_member
    2625                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2626                            .dwattr $C$DW$163, DW_AT_name("rsvd4")
    2627                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("rsvd4")
    2628                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2629                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2630                            .dwattr $C$DW$163, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2631                            .dwattr $C$DW$163, DW_AT_decl_line(0x50)
    2632                            .dwattr $C$DW$163, DW_AT_decl_column(0x0c)
    2633                    
    2634                    $C$DW$164       .dwtag  DW_TAG_member
    2635                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2636                            .dwattr $C$DW$164, DW_AT_name("FEDACSDIS")
    2637                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("FEDACSDIS")
    2638                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2639                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2640                            .dwattr $C$DW$164, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   49

    2641                            .dwattr $C$DW$164, DW_AT_decl_line(0x51)
    2642                            .dwattr $C$DW$164, DW_AT_decl_column(0x0c)
    2643                    
    2644                    $C$DW$165       .dwtag  DW_TAG_member
    2645                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    2646                            .dwattr $C$DW$165, DW_AT_name("FPRIM_ADD_TAG")
    2647                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("FPRIM_ADD_TAG")
    2648                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2649                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2650                            .dwattr $C$DW$165, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2651                            .dwattr $C$DW$165, DW_AT_decl_line(0x52)
    2652                            .dwattr $C$DW$165, DW_AT_decl_column(0x0c)
    2653                    
    2654                    $C$DW$166       .dwtag  DW_TAG_member
    2655                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2656                            .dwattr $C$DW$166, DW_AT_name("FDUP_ADD_TAG")
    2657                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("FDUP_ADD_TAG")
    2658                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2659                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2660                            .dwattr $C$DW$166, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2661                            .dwattr $C$DW$166, DW_AT_decl_line(0x53)
    2662                            .dwattr $C$DW$166, DW_AT_decl_column(0x0c)
    2663                    
    2664                    $C$DW$167       .dwtag  DW_TAG_member
    2665                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2666                            .dwattr $C$DW$167, DW_AT_name("FBPROT")
    2667                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("FBPROT")
    2668                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2669                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2670                            .dwattr $C$DW$167, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2671                            .dwattr $C$DW$167, DW_AT_decl_line(0x54)
    2672                            .dwattr $C$DW$167, DW_AT_decl_column(0x0c)
    2673                    
    2674                    $C$DW$168       .dwtag  DW_TAG_member
    2675                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    2676                            .dwattr $C$DW$168, DW_AT_name("FBSE")
    2677                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("FBSE")
    2678                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2679                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2680                            .dwattr $C$DW$168, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2681                            .dwattr $C$DW$168, DW_AT_decl_line(0x55)
    2682                            .dwattr $C$DW$168, DW_AT_decl_column(0x0c)
    2683                    
    2684                    $C$DW$169       .dwtag  DW_TAG_member
    2685                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    2686                            .dwattr $C$DW$169, DW_AT_name("FBBUSY")
    2687                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("FBBUSY")
    2688                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2689                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2690                            .dwattr $C$DW$169, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2691                            .dwattr $C$DW$169, DW_AT_decl_line(0x56)
    2692                            .dwattr $C$DW$169, DW_AT_decl_column(0x0c)
    2693                    
    2694                    $C$DW$170       .dwtag  DW_TAG_member
    2695                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   50

    2696                            .dwattr $C$DW$170, DW_AT_name("FBAC")
    2697                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("FBAC")
    2698                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2699                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2700                            .dwattr $C$DW$170, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2701                            .dwattr $C$DW$170, DW_AT_decl_line(0x57)
    2702                            .dwattr $C$DW$170, DW_AT_decl_column(0x0c)
    2703                    
    2704                    $C$DW$171       .dwtag  DW_TAG_member
    2705                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    2706                            .dwattr $C$DW$171, DW_AT_name("FBPWRMODE")
    2707                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("FBPWRMODE")
    2708                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2709                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2710                            .dwattr $C$DW$171, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2711                            .dwattr $C$DW$171, DW_AT_decl_line(0x58)
    2712                            .dwattr $C$DW$171, DW_AT_decl_column(0x0c)
    2713                    
    2714                    $C$DW$172       .dwtag  DW_TAG_member
    2715                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2716                            .dwattr $C$DW$172, DW_AT_name("FBPRDY")
    2717                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("FBPRDY")
    2718                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2719                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2720                            .dwattr $C$DW$172, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2721                            .dwattr $C$DW$172, DW_AT_decl_line(0x59)
    2722                            .dwattr $C$DW$172, DW_AT_decl_column(0x0c)
    2723                    
    2724                    $C$DW$173       .dwtag  DW_TAG_member
    2725                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    2726                            .dwattr $C$DW$173, DW_AT_name("FPAC1")
    2727                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("FPAC1")
    2728                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2729                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2730                            .dwattr $C$DW$173, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2731                            .dwattr $C$DW$173, DW_AT_decl_line(0x5a)
    2732                            .dwattr $C$DW$173, DW_AT_decl_column(0x0c)
    2733                    
    2734                    $C$DW$174       .dwtag  DW_TAG_member
    2735                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    2736                            .dwattr $C$DW$174, DW_AT_name("rsvd5")
    2737                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("rsvd5")
    2738                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2739                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2740                            .dwattr $C$DW$174, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2741                            .dwattr $C$DW$174, DW_AT_decl_line(0x5b)
    2742                            .dwattr $C$DW$174, DW_AT_decl_column(0x0c)
    2743                    
    2744                    $C$DW$175       .dwtag  DW_TAG_member
    2745                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    2746                            .dwattr $C$DW$175, DW_AT_name("FMAC")
    2747                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("FMAC")
    2748                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2749                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2750                            .dwattr $C$DW$175, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   51

    2751                            .dwattr $C$DW$175, DW_AT_decl_line(0x5c)
    2752                            .dwattr $C$DW$175, DW_AT_decl_column(0x0c)
    2753                    
    2754                    $C$DW$176       .dwtag  DW_TAG_member
    2755                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    2756                            .dwattr $C$DW$176, DW_AT_name("FMSTAT")
    2757                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("FMSTAT")
    2758                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2759                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2760                            .dwattr $C$DW$176, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2761                            .dwattr $C$DW$176, DW_AT_decl_line(0x5d)
    2762                            .dwattr $C$DW$176, DW_AT_decl_column(0x0c)
    2763                    
    2764                    $C$DW$177       .dwtag  DW_TAG_member
    2765                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    2766                            .dwattr $C$DW$177, DW_AT_name("FEMU_DMSW")
    2767                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("FEMU_DMSW")
    2768                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2769                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2770                            .dwattr $C$DW$177, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2771                            .dwattr $C$DW$177, DW_AT_decl_line(0x5e)
    2772                            .dwattr $C$DW$177, DW_AT_decl_column(0x0c)
    2773                    
    2774                    $C$DW$178       .dwtag  DW_TAG_member
    2775                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    2776                            .dwattr $C$DW$178, DW_AT_name("FEMU_DLSW")
    2777                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("FEMU_DLSW")
    2778                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2779                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2780                            .dwattr $C$DW$178, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2781                            .dwattr $C$DW$178, DW_AT_decl_line(0x5f)
    2782                            .dwattr $C$DW$178, DW_AT_decl_column(0x0c)
    2783                    
    2784                    $C$DW$179       .dwtag  DW_TAG_member
    2785                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    2786                            .dwattr $C$DW$179, DW_AT_name("FEMU_ECC")
    2787                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("FEMU_ECC")
    2788                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2789                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2790                            .dwattr $C$DW$179, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2791                            .dwattr $C$DW$179, DW_AT_decl_line(0x60)
    2792                            .dwattr $C$DW$179, DW_AT_decl_column(0x0c)
    2793                    
    2794                    $C$DW$180       .dwtag  DW_TAG_member
    2795                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2796                            .dwattr $C$DW$180, DW_AT_name("FLOCK")
    2797                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("FLOCK")
    2798                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2799                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2800                            .dwattr $C$DW$180, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2801                            .dwattr $C$DW$180, DW_AT_decl_line(0x61)
    2802                            .dwattr $C$DW$180, DW_AT_decl_column(0x0c)
    2803                    
    2804                    $C$DW$181       .dwtag  DW_TAG_member
    2805                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   52

    2806                            .dwattr $C$DW$181, DW_AT_name("rsvd6")
    2807                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("rsvd6")
    2808                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2809                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2810                            .dwattr $C$DW$181, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2811                            .dwattr $C$DW$181, DW_AT_decl_line(0x62)
    2812                            .dwattr $C$DW$181, DW_AT_decl_column(0x0c)
    2813                    
    2814                    $C$DW$182       .dwtag  DW_TAG_member
    2815                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    2816                            .dwattr $C$DW$182, DW_AT_name("FDIAGCTRL")
    2817                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("FDIAGCTRL")
    2818                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2819                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2820                            .dwattr $C$DW$182, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2821                            .dwattr $C$DW$182, DW_AT_decl_line(0x63)
    2822                            .dwattr $C$DW$182, DW_AT_decl_column(0x0c)
    2823                    
    2824                    $C$DW$183       .dwtag  DW_TAG_member
    2825                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    2826                            .dwattr $C$DW$183, DW_AT_name("rsvd7")
    2827                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("rsvd7")
    2828                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2829                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2830                            .dwattr $C$DW$183, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2831                            .dwattr $C$DW$183, DW_AT_decl_line(0x64)
    2832                            .dwattr $C$DW$183, DW_AT_decl_column(0x0c)
    2833                    
    2834                    $C$DW$184       .dwtag  DW_TAG_member
    2835                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    2836                            .dwattr $C$DW$184, DW_AT_name("FRAW_ADDR")
    2837                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("FRAW_ADDR")
    2838                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2839                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2840                            .dwattr $C$DW$184, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2841                            .dwattr $C$DW$184, DW_AT_decl_line(0x65)
    2842                            .dwattr $C$DW$184, DW_AT_decl_column(0x0c)
    2843                    
    2844                    $C$DW$185       .dwtag  DW_TAG_member
    2845                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    2846                            .dwattr $C$DW$185, DW_AT_name("rsvd8")
    2847                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("rsvd8")
    2848                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2849                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2850                            .dwattr $C$DW$185, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2851                            .dwattr $C$DW$185, DW_AT_decl_line(0x66)
    2852                            .dwattr $C$DW$185, DW_AT_decl_column(0x0c)
    2853                    
    2854                    $C$DW$186       .dwtag  DW_TAG_member
    2855                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    2856                            .dwattr $C$DW$186, DW_AT_name("FPAR_OVR")
    2857                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("FPAR_OVR")
    2858                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2859                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2860                            .dwattr $C$DW$186, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   53

    2861                            .dwattr $C$DW$186, DW_AT_decl_line(0x67)
    2862                            .dwattr $C$DW$186, DW_AT_decl_column(0x0c)
    2863                    
    2864                    $C$DW$187       .dwtag  DW_TAG_member
    2865                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    2866                            .dwattr $C$DW$187, DW_AT_name("rsvd9")
    2867                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("rsvd9")
    2868                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2869                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2870                            .dwattr $C$DW$187, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2871                            .dwattr $C$DW$187, DW_AT_decl_line(0x68)
    2872                            .dwattr $C$DW$187, DW_AT_decl_column(0x0c)
    2873                    
    2874                    $C$DW$188       .dwtag  DW_TAG_member
    2875                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    2876                            .dwattr $C$DW$188, DW_AT_name("RCR_VALID")
    2877                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("RCR_VALID")
    2878                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2879                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2880                            .dwattr $C$DW$188, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2881                            .dwattr $C$DW$188, DW_AT_decl_line(0x69)
    2882                            .dwattr $C$DW$188, DW_AT_decl_column(0x0c)
    2883                    
    2884                    $C$DW$189       .dwtag  DW_TAG_member
    2885                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    2886                            .dwattr $C$DW$189, DW_AT_name("ACC_THRESHOLD")
    2887                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("ACC_THRESHOLD")
    2888                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2889                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2890                            .dwattr $C$DW$189, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2891                            .dwattr $C$DW$189, DW_AT_decl_line(0x6a)
    2892                            .dwattr $C$DW$189, DW_AT_decl_column(0x0c)
    2893                    
    2894                    $C$DW$190       .dwtag  DW_TAG_member
    2895                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2896                            .dwattr $C$DW$190, DW_AT_name("rsvd10")
    2897                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("rsvd10")
    2898                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2899                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2900                            .dwattr $C$DW$190, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2901                            .dwattr $C$DW$190, DW_AT_decl_line(0x6b)
    2902                            .dwattr $C$DW$190, DW_AT_decl_column(0x0c)
    2903                    
    2904                    $C$DW$191       .dwtag  DW_TAG_member
    2905                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    2906                            .dwattr $C$DW$191, DW_AT_name("FEDACSDIS2")
    2907                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("FEDACSDIS2")
    2908                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2909                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2910                            .dwattr $C$DW$191, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2911                            .dwattr $C$DW$191, DW_AT_decl_line(0x6c)
    2912                            .dwattr $C$DW$191, DW_AT_decl_column(0x0c)
    2913                    
    2914                    $C$DW$192       .dwtag  DW_TAG_member
    2915                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   54

    2916                            .dwattr $C$DW$192, DW_AT_name("rsvd11")
    2917                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("rsvd11")
    2918                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2919                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2920                            .dwattr $C$DW$192, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2921                            .dwattr $C$DW$192, DW_AT_decl_line(0x6d)
    2922                            .dwattr $C$DW$192, DW_AT_decl_column(0x0c)
    2923                    
    2924                    $C$DW$193       .dwtag  DW_TAG_member
    2925                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    2926                            .dwattr $C$DW$193, DW_AT_name("rsvd12")
    2927                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("rsvd12")
    2928                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2929                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2930                            .dwattr $C$DW$193, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2931                            .dwattr $C$DW$193, DW_AT_decl_line(0x6e)
    2932                            .dwattr $C$DW$193, DW_AT_decl_column(0x0c)
    2933                    
    2934                    $C$DW$194       .dwtag  DW_TAG_member
    2935                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    2936                            .dwattr $C$DW$194, DW_AT_name("rsvd13")
    2937                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("rsvd13")
    2938                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2939                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2940                            .dwattr $C$DW$194, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2941                            .dwattr $C$DW$194, DW_AT_decl_line(0x6f)
    2942                            .dwattr $C$DW$194, DW_AT_decl_column(0x0c)
    2943                    
    2944                    $C$DW$195       .dwtag  DW_TAG_member
    2945                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    2946                            .dwattr $C$DW$195, DW_AT_name("RCR_VALUE0")
    2947                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("RCR_VALUE0")
    2948                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2949                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2950                            .dwattr $C$DW$195, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2951                            .dwattr $C$DW$195, DW_AT_decl_line(0x70)
    2952                            .dwattr $C$DW$195, DW_AT_decl_column(0x0c)
    2953                    
    2954                    $C$DW$196       .dwtag  DW_TAG_member
    2955                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    2956                            .dwattr $C$DW$196, DW_AT_name("RCR_VALUE1")
    2957                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("RCR_VALUE1")
    2958                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2959                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2960                            .dwattr $C$DW$196, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2961                            .dwattr $C$DW$196, DW_AT_decl_line(0x71)
    2962                            .dwattr $C$DW$196, DW_AT_decl_column(0x0c)
    2963                    
    2964                    $C$DW$197       .dwtag  DW_TAG_member
    2965                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$32)
    2966                            .dwattr $C$DW$197, DW_AT_name("rsvd14")
    2967                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("rsvd14")
    2968                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2969                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2970                            .dwattr $C$DW$197, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0530010                              PAGE   55

    2971                            .dwattr $C$DW$197, DW_AT_decl_line(0x72)
    2972                            .dwattr $C$DW$197, DW_AT_decl_column(0x0c)
    2973                    
    2974                    $C$DW$198       .dwtag  DW_TAG_member
    2975                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    2976                            .dwattr $C$DW$198, DW_AT_name("FSM_WR_ENA")
    2977                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("FSM_WR_ENA")
    2978                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x28c]
    2979                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2980                            .dwattr $C$DW$198, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2981                            .dwattr $C$DW$198, DW_AT_decl_line(0x73)
    2982                            .dwattr $C$DW$198, DW_AT_decl_column(0x0c)
    2983                    
    2984                    $C$DW$199       .dwtag  DW_TAG_member
    2985                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$33)
    2986                            .dwattr $C$DW$199, DW_AT_name("rsvd15")
    2987                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("rsvd15")
    2988                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x290]
    2989                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2990                            .dwattr $C$DW$199, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2991                            .dwattr $C$DW$199, DW_AT_decl_line(0x74)
    2992                            .dwattr $C$DW$199, DW_AT_decl_column(0x0c)
    2993                    
    2994                    $C$DW$200       .dwtag  DW_TAG_member
    2995                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    2996                            .dwattr $C$DW$200, DW_AT_name("EEPROM_CONFIG")
    2997                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("EEPROM_CONFIG")
    2998                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c0]
    2999                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3000                            .dwattr $C$DW$200, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3001                            .dwattr $C$DW$200, DW_AT_decl_line(0x75)
    3002                            .dwattr $C$DW$200, DW_AT_decl_column(0x0c)
    3003                    
    3004                    $C$DW$201       .dwtag  DW_TAG_member
    3005                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    3006                            .dwattr $C$DW$201, DW_AT_name("rsvd16")
    3007                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("rsvd16")
    3008                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c4]
    3009                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3010                            .dwattr $C$DW$201, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3011                            .dwattr $C$DW$201, DW_AT_decl_line(0x76)
    3012                            .dwattr $C$DW$201, DW_AT_decl_column(0x0c)
    3013                    
    3014                    $C$DW$202       .dwtag  DW_TAG_member
    3015                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    3016                            .dwattr $C$DW$202, DW_AT_name("FSM_SECTOR1")
    3017                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("FSM_SECTOR1")
    3018                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c8]
    3019                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3020                            .dwattr $C$DW$202, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3021                            .dwattr $C$DW$202, DW_AT_decl_line(0x77)
