TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 13:27:08 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_errata.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1274                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1275                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1276                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1277                    
    1278                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    1279                            .dwattr $C$DW$T$75, DW_AT_name("float64")
    1280                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$17)
    1281                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1282                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1283                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x72)
    1284                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x10)
    1285                    
    1286                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1287                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1288                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1289                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1290                    
    1291                    $C$DW$T$76      .dwtag  DW_TAG_base_type
    1292                            .dwattr $C$DW$T$76, DW_AT_encoding(DW_ATE_unsigned_char)
    1293                            .dwattr $C$DW$T$76, DW_AT_name("unsigned char")
    1294                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x01)
    1295                    
    1296                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    1297                            .dwattr $C$DW$T$77, DW_AT_name("boolean")
    1298                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    1299                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1300                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1301                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x53)
    1302                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x0f)
    1303                    
    1304                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1305                            .dwattr $C$DW$T$78, DW_AT_name("tBoolean")
    1306                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    1307                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1308                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1309                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x40)
    1310                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x11)
    1311                    
    1312                    
    1313                    $C$DW$T$79      .dwtag  DW_TAG_enumeration_type
    1314                            .dwattr $C$DW$T$79, DW_AT_name("config_value_type")
    1315                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x01)
    1316                    $C$DW$39        .dwtag  DW_TAG_enumerator
    1317                            .dwattr $C$DW$39, DW_AT_name("InitialValue")
    1318                            .dwattr $C$DW$39, DW_AT_const_value(0x00)
    1319                            .dwattr $C$DW$39, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1320                            .dwattr $C$DW$39, DW_AT_decl_line(0x5c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   25

    1321                            .dwattr $C$DW$39, DW_AT_decl_column(0x02)
    1322                    
    1323                    $C$DW$40        .dwtag  DW_TAG_enumerator
    1324                            .dwattr $C$DW$40, DW_AT_name("CurrentValue")
    1325                            .dwattr $C$DW$40, DW_AT_const_value(0x01)
    1326                            .dwattr $C$DW$40, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1327                            .dwattr $C$DW$40, DW_AT_decl_line(0x5d)
    1328                            .dwattr $C$DW$40, DW_AT_decl_column(0x02)
    1329                    
    1330                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1331                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x5a)
    1332                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x0e)
    1333                            .dwendtag $C$DW$T$79
    1334                    
    1335                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    1336                            .dwattr $C$DW$T$80, DW_AT_name("config_value_type_t")
    1337                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    1338                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1339                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1340                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x5e)
    1341                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x02)
    1342                    
    1343                    
    1344                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1345                            .dwattr $C$DW$T$21, DW_AT_name("gioBase")
    1346                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x34)
    1347                    $C$DW$41        .dwtag  DW_TAG_member
    1348                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$20)
    1349                            .dwattr $C$DW$41, DW_AT_name("GCR0")
    1350                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("GCR0")
    1351                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1353                            .dwattr $C$DW$41, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1354                            .dwattr $C$DW$41, DW_AT_decl_line(0x48)
    1355                            .dwattr $C$DW$41, DW_AT_decl_column(0x0c)
    1356                    
    1357                    $C$DW$42        .dwtag  DW_TAG_member
    1358                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$20)
    1359                            .dwattr $C$DW$42, DW_AT_name("rsvd")
    1360                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("rsvd")
    1361                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1362                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1363                            .dwattr $C$DW$42, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1364                            .dwattr $C$DW$42, DW_AT_decl_line(0x49)
    1365                            .dwattr $C$DW$42, DW_AT_decl_column(0x0e)
    1366                    
    1367                    $C$DW$43        .dwtag  DW_TAG_member
    1368                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$20)
    1369                            .dwattr $C$DW$43, DW_AT_name("INTDET")
    1370                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("INTDET")
    1371                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1372                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1373                            .dwattr $C$DW$43, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1374                            .dwattr $C$DW$43, DW_AT_decl_line(0x4a)
    1375                            .dwattr $C$DW$43, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   26

    1376                    
    1377                    $C$DW$44        .dwtag  DW_TAG_member
    1378                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$20)
    1379                            .dwattr $C$DW$44, DW_AT_name("POL")
    1380                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("POL")
    1381                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1382                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1383                            .dwattr $C$DW$44, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1384                            .dwattr $C$DW$44, DW_AT_decl_line(0x4b)
    1385                            .dwattr $C$DW$44, DW_AT_decl_column(0x0c)
    1386                    
    1387                    $C$DW$45        .dwtag  DW_TAG_member
    1388                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$20)
    1389                            .dwattr $C$DW$45, DW_AT_name("ENASET")
    1390                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("ENASET")
    1391                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1392                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1393                            .dwattr $C$DW$45, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1394                            .dwattr $C$DW$45, DW_AT_decl_line(0x4c)
    1395                            .dwattr $C$DW$45, DW_AT_decl_column(0x0c)
    1396                    
    1397                    $C$DW$46        .dwtag  DW_TAG_member
    1398                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
    1399                            .dwattr $C$DW$46, DW_AT_name("ENACLR")
    1400                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("ENACLR")
    1401                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1402                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1403                            .dwattr $C$DW$46, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1404                            .dwattr $C$DW$46, DW_AT_decl_line(0x4d)
    1405                            .dwattr $C$DW$46, DW_AT_decl_column(0x0c)
    1406                    
    1407                    $C$DW$47        .dwtag  DW_TAG_member
    1408                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
    1409                            .dwattr $C$DW$47, DW_AT_name("LVLSET")
    1410                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("LVLSET")
    1411                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1412                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1413                            .dwattr $C$DW$47, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1414                            .dwattr $C$DW$47, DW_AT_decl_line(0x4e)
    1415                            .dwattr $C$DW$47, DW_AT_decl_column(0x0c)
    1416                    
    1417                    $C$DW$48        .dwtag  DW_TAG_member
    1418                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
    1419                            .dwattr $C$DW$48, DW_AT_name("LVLCLR")
    1420                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("LVLCLR")
    1421                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1422                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1423                            .dwattr $C$DW$48, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1424                            .dwattr $C$DW$48, DW_AT_decl_line(0x4f)
    1425                            .dwattr $C$DW$48, DW_AT_decl_column(0x0c)
    1426                    
    1427                    $C$DW$49        .dwtag  DW_TAG_member
    1428                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$20)
    1429                            .dwattr $C$DW$49, DW_AT_name("FLG")
    1430                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("FLG")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   27

    1431                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1432                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1433                            .dwattr $C$DW$49, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1434                            .dwattr $C$DW$49, DW_AT_decl_line(0x50)
    1435                            .dwattr $C$DW$49, DW_AT_decl_column(0x0c)
    1436                    
    1437                    $C$DW$50        .dwtag  DW_TAG_member
    1438                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$20)
    1439                            .dwattr $C$DW$50, DW_AT_name("OFF1")
    1440                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("OFF1")
    1441                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1442                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1443                            .dwattr $C$DW$50, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1444                            .dwattr $C$DW$50, DW_AT_decl_line(0x51)
    1445                            .dwattr $C$DW$50, DW_AT_decl_column(0x0c)
    1446                    
    1447                    $C$DW$51        .dwtag  DW_TAG_member
    1448                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$20)
    1449                            .dwattr $C$DW$51, DW_AT_name("OFF2")
    1450                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("OFF2")
    1451                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1452                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1453                            .dwattr $C$DW$51, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1454                            .dwattr $C$DW$51, DW_AT_decl_line(0x52)
    1455                            .dwattr $C$DW$51, DW_AT_decl_column(0x0c)
    1456                    
    1457                    $C$DW$52        .dwtag  DW_TAG_member
    1458                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$20)
    1459                            .dwattr $C$DW$52, DW_AT_name("EMU1")
    1460                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("EMU1")
    1461                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1462                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1463                            .dwattr $C$DW$52, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1464                            .dwattr $C$DW$52, DW_AT_decl_line(0x53)
    1465                            .dwattr $C$DW$52, DW_AT_decl_column(0x0c)
    1466                    
    1467                    $C$DW$53        .dwtag  DW_TAG_member
    1468                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
    1469                            .dwattr $C$DW$53, DW_AT_name("EMU2")
    1470                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("EMU2")
    1471                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1472                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1473                            .dwattr $C$DW$53, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1474                            .dwattr $C$DW$53, DW_AT_decl_line(0x54)
    1475                            .dwattr $C$DW$53, DW_AT_decl_column(0x09)
    1476                    
    1477                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1478                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x46)
    1479                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x19)
    1480                            .dwendtag $C$DW$T$21
    1481                    
    1482                    $C$DW$T$81      .dwtag  DW_TAG_volatile_type
    1483                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$21)
    1484                    
    1485                    $C$DW$T$82      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   28

    1486                            .dwattr $C$DW$T$82, DW_AT_name("gioBASE_t")
    1487                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    1488                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1489                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1490                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x55)
    1491                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    1492                    
    1493                    
    1494                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1495                            .dwattr $C$DW$T$22, DW_AT_name("gioPort")
    1496                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x20)
    1497                    $C$DW$54        .dwtag  DW_TAG_member
    1498                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
    1499                            .dwattr $C$DW$54, DW_AT_name("DIR")
    1500                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("DIR")
    1501                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1503                            .dwattr $C$DW$54, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1504                            .dwattr $C$DW$54, DW_AT_decl_line(0x62)
    1505                            .dwattr $C$DW$54, DW_AT_decl_column(0x0c)
    1506                    
    1507                    $C$DW$55        .dwtag  DW_TAG_member
    1508                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$20)
    1509                            .dwattr $C$DW$55, DW_AT_name("DIN")
    1510                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("DIN")
    1511                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1512                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$55, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1514                            .dwattr $C$DW$55, DW_AT_decl_line(0x63)
    1515                            .dwattr $C$DW$55, DW_AT_decl_column(0x0c)
    1516                    
    1517                    $C$DW$56        .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$20)
    1519                            .dwattr $C$DW$56, DW_AT_name("DOUT")
    1520                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("DOUT")
    1521                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1522                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1523                            .dwattr $C$DW$56, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1524                            .dwattr $C$DW$56, DW_AT_decl_line(0x64)
    1525                            .dwattr $C$DW$56, DW_AT_decl_column(0x0c)
    1526                    
    1527                    $C$DW$57        .dwtag  DW_TAG_member
    1528                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
    1529                            .dwattr $C$DW$57, DW_AT_name("DSET")
    1530                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("DSET")
    1531                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1532                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1533                            .dwattr $C$DW$57, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1534                            .dwattr $C$DW$57, DW_AT_decl_line(0x65)
    1535                            .dwattr $C$DW$57, DW_AT_decl_column(0x0c)
    1536                    
    1537                    $C$DW$58        .dwtag  DW_TAG_member
    1538                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
    1539                            .dwattr $C$DW$58, DW_AT_name("DCLR")
    1540                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("DCLR")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   29

    1541                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1542                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1543                            .dwattr $C$DW$58, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1544                            .dwattr $C$DW$58, DW_AT_decl_line(0x66)
    1545                            .dwattr $C$DW$58, DW_AT_decl_column(0x0c)
    1546                    
    1547                    $C$DW$59        .dwtag  DW_TAG_member
    1548                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
    1549                            .dwattr $C$DW$59, DW_AT_name("PDR")
    1550                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("PDR")
    1551                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1552                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1553                            .dwattr $C$DW$59, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1554                            .dwattr $C$DW$59, DW_AT_decl_line(0x67)
    1555                            .dwattr $C$DW$59, DW_AT_decl_column(0x0c)
    1556                    
    1557                    $C$DW$60        .dwtag  DW_TAG_member
    1558                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
    1559                            .dwattr $C$DW$60, DW_AT_name("PULDIS")
    1560                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("PULDIS")
    1561                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1562                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1563                            .dwattr $C$DW$60, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1564                            .dwattr $C$DW$60, DW_AT_decl_line(0x68)
    1565                            .dwattr $C$DW$60, DW_AT_decl_column(0x0c)
    1566                    
    1567                    $C$DW$61        .dwtag  DW_TAG_member
    1568                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$20)
    1569                            .dwattr $C$DW$61, DW_AT_name("PSL")
    1570                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("PSL")
    1571                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1572                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1573                            .dwattr $C$DW$61, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1574                            .dwattr $C$DW$61, DW_AT_decl_line(0x69)
    1575                            .dwattr $C$DW$61, DW_AT_decl_column(0x0c)
    1576                    
    1577                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1578                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x60)
    1579                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x19)
    1580                            .dwendtag $C$DW$T$22
    1581                    
    1582                    $C$DW$T$83      .dwtag  DW_TAG_volatile_type
    1583                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$22)
    1584                    
    1585                    $C$DW$T$84      .dwtag  DW_TAG_typedef
    1586                            .dwattr $C$DW$T$84, DW_AT_name("gioPORT_t")
    1587                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    1588                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1589                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1590                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x6a)
    1591                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1592                    
    1593                    
    1594                    $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
    1595                            .dwattr $C$DW$T$85, DW_AT_name("loopBackType")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   30

    1596                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
    1597                    $C$DW$62        .dwtag  DW_TAG_enumerator
    1598                            .dwattr $C$DW$62, DW_AT_name("Digital_Lbk")
    1599                            .dwattr $C$DW$62, DW_AT_const_value(0x00)
    1600                            .dwattr $C$DW$62, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1601                            .dwattr $C$DW$62, DW_AT_decl_line(0x4e)
    1602                            .dwattr $C$DW$62, DW_AT_decl_column(0x05)
    1603                    
    1604                    $C$DW$63        .dwtag  DW_TAG_enumerator
    1605                            .dwattr $C$DW$63, DW_AT_name("Analog_Lbk")
    1606                            .dwattr $C$DW$63, DW_AT_const_value(0x01)
    1607                            .dwattr $C$DW$63, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1608                            .dwattr $C$DW$63, DW_AT_decl_line(0x4f)
    1609                            .dwattr $C$DW$63, DW_AT_decl_column(0x05)
    1610                    
    1611                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1612                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x4c)
    1613                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x0e)
    1614                            .dwendtag $C$DW$T$85
    1615                    
    1616                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    1617                            .dwattr $C$DW$T$86, DW_AT_name("loopBackType_t")
    1618                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    1619                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1620                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1621                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x50)
    1622                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x02)
    1623                    
    1624                    
    1625                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1626                            .dwattr $C$DW$T$25, DW_AT_name("pbistBase")
    1627                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x70)
    1628                    $C$DW$64        .dwtag  DW_TAG_member
    1629                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
    1630                            .dwattr $C$DW$64, DW_AT_name("RAMT")
    1631                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RAMT")
    1632                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1634                            .dwattr $C$DW$64, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1635                            .dwattr $C$DW$64, DW_AT_decl_line(0x45)
    1636                            .dwattr $C$DW$64, DW_AT_decl_column(0x0c)
    1637                    
    1638                    $C$DW$65        .dwtag  DW_TAG_member
    1639                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
    1640                            .dwattr $C$DW$65, DW_AT_name("DLR")
    1641                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("DLR")
    1642                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1643                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1644                            .dwattr $C$DW$65, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1645                            .dwattr $C$DW$65, DW_AT_decl_line(0x46)
    1646                            .dwattr $C$DW$65, DW_AT_decl_column(0x0c)
    1647                    
    1648                    $C$DW$66        .dwtag  DW_TAG_member
    1649                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$23)
    1650                            .dwattr $C$DW$66, DW_AT_name("rsvd1")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   31

    1651                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("rsvd1")
    1652                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1653                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1654                            .dwattr $C$DW$66, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1655                            .dwattr $C$DW$66, DW_AT_decl_line(0x47)
    1656                            .dwattr $C$DW$66, DW_AT_decl_column(0x0c)
    1657                    
    1658                    $C$DW$67        .dwtag  DW_TAG_member
    1659                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    1660                            .dwattr $C$DW$67, DW_AT_name("PACT")
    1661                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("PACT")
    1662                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1663                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1664                            .dwattr $C$DW$67, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1665                            .dwattr $C$DW$67, DW_AT_decl_line(0x48)
    1666                            .dwattr $C$DW$67, DW_AT_decl_column(0x0c)
    1667                    
    1668                    $C$DW$68        .dwtag  DW_TAG_member
    1669                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
    1670                            .dwattr $C$DW$68, DW_AT_name("PBISTID")
    1671                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("PBISTID")
    1672                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1673                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1674                            .dwattr $C$DW$68, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1675                            .dwattr $C$DW$68, DW_AT_decl_line(0x49)
    1676                            .dwattr $C$DW$68, DW_AT_decl_column(0x0c)
    1677                    
    1678                    $C$DW$69        .dwtag  DW_TAG_member
    1679                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
    1680                            .dwattr $C$DW$69, DW_AT_name("OVER")
    1681                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("OVER")
    1682                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1683                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1684                            .dwattr $C$DW$69, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1685                            .dwattr $C$DW$69, DW_AT_decl_line(0x4a)
    1686                            .dwattr $C$DW$69, DW_AT_decl_column(0x0c)
    1687                    
    1688                    $C$DW$70        .dwtag  DW_TAG_member
    1689                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$20)
    1690                            .dwattr $C$DW$70, DW_AT_name("rsvd2")
    1691                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("rsvd2")
    1692                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1693                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1694                            .dwattr $C$DW$70, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1695                            .dwattr $C$DW$70, DW_AT_decl_line(0x4b)
    1696                            .dwattr $C$DW$70, DW_AT_decl_column(0x0c)
    1697                    
    1698                    $C$DW$71        .dwtag  DW_TAG_member
    1699                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1700                            .dwattr $C$DW$71, DW_AT_name("FSRF0")
    1701                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("FSRF0")
    1702                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1703                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1704                            .dwattr $C$DW$71, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1705                            .dwattr $C$DW$71, DW_AT_decl_line(0x4c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   32

    1706                            .dwattr $C$DW$71, DW_AT_decl_column(0x0c)
    1707                    
    1708                    $C$DW$72        .dwtag  DW_TAG_member
    1709                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
    1710                            .dwattr $C$DW$72, DW_AT_name("FSRF1")
    1711                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("FSRF1")
    1712                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1713                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1714                            .dwattr $C$DW$72, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1715                            .dwattr $C$DW$72, DW_AT_decl_line(0x4d)
    1716                            .dwattr $C$DW$72, DW_AT_decl_column(0x0c)
    1717                    
    1718                    $C$DW$73        .dwtag  DW_TAG_member
    1719                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
    1720                            .dwattr $C$DW$73, DW_AT_name("FSRC0")
    1721                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("FSRC0")
    1722                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1723                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1724                            .dwattr $C$DW$73, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1725                            .dwattr $C$DW$73, DW_AT_decl_line(0x4e)
    1726                            .dwattr $C$DW$73, DW_AT_decl_column(0x0c)
    1727                    
    1728                    $C$DW$74        .dwtag  DW_TAG_member
    1729                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
    1730                            .dwattr $C$DW$74, DW_AT_name("FSRC1")
    1731                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("FSRC1")
    1732                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1733                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1734                            .dwattr $C$DW$74, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1735                            .dwattr $C$DW$74, DW_AT_decl_line(0x4f)
    1736                            .dwattr $C$DW$74, DW_AT_decl_column(0x0c)
    1737                    
    1738                    $C$DW$75        .dwtag  DW_TAG_member
    1739                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
    1740                            .dwattr $C$DW$75, DW_AT_name("FSRA0")
    1741                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("FSRA0")
    1742                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1743                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1744                            .dwattr $C$DW$75, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1745                            .dwattr $C$DW$75, DW_AT_decl_line(0x50)
    1746                            .dwattr $C$DW$75, DW_AT_decl_column(0x0c)
    1747                    
    1748                    $C$DW$76        .dwtag  DW_TAG_member
    1749                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1750                            .dwattr $C$DW$76, DW_AT_name("FSRA1")
    1751                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("FSRA1")
    1752                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1753                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1754                            .dwattr $C$DW$76, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1755                            .dwattr $C$DW$76, DW_AT_decl_line(0x51)
    1756                            .dwattr $C$DW$76, DW_AT_decl_column(0x0c)
    1757                    
    1758                    $C$DW$77        .dwtag  DW_TAG_member
    1759                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
    1760                            .dwattr $C$DW$77, DW_AT_name("FSRDL0")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   33

    1761                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("FSRDL0")
    1762                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1763                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1764                            .dwattr $C$DW$77, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1765                            .dwattr $C$DW$77, DW_AT_decl_line(0x52)
    1766                            .dwattr $C$DW$77, DW_AT_decl_column(0x0c)
    1767                    
    1768                    $C$DW$78        .dwtag  DW_TAG_member
    1769                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1770                            .dwattr $C$DW$78, DW_AT_name("rsvd3")
    1771                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("rsvd3")
    1772                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1773                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1774                            .dwattr $C$DW$78, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1775                            .dwattr $C$DW$78, DW_AT_decl_line(0x53)
    1776                            .dwattr $C$DW$78, DW_AT_decl_column(0x0c)
    1777                    
    1778                    $C$DW$79        .dwtag  DW_TAG_member
    1779                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    1780                            .dwattr $C$DW$79, DW_AT_name("FSRDL1")
    1781                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("FSRDL1")
    1782                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1783                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1784                            .dwattr $C$DW$79, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1785                            .dwattr $C$DW$79, DW_AT_decl_line(0x54)
    1786                            .dwattr $C$DW$79, DW_AT_decl_column(0x0c)
    1787                    
    1788                    $C$DW$80        .dwtag  DW_TAG_member
    1789                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$24)
    1790                            .dwattr $C$DW$80, DW_AT_name("rsvd4")
    1791                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("rsvd4")
    1792                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1793                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1794                            .dwattr $C$DW$80, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1795                            .dwattr $C$DW$80, DW_AT_decl_line(0x55)
    1796                            .dwattr $C$DW$80, DW_AT_decl_column(0x0c)
    1797                    
    1798                    $C$DW$81        .dwtag  DW_TAG_member
    1799                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    1800                            .dwattr $C$DW$81, DW_AT_name("ROM")
    1801                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("ROM")
    1802                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1803                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1804                            .dwattr $C$DW$81, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1805                            .dwattr $C$DW$81, DW_AT_decl_line(0x56)
    1806                            .dwattr $C$DW$81, DW_AT_decl_column(0x0c)
    1807                    
    1808                    $C$DW$82        .dwtag  DW_TAG_member
    1809                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    1810                            .dwattr $C$DW$82, DW_AT_name("ALGO")
    1811                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("ALGO")
    1812                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1813                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1814                            .dwattr $C$DW$82, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1815                            .dwattr $C$DW$82, DW_AT_decl_line(0x57)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   34

    1816                            .dwattr $C$DW$82, DW_AT_decl_column(0x0c)
    1817                    
    1818                    $C$DW$83        .dwtag  DW_TAG_member
    1819                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1820                            .dwattr $C$DW$83, DW_AT_name("RINFOL")
    1821                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RINFOL")
    1822                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1823                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1824                            .dwattr $C$DW$83, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1825                            .dwattr $C$DW$83, DW_AT_decl_line(0x58)
    1826                            .dwattr $C$DW$83, DW_AT_decl_column(0x0c)
    1827                    
    1828                    $C$DW$84        .dwtag  DW_TAG_member
    1829                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    1830                            .dwattr $C$DW$84, DW_AT_name("RINFOU")
    1831                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RINFOU")
    1832                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1833                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1834                            .dwattr $C$DW$84, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1835                            .dwattr $C$DW$84, DW_AT_decl_line(0x59)
    1836                            .dwattr $C$DW$84, DW_AT_decl_column(0x0c)
    1837                    
    1838                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1839                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x43)
    1840                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x19)
    1841                            .dwendtag $C$DW$T$25
    1842                    
    1843                    $C$DW$T$87      .dwtag  DW_TAG_volatile_type
    1844                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$25)
    1845                    
    1846                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    1847                            .dwattr $C$DW$T$88, DW_AT_name("pbistBASE_t")
    1848                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1849                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1850                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1851                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x5a)
    1852                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1853                    
    1854                    
    1855                    $C$DW$T$90      .dwtag  DW_TAG_enumeration_type
    1856                            .dwattr $C$DW$T$90, DW_AT_name("pmuEvent")
    1857                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x01)
    1858                    $C$DW$85        .dwtag  DW_TAG_enumerator
    1859                            .dwattr $C$DW$85, DW_AT_name("PMU_INST_CACHE_MISS")
    1860                            .dwattr $C$DW$85, DW_AT_const_value(0x01)
    1861                            .dwattr $C$DW$85, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1862                            .dwattr $C$DW$85, DW_AT_decl_line(0x5e)
    1863                            .dwattr $C$DW$85, DW_AT_decl_column(0x05)
    1864                    
    1865                    $C$DW$86        .dwtag  DW_TAG_enumerator
    1866                            .dwattr $C$DW$86, DW_AT_name("PMU_DATA_CACHE_MISS")
    1867                            .dwattr $C$DW$86, DW_AT_const_value(0x03)
    1868                            .dwattr $C$DW$86, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1869                            .dwattr $C$DW$86, DW_AT_decl_line(0x5f)
    1870                            .dwattr $C$DW$86, DW_AT_decl_column(0x05)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   35

    1871                    
    1872                    $C$DW$87        .dwtag  DW_TAG_enumerator
    1873                            .dwattr $C$DW$87, DW_AT_name("PMU_DATA_CACHE_ACCESS")
    1874                            .dwattr $C$DW$87, DW_AT_const_value(0x04)
    1875                            .dwattr $C$DW$87, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1876                            .dwattr $C$DW$87, DW_AT_decl_line(0x60)
    1877                            .dwattr $C$DW$87, DW_AT_decl_column(0x05)
    1878                    
    1879                    $C$DW$88        .dwtag  DW_TAG_enumerator
    1880                            .dwattr $C$DW$88, DW_AT_name("PMU_DATA_READ_ARCH_EXECUTED")
    1881                            .dwattr $C$DW$88, DW_AT_const_value(0x06)
    1882                            .dwattr $C$DW$88, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1883                            .dwattr $C$DW$88, DW_AT_decl_line(0x61)
    1884                            .dwattr $C$DW$88, DW_AT_decl_column(0x05)
    1885                    
    1886                    $C$DW$89        .dwtag  DW_TAG_enumerator
    1887                            .dwattr $C$DW$89, DW_AT_name("PMU_DATA_WRITE_ARCH_EXECUTED")
    1888                            .dwattr $C$DW$89, DW_AT_const_value(0x07)
    1889                            .dwattr $C$DW$89, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1890                            .dwattr $C$DW$89, DW_AT_decl_line(0x62)
    1891                            .dwattr $C$DW$89, DW_AT_decl_column(0x05)
    1892                    
    1893                    $C$DW$90        .dwtag  DW_TAG_enumerator
    1894                            .dwattr $C$DW$90, DW_AT_name("PMU_INST_ARCH_EXECUTED")
    1895                            .dwattr $C$DW$90, DW_AT_const_value(0x08)
    1896                            .dwattr $C$DW$90, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1897                            .dwattr $C$DW$90, DW_AT_decl_line(0x63)
    1898                            .dwattr $C$DW$90, DW_AT_decl_column(0x05)
    1899                    
    1900                    $C$DW$91        .dwtag  DW_TAG_enumerator
    1901                            .dwattr $C$DW$91, DW_AT_name("PMU_EXCEPTION_TAKEN")
    1902                            .dwattr $C$DW$91, DW_AT_const_value(0x09)
    1903                            .dwattr $C$DW$91, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1904                            .dwattr $C$DW$91, DW_AT_decl_line(0x64)
    1905                            .dwattr $C$DW$91, DW_AT_decl_column(0x05)
    1906                    
    1907                    $C$DW$92        .dwtag  DW_TAG_enumerator
    1908                            .dwattr $C$DW$92, DW_AT_name("PMU_EXCEPTION_RETURN_ARCH_EXECUTED")
    1909                            .dwattr $C$DW$92, DW_AT_const_value(0x0a)
    1910                            .dwattr $C$DW$92, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1911                            .dwattr $C$DW$92, DW_AT_decl_line(0x65)
    1912                            .dwattr $C$DW$92, DW_AT_decl_column(0x05)
    1913                    
    1914                    $C$DW$93        .dwtag  DW_TAG_enumerator
    1915                            .dwattr $C$DW$93, DW_AT_name("PMU_CHANGE_TO_CONTEXT_ID_EXECUTED")
    1916                            .dwattr $C$DW$93, DW_AT_const_value(0x0b)
    1917                            .dwattr $C$DW$93, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1918                            .dwattr $C$DW$93, DW_AT_decl_line(0x66)
    1919                            .dwattr $C$DW$93, DW_AT_decl_column(0x05)
    1920                    
    1921                    $C$DW$94        .dwtag  DW_TAG_enumerator
    1922                            .dwattr $C$DW$94, DW_AT_name("PMU_SW_CHANGE_OF_PC_ARCH_EXECUTED")
    1923                            .dwattr $C$DW$94, DW_AT_const_value(0x0c)
    1924                            .dwattr $C$DW$94, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1925                            .dwattr $C$DW$94, DW_AT_decl_line(0x67)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   36

    1926                            .dwattr $C$DW$94, DW_AT_decl_column(0x05)
    1927                    
    1928                    $C$DW$95        .dwtag  DW_TAG_enumerator
    1929                            .dwattr $C$DW$95, DW_AT_name("PMU_BRANCH_IMM_INST_ARCH_EXECUTED")
    1930                            .dwattr $C$DW$95, DW_AT_const_value(0x0d)
    1931                            .dwattr $C$DW$95, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1932                            .dwattr $C$DW$95, DW_AT_decl_line(0x68)
    1933                            .dwattr $C$DW$95, DW_AT_decl_column(0x05)
    1934                    
    1935                    $C$DW$96        .dwtag  DW_TAG_enumerator
    1936                            .dwattr $C$DW$96, DW_AT_name("PMU_PROC_RETURN_ARCH_EXECUTED")
    1937                            .dwattr $C$DW$96, DW_AT_const_value(0x0e)
    1938                            .dwattr $C$DW$96, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1939                            .dwattr $C$DW$96, DW_AT_decl_line(0x69)
    1940                            .dwattr $C$DW$96, DW_AT_decl_column(0x05)
    1941                    
    1942                    $C$DW$97        .dwtag  DW_TAG_enumerator
    1943                            .dwattr $C$DW$97, DW_AT_name("PMU_UNALIGNED_ACCESS_ARCH_EXECUTED")
    1944                            .dwattr $C$DW$97, DW_AT_const_value(0x0f)
    1945                            .dwattr $C$DW$97, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1946                            .dwattr $C$DW$97, DW_AT_decl_line(0x6a)
    1947                            .dwattr $C$DW$97, DW_AT_decl_column(0x05)
    1948                    
    1949                    $C$DW$98        .dwtag  DW_TAG_enumerator
    1950                            .dwattr $C$DW$98, DW_AT_name("PMU_BRANCH_MISSPREDICTED")
    1951                            .dwattr $C$DW$98, DW_AT_const_value(0x10)
    1952                            .dwattr $C$DW$98, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1953                            .dwattr $C$DW$98, DW_AT_decl_line(0x6b)
    1954                            .dwattr $C$DW$98, DW_AT_decl_column(0x05)
    1955                    
    1956                    $C$DW$99        .dwtag  DW_TAG_enumerator
    1957                            .dwattr $C$DW$99, DW_AT_name("PMU_CYCLE_COUNT")
    1958                            .dwattr $C$DW$99, DW_AT_const_value(0x11)
    1959                            .dwattr $C$DW$99, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1960                            .dwattr $C$DW$99, DW_AT_decl_line(0x6c)
    1961                            .dwattr $C$DW$99, DW_AT_decl_column(0x05)
    1962                    
    1963                    $C$DW$100       .dwtag  DW_TAG_enumerator
    1964                            .dwattr $C$DW$100, DW_AT_name("PMU_PREDICTABLE_BRANCHES")
    1965                            .dwattr $C$DW$100, DW_AT_const_value(0x12)
    1966                            .dwattr $C$DW$100, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    1967                            .dwattr $C$DW$100, DW_AT_decl_line(0x6d)
    1968                            .dwattr $C$DW$100, DW_AT_decl_column(0x05)
    1969                    
    1970                    $C$DW$101       .dwtag  DW_TAG_enumerator
    1971                            .dwattr $C$DW$101, DW_AT_name("PMU_INST_BUFFER_STALL")
    1972                            .dwattr $C$DW$101, DW_AT_const_value(0x40)
    1973                            .dwattr $C$DW$101, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    1974                            .dwattr $C$DW$101, DW_AT_decl_line(0x6e)
    1975                            .dwattr $C$DW$101, DW_AT_decl_column(0x05)
    1976                    
    1977                    $C$DW$102       .dwtag  DW_TAG_enumerator
    1978                            .dwattr $C$DW$102, DW_AT_name("PMU_DATA_DEPENDENCY_INST_STALL")
    1979                            .dwattr $C$DW$102, DW_AT_const_value(0x41)
    1980                            .dwattr $C$DW$102, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   37

    1981                            .dwattr $C$DW$102, DW_AT_decl_line(0x6f)
    1982                            .dwattr $C$DW$102, DW_AT_decl_column(0x05)
    1983                    
    1984                    $C$DW$103       .dwtag  DW_TAG_enumerator
    1985                            .dwattr $C$DW$103, DW_AT_name("PMU_DATA_CACHE_WRITE_BACK")
    1986                            .dwattr $C$DW$103, DW_AT_const_value(0x42)
    1987                            .dwattr $C$DW$103, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    1988                            .dwattr $C$DW$103, DW_AT_decl_line(0x70)
    1989                            .dwattr $C$DW$103, DW_AT_decl_column(0x05)
    1990                    
    1991                    $C$DW$104       .dwtag  DW_TAG_enumerator
    1992                            .dwattr $C$DW$104, DW_AT_name("PMU_EXT_MEMORY_REQUEST")
    1993                            .dwattr $C$DW$104, DW_AT_const_value(0x43)
    1994                            .dwattr $C$DW$104, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    1995                            .dwattr $C$DW$104, DW_AT_decl_line(0x71)
    1996                            .dwattr $C$DW$104, DW_AT_decl_column(0x05)
    1997                    
    1998                    $C$DW$105       .dwtag  DW_TAG_enumerator
    1999                            .dwattr $C$DW$105, DW_AT_name("PMU_LSU_BUSY_STALL")
    2000                            .dwattr $C$DW$105, DW_AT_const_value(0x44)
    2001                            .dwattr $C$DW$105, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2002                            .dwattr $C$DW$105, DW_AT_decl_line(0x72)
    2003                            .dwattr $C$DW$105, DW_AT_decl_column(0x05)
    2004                    
    2005                    $C$DW$106       .dwtag  DW_TAG_enumerator
    2006                            .dwattr $C$DW$106, DW_AT_name("PMU_FORCED_DRAIN_OFSTORE_BUFFER")
    2007                            .dwattr $C$DW$106, DW_AT_const_value(0x45)
    2008                            .dwattr $C$DW$106, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2009                            .dwattr $C$DW$106, DW_AT_decl_line(0x73)
    2010                            .dwattr $C$DW$106, DW_AT_decl_column(0x05)
    2011                    
    2012                    $C$DW$107       .dwtag  DW_TAG_enumerator
    2013                            .dwattr $C$DW$107, DW_AT_name("PMU_FIQ_DISABLED_CYCLE_COUNT")
    2014                            .dwattr $C$DW$107, DW_AT_const_value(0x46)
    2015                            .dwattr $C$DW$107, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2016                            .dwattr $C$DW$107, DW_AT_decl_line(0x74)
    2017                            .dwattr $C$DW$107, DW_AT_decl_column(0x05)
    2018                    
    2019                    $C$DW$108       .dwtag  DW_TAG_enumerator
    2020                            .dwattr $C$DW$108, DW_AT_name("PMU_IRQ_DISABLED_CYCLE_COUNT")
    2021                            .dwattr $C$DW$108, DW_AT_const_value(0x47)
    2022                            .dwattr $C$DW$108, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2023                            .dwattr $C$DW$108, DW_AT_decl_line(0x75)
    2024                            .dwattr $C$DW$108, DW_AT_decl_column(0x05)
    2025                    
    2026                    $C$DW$109       .dwtag  DW_TAG_enumerator
    2027                            .dwattr $C$DW$109, DW_AT_name("PMU_ETMEXTOUT_0")
    2028                            .dwattr $C$DW$109, DW_AT_const_value(0x48)
    2029                            .dwattr $C$DW$109, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2030                            .dwattr $C$DW$109, DW_AT_decl_line(0x76)
    2031                            .dwattr $C$DW$109, DW_AT_decl_column(0x05)
    2032                    
    2033                    $C$DW$110       .dwtag  DW_TAG_enumerator
    2034                            .dwattr $C$DW$110, DW_AT_name("PMU_ETMEXTOUT_1")
    2035                            .dwattr $C$DW$110, DW_AT_const_value(0x49)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   38

    2036                            .dwattr $C$DW$110, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2037                            .dwattr $C$DW$110, DW_AT_decl_line(0x77)
    2038                            .dwattr $C$DW$110, DW_AT_decl_column(0x05)
    2039                    
    2040                    $C$DW$111       .dwtag  DW_TAG_enumerator
    2041                            .dwattr $C$DW$111, DW_AT_name("PMU_INST_CACHE_TAG_ECC_ERROR")
    2042                            .dwattr $C$DW$111, DW_AT_const_value(0x4a)
    2043                            .dwattr $C$DW$111, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2044                            .dwattr $C$DW$111, DW_AT_decl_line(0x78)
    2045                            .dwattr $C$DW$111, DW_AT_decl_column(0x05)
    2046                    
    2047                    $C$DW$112       .dwtag  DW_TAG_enumerator
    2048                            .dwattr $C$DW$112, DW_AT_name("PMU_INST_CACHE_DATA_ECC_ERROR")
    2049                            .dwattr $C$DW$112, DW_AT_const_value(0x4b)
    2050                            .dwattr $C$DW$112, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2051                            .dwattr $C$DW$112, DW_AT_decl_line(0x79)
    2052                            .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    2053                    
    2054                    $C$DW$113       .dwtag  DW_TAG_enumerator
    2055                            .dwattr $C$DW$113, DW_AT_name("PMU_DATA_CACHE_TAG_ECC_ERROR")
    2056                            .dwattr $C$DW$113, DW_AT_const_value(0x4c)
    2057                            .dwattr $C$DW$113, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2058                            .dwattr $C$DW$113, DW_AT_decl_line(0x7a)
    2059                            .dwattr $C$DW$113, DW_AT_decl_column(0x05)
    2060                    
    2061                    $C$DW$114       .dwtag  DW_TAG_enumerator
    2062                            .dwattr $C$DW$114, DW_AT_name("PMU_DATA_CACHE_DATA_ECC_ERROR")
    2063                            .dwattr $C$DW$114, DW_AT_const_value(0x4d)
    2064                            .dwattr $C$DW$114, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2065                            .dwattr $C$DW$114, DW_AT_decl_line(0x7b)
    2066                            .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    2067                    
    2068                    $C$DW$115       .dwtag  DW_TAG_enumerator
    2069                            .dwattr $C$DW$115, DW_AT_name("PMU_TCM_FATAL_ECC_ERROR_PREFETCH")
    2070                            .dwattr $C$DW$115, DW_AT_const_value(0x4e)
    2071                            .dwattr $C$DW$115, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2072                            .dwattr $C$DW$115, DW_AT_decl_line(0x7c)
    2073                            .dwattr $C$DW$115, DW_AT_decl_column(0x05)
    2074                    
    2075                    $C$DW$116       .dwtag  DW_TAG_enumerator
    2076                            .dwattr $C$DW$116, DW_AT_name("PMU_TCM_FATAL_ECC_ERROR_LOAD_STORE")
    2077                            .dwattr $C$DW$116, DW_AT_const_value(0x4f)
    2078                            .dwattr $C$DW$116, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2079                            .dwattr $C$DW$116, DW_AT_decl_line(0x7d)
    2080                            .dwattr $C$DW$116, DW_AT_decl_column(0x05)
    2081                    
    2082                    $C$DW$117       .dwtag  DW_TAG_enumerator
    2083                            .dwattr $C$DW$117, DW_AT_name("PMU_STORE_BUFFER_MERGE")
    2084                            .dwattr $C$DW$117, DW_AT_const_value(0x50)
    2085                            .dwattr $C$DW$117, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2086                            .dwattr $C$DW$117, DW_AT_decl_line(0x7e)
    2087                            .dwattr $C$DW$117, DW_AT_decl_column(0x05)
    2088                    
    2089                    $C$DW$118       .dwtag  DW_TAG_enumerator
    2090                            .dwattr $C$DW$118, DW_AT_name("PMU_LSU_STALL_STORE_BUFFER_FULL")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   39

    2091                            .dwattr $C$DW$118, DW_AT_const_value(0x51)
    2092                            .dwattr $C$DW$118, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2093                            .dwattr $C$DW$118, DW_AT_decl_line(0x7f)
    2094                            .dwattr $C$DW$118, DW_AT_decl_column(0x05)
    2095                    
    2096                    $C$DW$119       .dwtag  DW_TAG_enumerator
    2097                            .dwattr $C$DW$119, DW_AT_name("PMU_LSU_STALL_STORE_QUEUE_FULL")
    2098                            .dwattr $C$DW$119, DW_AT_const_value(0x52)
    2099                            .dwattr $C$DW$119, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2100                            .dwattr $C$DW$119, DW_AT_decl_line(0x80)
    2101                            .dwattr $C$DW$119, DW_AT_decl_column(0x05)
    2102                    
    2103                    $C$DW$120       .dwtag  DW_TAG_enumerator
    2104                            .dwattr $C$DW$120, DW_AT_name("PMU_INTEGER_DIV_EXECUTED")
    2105                            .dwattr $C$DW$120, DW_AT_const_value(0x53)
    2106                            .dwattr $C$DW$120, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2107                            .dwattr $C$DW$120, DW_AT_decl_line(0x81)
    2108                            .dwattr $C$DW$120, DW_AT_decl_column(0x05)
    2109                    
    2110                    $C$DW$121       .dwtag  DW_TAG_enumerator
    2111                            .dwattr $C$DW$121, DW_AT_name("PMU_STALL_INTEGER_DIV")
    2112                            .dwattr $C$DW$121, DW_AT_const_value(0x54)
    2113                            .dwattr $C$DW$121, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2114                            .dwattr $C$DW$121, DW_AT_decl_line(0x82)
    2115                            .dwattr $C$DW$121, DW_AT_decl_column(0x05)
    2116                    
    2117                    $C$DW$122       .dwtag  DW_TAG_enumerator
    2118                            .dwattr $C$DW$122, DW_AT_name("PMU_PLD_INST_LINE_FILL")
    2119                            .dwattr $C$DW$122, DW_AT_const_value(0x55)
    2120                            .dwattr $C$DW$122, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2121                            .dwattr $C$DW$122, DW_AT_decl_line(0x83)
    2122                            .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    2123                    
    2124                    $C$DW$123       .dwtag  DW_TAG_enumerator
    2125                            .dwattr $C$DW$123, DW_AT_name("PMU_PLD_INST_NO_LINE_FILL")
    2126                            .dwattr $C$DW$123, DW_AT_const_value(0x56)
    2127                            .dwattr $C$DW$123, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2128                            .dwattr $C$DW$123, DW_AT_decl_line(0x84)
    2129                            .dwattr $C$DW$123, DW_AT_decl_column(0x05)
    2130                    
    2131                    $C$DW$124       .dwtag  DW_TAG_enumerator
    2132                            .dwattr $C$DW$124, DW_AT_name("PMU_NON_CACHEABLE_ACCESS_AXI_MASTER")
    2133                            .dwattr $C$DW$124, DW_AT_const_value(0x57)
    2134                            .dwattr $C$DW$124, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2135                            .dwattr $C$DW$124, DW_AT_decl_line(0x85)
    2136                            .dwattr $C$DW$124, DW_AT_decl_column(0x05)
    2137                    
    2138                    $C$DW$125       .dwtag  DW_TAG_enumerator
    2139                            .dwattr $C$DW$125, DW_AT_name("PMU_INST_CACHE_ACCESS")
    2140                            .dwattr $C$DW$125, DW_AT_const_value(0x58)
    2141                            .dwattr $C$DW$125, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2142                            .dwattr $C$DW$125, DW_AT_decl_line(0x86)
    2143                            .dwattr $C$DW$125, DW_AT_decl_column(0x05)
    2144                    
    2145                    $C$DW$126       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   40

    2146                            .dwattr $C$DW$126, DW_AT_name("PMU_DOUBLE_DATA_CACHE_ISSUE")
    2147                            .dwattr $C$DW$126, DW_AT_const_value(0x59)
    2148                            .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2149                            .dwattr $C$DW$126, DW_AT_decl_line(0x87)
    2150                            .dwattr $C$DW$126, DW_AT_decl_column(0x05)
    2151                    
    2152                    $C$DW$127       .dwtag  DW_TAG_enumerator
    2153                            .dwattr $C$DW$127, DW_AT_name("PMU_DUAL_ISSUE_CASE_A")
    2154                            .dwattr $C$DW$127, DW_AT_const_value(0x5a)
    2155                            .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2156                            .dwattr $C$DW$127, DW_AT_decl_line(0x88)
    2157                            .dwattr $C$DW$127, DW_AT_decl_column(0x05)
    2158                    
    2159                    $C$DW$128       .dwtag  DW_TAG_enumerator
    2160                            .dwattr $C$DW$128, DW_AT_name("PMU_DUAL_ISSUE_CASE_B1_B2_F2_F2D")
    2161                            .dwattr $C$DW$128, DW_AT_const_value(0x5b)
    2162                            .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2163                            .dwattr $C$DW$128, DW_AT_decl_line(0x89)
    2164                            .dwattr $C$DW$128, DW_AT_decl_column(0x05)
    2165                    
    2166                    $C$DW$129       .dwtag  DW_TAG_enumerator
    2167                            .dwattr $C$DW$129, DW_AT_name("PMU_DUAL_ISSUE_OTHER")
    2168                            .dwattr $C$DW$129, DW_AT_const_value(0x5c)
    2169                            .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2170                            .dwattr $C$DW$129, DW_AT_decl_line(0x8a)
    2171                            .dwattr $C$DW$129, DW_AT_decl_column(0x05)
    2172                    
    2173                    $C$DW$130       .dwtag  DW_TAG_enumerator
    2174                            .dwattr $C$DW$130, DW_AT_name("PMU_DP_FLOAT_INST_EXCECUTED")
    2175                            .dwattr $C$DW$130, DW_AT_const_value(0x5d)
    2176                            .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2177                            .dwattr $C$DW$130, DW_AT_decl_line(0x8b)
    2178                            .dwattr $C$DW$130, DW_AT_decl_column(0x05)
    2179                    
    2180                    $C$DW$131       .dwtag  DW_TAG_enumerator
    2181                            .dwattr $C$DW$131, DW_AT_name("PMU_DUAL_ISSUED_PAIR_INST_ARCH_EXECUTED")
    2182                            .dwattr $C$DW$131, DW_AT_const_value(0x5e)
    2183                            .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2184                            .dwattr $C$DW$131, DW_AT_decl_line(0x8c)
    2185                            .dwattr $C$DW$131, DW_AT_decl_column(0x05)
    2186                    
    2187                    $C$DW$132       .dwtag  DW_TAG_enumerator
    2188                            .dwattr $C$DW$132, DW_AT_name("PMU_DATA_CACHE_DATA_FATAL_ECC_ERROR")
    2189                            .dwattr $C$DW$132, DW_AT_const_value(0x60)
    2190                            .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2191                            .dwattr $C$DW$132, DW_AT_decl_line(0x8d)
    2192                            .dwattr $C$DW$132, DW_AT_decl_column(0x05)
    2193                    
    2194                    $C$DW$133       .dwtag  DW_TAG_enumerator
    2195                            .dwattr $C$DW$133, DW_AT_name("PMU_DATA_CACHE_TAG_FATAL_ECC_ERROR")
    2196                            .dwattr $C$DW$133, DW_AT_const_value(0x61)
    2197                            .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2198                            .dwattr $C$DW$133, DW_AT_decl_line(0x8e)
    2199                            .dwattr $C$DW$133, DW_AT_decl_column(0x05)
    2200                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   41

    2201                    $C$DW$134       .dwtag  DW_TAG_enumerator
    2202                            .dwattr $C$DW$134, DW_AT_name("PMU_PROCESSOR_LIVE_LOCK")
    2203                            .dwattr $C$DW$134, DW_AT_const_value(0x62)
    2204                            .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2205                            .dwattr $C$DW$134, DW_AT_decl_line(0x8f)
    2206                            .dwattr $C$DW$134, DW_AT_decl_column(0x05)
    2207                    
    2208                    $C$DW$135       .dwtag  DW_TAG_enumerator
    2209                            .dwattr $C$DW$135, DW_AT_name("PMU_ATCM_MULTI_BIT_ECC_ERROR")
    2210                            .dwattr $C$DW$135, DW_AT_const_value(0x64)
    2211                            .dwattr $C$DW$135, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2212                            .dwattr $C$DW$135, DW_AT_decl_line(0x90)
    2213                            .dwattr $C$DW$135, DW_AT_decl_column(0x05)
    2214                    
    2215                    $C$DW$136       .dwtag  DW_TAG_enumerator
    2216                            .dwattr $C$DW$136, DW_AT_name("PMU_B0TCM_MULTI_BIT_ECC_ERROR")
    2217                            .dwattr $C$DW$136, DW_AT_const_value(0x65)
    2218                            .dwattr $C$DW$136, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2219                            .dwattr $C$DW$136, DW_AT_decl_line(0x91)
    2220                            .dwattr $C$DW$136, DW_AT_decl_column(0x05)
    2221                    
    2222                    $C$DW$137       .dwtag  DW_TAG_enumerator
    2223                            .dwattr $C$DW$137, DW_AT_name("PMU_B1TCM_MULTI_BIT_ECC_ERROR")
    2224                            .dwattr $C$DW$137, DW_AT_const_value(0x66)
    2225                            .dwattr $C$DW$137, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2226                            .dwattr $C$DW$137, DW_AT_decl_line(0x92)
    2227                            .dwattr $C$DW$137, DW_AT_decl_column(0x05)
    2228                    
    2229                    $C$DW$138       .dwtag  DW_TAG_enumerator
    2230                            .dwattr $C$DW$138, DW_AT_name("PMU_ATCM_SINGLE_BIT_ECC_ERROR")
    2231                            .dwattr $C$DW$138, DW_AT_const_value(0x67)
    2232                            .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2233                            .dwattr $C$DW$138, DW_AT_decl_line(0x93)
    2234                            .dwattr $C$DW$138, DW_AT_decl_column(0x05)
    2235                    
    2236                    $C$DW$139       .dwtag  DW_TAG_enumerator
    2237                            .dwattr $C$DW$139, DW_AT_name("PMU_B0TCM_SINGLE_BIT_ECC_ERROR")
    2238                            .dwattr $C$DW$139, DW_AT_const_value(0x68)
    2239                            .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2240                            .dwattr $C$DW$139, DW_AT_decl_line(0x94)
    2241                            .dwattr $C$DW$139, DW_AT_decl_column(0x05)
    2242                    
    2243                    $C$DW$140       .dwtag  DW_TAG_enumerator
    2244                            .dwattr $C$DW$140, DW_AT_name("PMU_B1TCM_SINGLE_BIT_ECC_ERROR")
    2245                            .dwattr $C$DW$140, DW_AT_const_value(0x69)
    2246                            .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2247                            .dwattr $C$DW$140, DW_AT_decl_line(0x95)
    2248                            .dwattr $C$DW$140, DW_AT_decl_column(0x05)
    2249                    
    2250                    $C$DW$141       .dwtag  DW_TAG_enumerator
    2251                            .dwattr $C$DW$141, DW_AT_name("PMU_TCM_COR_ECC_ERROR_LOAD_STORE")
    2252                            .dwattr $C$DW$141, DW_AT_const_value(0x6a)
    2253                            .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2254                            .dwattr $C$DW$141, DW_AT_decl_line(0x96)
    2255                            .dwattr $C$DW$141, DW_AT_decl_column(0x05)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   42

    2256                    
    2257                    $C$DW$142       .dwtag  DW_TAG_enumerator
    2258                            .dwattr $C$DW$142, DW_AT_name("PMU_TCM_COR_ECC_ERROR_PREFETCH")
    2259                            .dwattr $C$DW$142, DW_AT_const_value(0x6b)
    2260                            .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2261                            .dwattr $C$DW$142, DW_AT_decl_line(0x97)
    2262                            .dwattr $C$DW$142, DW_AT_decl_column(0x05)
    2263                    
    2264                    $C$DW$143       .dwtag  DW_TAG_enumerator
    2265                            .dwattr $C$DW$143, DW_AT_name("PMU_TCM_FATAL_ECC_ERROR_AXI_SLAVE")
    2266                            .dwattr $C$DW$143, DW_AT_const_value(0x6c)
    2267                            .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2268                            .dwattr $C$DW$143, DW_AT_decl_line(0x98)
    2269                            .dwattr $C$DW$143, DW_AT_decl_column(0x05)
    2270                    
    2271                    $C$DW$144       .dwtag  DW_TAG_enumerator
    2272                            .dwattr $C$DW$144, DW_AT_name("PMU_TCM_COR_ECC_ERROR_AXI_SLAVE")
    2273                            .dwattr $C$DW$144, DW_AT_const_value(0x6d)
    2274                            .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2275                            .dwattr $C$DW$144, DW_AT_decl_line(0x99)
    2276                            .dwattr $C$DW$144, DW_AT_decl_column(0x05)
    2277                    
    2278                    $C$DW$145       .dwtag  DW_TAG_enumerator
    2279                            .dwattr $C$DW$145, DW_AT_name("PMU_ALL_CORRECTABLE_EVENTS")
    2280                            .dwattr $C$DW$145, DW_AT_const_value(0x6e)
    2281                            .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2282                            .dwattr $C$DW$145, DW_AT_decl_line(0x9a)
    2283                            .dwattr $C$DW$145, DW_AT_decl_column(0x05)
    2284                    
    2285                    $C$DW$146       .dwtag  DW_TAG_enumerator
    2286                            .dwattr $C$DW$146, DW_AT_name("PMU_ALL_FATAL_EVENTS")
    2287                            .dwattr $C$DW$146, DW_AT_const_value(0x6f)
    2288                            .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2289                            .dwattr $C$DW$146, DW_AT_decl_line(0x9b)
    2290                            .dwattr $C$DW$146, DW_AT_decl_column(0x05)
    2291                    
    2292                    $C$DW$147       .dwtag  DW_TAG_enumerator
    2293                            .dwattr $C$DW$147, DW_AT_name("PMU_ALL_CORRECTABLE_FAULTS")
    2294                            .dwattr $C$DW$147, DW_AT_const_value(0x70)
    2295                            .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2296                            .dwattr $C$DW$147, DW_AT_decl_line(0x9c)
    2297                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    2298                    
    2299                    $C$DW$148       .dwtag  DW_TAG_enumerator
    2300                            .dwattr $C$DW$148, DW_AT_name("PMU_ALL_FATAL_FAULTS")
    2301                            .dwattr $C$DW$148, DW_AT_const_value(0x71)
    2302                            .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2303                            .dwattr $C$DW$148, DW_AT_decl_line(0x9d)
    2304                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    2305                    
    2306                    $C$DW$149       .dwtag  DW_TAG_enumerator
    2307                            .dwattr $C$DW$149, DW_AT_name("PMU_ACP_DCACHE_ACCESS_LOOKUP_INVALIDATE")
    2308                            .dwattr $C$DW$149, DW_AT_const_value(0x72)
    2309                            .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2310                            .dwattr $C$DW$149, DW_AT_decl_line(0x9e)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   43

    2311                            .dwattr $C$DW$149, DW_AT_decl_column(0x05)
    2312                    
    2313                    $C$DW$150       .dwtag  DW_TAG_enumerator
    2314                            .dwattr $C$DW$150, DW_AT_name("PMU_ACP_DCACHE_INVALIDATE")
    2315                            .dwattr $C$DW$150, DW_AT_const_value(0x73)
    2316                            .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2317                            .dwattr $C$DW$150, DW_AT_decl_line(0x9f)
    2318                            .dwattr $C$DW$150, DW_AT_decl_column(0x05)
    2319                    
    2320                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    2321                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x5c)
    2322                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x06)
    2323                            .dwendtag $C$DW$T$90
    2324                    
    2325                    
    2326                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2327                            .dwattr $C$DW$T$26, DW_AT_name("systemBase1")
    2328                            .dwattr $C$DW$T$26, DW_AT_byte_size(0xfc)
    2329                    $C$DW$151       .dwtag  DW_TAG_member
    2330                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    2331                            .dwattr $C$DW$151, DW_AT_name("SYSPC1")
    2332                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("SYSPC1")
    2333                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2334                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2335                            .dwattr $C$DW$151, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2336                            .dwattr $C$DW$151, DW_AT_decl_line(0x44)
    2337                            .dwattr $C$DW$151, DW_AT_decl_column(0x0c)
    2338                    
    2339                    $C$DW$152       .dwtag  DW_TAG_member
    2340                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    2341                            .dwattr $C$DW$152, DW_AT_name("SYSPC2")
    2342                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("SYSPC2")
    2343                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2344                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2345                            .dwattr $C$DW$152, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2346                            .dwattr $C$DW$152, DW_AT_decl_line(0x45)
    2347                            .dwattr $C$DW$152, DW_AT_decl_column(0x0c)
    2348                    
    2349                    $C$DW$153       .dwtag  DW_TAG_member
    2350                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    2351                            .dwattr $C$DW$153, DW_AT_name("SYSPC3")
    2352                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("SYSPC3")
    2353                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2354                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2355                            .dwattr $C$DW$153, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2356                            .dwattr $C$DW$153, DW_AT_decl_line(0x46)
    2357                            .dwattr $C$DW$153, DW_AT_decl_column(0x0c)
    2358                    
    2359                    $C$DW$154       .dwtag  DW_TAG_member
    2360                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    2361                            .dwattr $C$DW$154, DW_AT_name("SYSPC4")
    2362                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("SYSPC4")
    2363                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2364                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2365                            .dwattr $C$DW$154, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   44

    2366                            .dwattr $C$DW$154, DW_AT_decl_line(0x47)
    2367                            .dwattr $C$DW$154, DW_AT_decl_column(0x0c)
    2368                    
    2369                    $C$DW$155       .dwtag  DW_TAG_member
    2370                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2371                            .dwattr $C$DW$155, DW_AT_name("SYSPC5")
    2372                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("SYSPC5")
    2373                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2374                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2375                            .dwattr $C$DW$155, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2376                            .dwattr $C$DW$155, DW_AT_decl_line(0x48)
    2377                            .dwattr $C$DW$155, DW_AT_decl_column(0x0c)
    2378                    
    2379                    $C$DW$156       .dwtag  DW_TAG_member
    2380                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    2381                            .dwattr $C$DW$156, DW_AT_name("SYSPC6")
    2382                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("SYSPC6")
    2383                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2384                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2385                            .dwattr $C$DW$156, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2386                            .dwattr $C$DW$156, DW_AT_decl_line(0x49)
    2387                            .dwattr $C$DW$156, DW_AT_decl_column(0x0c)
    2388                    
    2389                    $C$DW$157       .dwtag  DW_TAG_member
    2390                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    2391                            .dwattr $C$DW$157, DW_AT_name("SYSPC7")
    2392                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("SYSPC7")
    2393                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2394                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2395                            .dwattr $C$DW$157, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2396                            .dwattr $C$DW$157, DW_AT_decl_line(0x4a)
    2397                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    2398                    
    2399                    $C$DW$158       .dwtag  DW_TAG_member
    2400                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2401                            .dwattr $C$DW$158, DW_AT_name("SYSPC8")
    2402                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("SYSPC8")
    2403                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2404                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2405                            .dwattr $C$DW$158, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2406                            .dwattr $C$DW$158, DW_AT_decl_line(0x4b)
    2407                            .dwattr $C$DW$158, DW_AT_decl_column(0x0c)
    2408                    
    2409                    $C$DW$159       .dwtag  DW_TAG_member
    2410                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    2411                            .dwattr $C$DW$159, DW_AT_name("SYSPC9")
    2412                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("SYSPC9")
    2413                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2414                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2415                            .dwattr $C$DW$159, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2416                            .dwattr $C$DW$159, DW_AT_decl_line(0x4c)
    2417                            .dwattr $C$DW$159, DW_AT_decl_column(0x0c)
    2418                    
    2419                    $C$DW$160       .dwtag  DW_TAG_member
    2420                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1248010                              PAGE   45

    2421                            .dwattr $C$DW$160, DW_AT_name("rsvd1")
    2422                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("rsvd1")
    2423                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2424                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2425                            .dwattr $C$DW$160, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2426                            .dwattr $C$DW$160, DW_AT_decl_line(0x4d)
    2427                            .dwattr $C$DW$160, DW_AT_decl_column(0x0c)
    2428                    
    2429                    $C$DW$161       .dwtag  DW_TAG_member
    2430                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2431                            .dwattr $C$DW$161, DW_AT_name("rsvd2")
    2432                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("rsvd2")
    2433                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2434                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2435                            .dwattr $C$DW$161, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2436                            .dwattr $C$DW$161, DW_AT_decl_line(0x4e)
    2437                            .dwattr $C$DW$161, DW_AT_decl_column(0x0c)
    2438                    
    2439                    $C$DW$162       .dwtag  DW_TAG_member
    2440                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2441                            .dwattr $C$DW$162, DW_AT_name("rsvd3")
    2442                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("rsvd3")
    2443                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2444                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2445                            .dwattr $C$DW$162, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2446                            .dwattr $C$DW$162, DW_AT_decl_line(0x4f)
    2447                            .dwattr $C$DW$162, DW_AT_decl_column(0x0c)
    2448                    
    2449                    $C$DW$163       .dwtag  DW_TAG_member
    2450                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2451                            .dwattr $C$DW$163, DW_AT_name("CSDIS")
    2452                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("CSDIS")
    2453                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2454                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2455                            .dwattr $C$DW$163, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
