TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 13:27:08 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_gio.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    ;       C:\ti\ccsv7\tools\compiler\ti-cgt-arm_16.9.0.LTS\bin\armacpia.exe -@C:\\Users\\bob\\AppData\\L

C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   29

    1541                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1542                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1543                    
    1544                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    1545                            .dwattr $C$DW$T$79, DW_AT_name("float64")
    1546                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$17)
    1547                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1548                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1549                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x72)
    1550                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x10)
    1551                    
    1552                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1553                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1554                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1555                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1556                    
    1557                    $C$DW$T$80      .dwtag  DW_TAG_base_type
    1558                            .dwattr $C$DW$T$80, DW_AT_encoding(DW_ATE_unsigned_char)
    1559                            .dwattr $C$DW$T$80, DW_AT_name("unsigned char")
    1560                            .dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
    1561                    
    1562                    $C$DW$T$81      .dwtag  DW_TAG_typedef
    1563                            .dwattr $C$DW$T$81, DW_AT_name("boolean")
    1564                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1565                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1566                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1567                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x53)
    1568                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x0f)
    1569                    
    1570                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    1571                            .dwattr $C$DW$T$82, DW_AT_name("tBoolean")
    1572                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    1573                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1574                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1575                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x40)
    1576                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x11)
    1577                    
    1578                    
    1579                    $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1580                            .dwattr $C$DW$T$38, DW_AT_name("config_value_type")
    1581                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1582                    $C$DW$59        .dwtag  DW_TAG_enumerator
    1583                            .dwattr $C$DW$59, DW_AT_name("InitialValue")
    1584                            .dwattr $C$DW$59, DW_AT_const_value(0x00)
    1585                            .dwattr $C$DW$59, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1586                            .dwattr $C$DW$59, DW_AT_decl_line(0x5c)
    1587                            .dwattr $C$DW$59, DW_AT_decl_column(0x02)
    1588                    
    1589                    $C$DW$60        .dwtag  DW_TAG_enumerator
    1590                            .dwattr $C$DW$60, DW_AT_name("CurrentValue")
    1591                            .dwattr $C$DW$60, DW_AT_const_value(0x01)
    1592                            .dwattr $C$DW$60, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1593                            .dwattr $C$DW$60, DW_AT_decl_line(0x5d)
    1594                            .dwattr $C$DW$60, DW_AT_decl_column(0x02)
    1595                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   30

    1596                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1597                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x5a)
    1598                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0e)
    1599                            .dwendtag $C$DW$T$38
    1600                    
    1601                    $C$DW$T$39      .dwtag  DW_TAG_typedef
    1602                            .dwattr $C$DW$T$39, DW_AT_name("config_value_type_t")
    1603                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1604                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1605                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1606                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x5e)
    1607                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x02)
    1608                    
    1609                    
    1610                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1611                            .dwattr $C$DW$T$21, DW_AT_name("gioBase")
    1612                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x34)
    1613                    $C$DW$61        .dwtag  DW_TAG_member
    1614                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$20)
    1615                            .dwattr $C$DW$61, DW_AT_name("GCR0")
    1616                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("GCR0")
    1617                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1619                            .dwattr $C$DW$61, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1620                            .dwattr $C$DW$61, DW_AT_decl_line(0x48)
    1621                            .dwattr $C$DW$61, DW_AT_decl_column(0x0c)
    1622                    
    1623                    $C$DW$62        .dwtag  DW_TAG_member
    1624                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
    1625                            .dwattr $C$DW$62, DW_AT_name("rsvd")
    1626                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("rsvd")
    1627                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1628                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1629                            .dwattr $C$DW$62, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1630                            .dwattr $C$DW$62, DW_AT_decl_line(0x49)
    1631                            .dwattr $C$DW$62, DW_AT_decl_column(0x0e)
    1632                    
    1633                    $C$DW$63        .dwtag  DW_TAG_member
    1634                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$20)
    1635                            .dwattr $C$DW$63, DW_AT_name("INTDET")
    1636                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("INTDET")
    1637                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1638                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1639                            .dwattr $C$DW$63, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1640                            .dwattr $C$DW$63, DW_AT_decl_line(0x4a)
    1641                            .dwattr $C$DW$63, DW_AT_decl_column(0x0c)
    1642                    
    1643                    $C$DW$64        .dwtag  DW_TAG_member
    1644                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
    1645                            .dwattr $C$DW$64, DW_AT_name("POL")
    1646                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("POL")
    1647                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1648                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1649                            .dwattr $C$DW$64, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1650                            .dwattr $C$DW$64, DW_AT_decl_line(0x4b)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   31

    1651                            .dwattr $C$DW$64, DW_AT_decl_column(0x0c)
    1652                    
    1653                    $C$DW$65        .dwtag  DW_TAG_member
    1654                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
    1655                            .dwattr $C$DW$65, DW_AT_name("ENASET")
    1656                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("ENASET")
    1657                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1658                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1659                            .dwattr $C$DW$65, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1660                            .dwattr $C$DW$65, DW_AT_decl_line(0x4c)
    1661                            .dwattr $C$DW$65, DW_AT_decl_column(0x0c)
    1662                    
    1663                    $C$DW$66        .dwtag  DW_TAG_member
    1664                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
    1665                            .dwattr $C$DW$66, DW_AT_name("ENACLR")
    1666                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("ENACLR")
    1667                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1668                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1669                            .dwattr $C$DW$66, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1670                            .dwattr $C$DW$66, DW_AT_decl_line(0x4d)
    1671                            .dwattr $C$DW$66, DW_AT_decl_column(0x0c)
    1672                    
    1673                    $C$DW$67        .dwtag  DW_TAG_member
    1674                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    1675                            .dwattr $C$DW$67, DW_AT_name("LVLSET")
    1676                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("LVLSET")
    1677                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1678                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1679                            .dwattr $C$DW$67, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1680                            .dwattr $C$DW$67, DW_AT_decl_line(0x4e)
    1681                            .dwattr $C$DW$67, DW_AT_decl_column(0x0c)
    1682                    
    1683                    $C$DW$68        .dwtag  DW_TAG_member
    1684                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
    1685                            .dwattr $C$DW$68, DW_AT_name("LVLCLR")
    1686                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("LVLCLR")
    1687                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1688                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1689                            .dwattr $C$DW$68, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1690                            .dwattr $C$DW$68, DW_AT_decl_line(0x4f)
    1691                            .dwattr $C$DW$68, DW_AT_decl_column(0x0c)
    1692                    
    1693                    $C$DW$69        .dwtag  DW_TAG_member
    1694                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
    1695                            .dwattr $C$DW$69, DW_AT_name("FLG")
    1696                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("FLG")
    1697                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1698                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1699                            .dwattr $C$DW$69, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1700                            .dwattr $C$DW$69, DW_AT_decl_line(0x50)
    1701                            .dwattr $C$DW$69, DW_AT_decl_column(0x0c)
    1702                    
    1703                    $C$DW$70        .dwtag  DW_TAG_member
    1704                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$20)
    1705                            .dwattr $C$DW$70, DW_AT_name("OFF1")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   32

    1706                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("OFF1")
    1707                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1708                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1709                            .dwattr $C$DW$70, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1710                            .dwattr $C$DW$70, DW_AT_decl_line(0x51)
    1711                            .dwattr $C$DW$70, DW_AT_decl_column(0x0c)
    1712                    
    1713                    $C$DW$71        .dwtag  DW_TAG_member
    1714                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1715                            .dwattr $C$DW$71, DW_AT_name("OFF2")
    1716                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("OFF2")
    1717                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1718                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1719                            .dwattr $C$DW$71, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1720                            .dwattr $C$DW$71, DW_AT_decl_line(0x52)
    1721                            .dwattr $C$DW$71, DW_AT_decl_column(0x0c)
    1722                    
    1723                    $C$DW$72        .dwtag  DW_TAG_member
    1724                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
    1725                            .dwattr $C$DW$72, DW_AT_name("EMU1")
    1726                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("EMU1")
    1727                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1728                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1729                            .dwattr $C$DW$72, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1730                            .dwattr $C$DW$72, DW_AT_decl_line(0x53)
    1731                            .dwattr $C$DW$72, DW_AT_decl_column(0x0c)
    1732                    
    1733                    $C$DW$73        .dwtag  DW_TAG_member
    1734                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
    1735                            .dwattr $C$DW$73, DW_AT_name("EMU2")
    1736                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("EMU2")
    1737                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1738                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1739                            .dwattr $C$DW$73, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1740                            .dwattr $C$DW$73, DW_AT_decl_line(0x54)
    1741                            .dwattr $C$DW$73, DW_AT_decl_column(0x09)
    1742                    
    1743                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1744                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x46)
    1745                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x19)
    1746                            .dwendtag $C$DW$T$21
    1747                    
    1748                    $C$DW$T$83      .dwtag  DW_TAG_volatile_type
    1749                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$21)
    1750                    
    1751                    $C$DW$T$84      .dwtag  DW_TAG_typedef
    1752                            .dwattr $C$DW$T$84, DW_AT_name("gioBASE_t")
    1753                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    1754                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1755                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1756                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x55)
    1757                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1758                    
    1759                    
    1760                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   33

    1761                            .dwattr $C$DW$T$22, DW_AT_name("gioPort")
    1762                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x20)
    1763                    $C$DW$74        .dwtag  DW_TAG_member
    1764                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
    1765                            .dwattr $C$DW$74, DW_AT_name("DIR")
    1766                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("DIR")
    1767                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1769                            .dwattr $C$DW$74, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1770                            .dwattr $C$DW$74, DW_AT_decl_line(0x62)
    1771                            .dwattr $C$DW$74, DW_AT_decl_column(0x0c)
    1772                    
    1773                    $C$DW$75        .dwtag  DW_TAG_member
    1774                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
    1775                            .dwattr $C$DW$75, DW_AT_name("DIN")
    1776                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("DIN")
    1777                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1778                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1779                            .dwattr $C$DW$75, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1780                            .dwattr $C$DW$75, DW_AT_decl_line(0x63)
    1781                            .dwattr $C$DW$75, DW_AT_decl_column(0x0c)
    1782                    
    1783                    $C$DW$76        .dwtag  DW_TAG_member
    1784                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1785                            .dwattr $C$DW$76, DW_AT_name("DOUT")
    1786                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("DOUT")
    1787                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1788                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1789                            .dwattr $C$DW$76, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1790                            .dwattr $C$DW$76, DW_AT_decl_line(0x64)
    1791                            .dwattr $C$DW$76, DW_AT_decl_column(0x0c)
    1792                    
    1793                    $C$DW$77        .dwtag  DW_TAG_member
    1794                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
    1795                            .dwattr $C$DW$77, DW_AT_name("DSET")
    1796                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("DSET")
    1797                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1798                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1799                            .dwattr $C$DW$77, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1800                            .dwattr $C$DW$77, DW_AT_decl_line(0x65)
    1801                            .dwattr $C$DW$77, DW_AT_decl_column(0x0c)
    1802                    
    1803                    $C$DW$78        .dwtag  DW_TAG_member
    1804                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1805                            .dwattr $C$DW$78, DW_AT_name("DCLR")
    1806                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("DCLR")
    1807                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1808                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1809                            .dwattr $C$DW$78, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1810                            .dwattr $C$DW$78, DW_AT_decl_line(0x66)
    1811                            .dwattr $C$DW$78, DW_AT_decl_column(0x0c)
    1812                    
    1813                    $C$DW$79        .dwtag  DW_TAG_member
    1814                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    1815                            .dwattr $C$DW$79, DW_AT_name("PDR")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   34

    1816                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("PDR")
    1817                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1818                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1819                            .dwattr $C$DW$79, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1820                            .dwattr $C$DW$79, DW_AT_decl_line(0x67)
    1821                            .dwattr $C$DW$79, DW_AT_decl_column(0x0c)
    1822                    
    1823                    $C$DW$80        .dwtag  DW_TAG_member
    1824                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    1825                            .dwattr $C$DW$80, DW_AT_name("PULDIS")
    1826                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("PULDIS")
    1827                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1828                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1829                            .dwattr $C$DW$80, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1830                            .dwattr $C$DW$80, DW_AT_decl_line(0x68)
    1831                            .dwattr $C$DW$80, DW_AT_decl_column(0x0c)
    1832                    
    1833                    $C$DW$81        .dwtag  DW_TAG_member
    1834                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    1835                            .dwattr $C$DW$81, DW_AT_name("PSL")
    1836                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("PSL")
    1837                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1838                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1839                            .dwattr $C$DW$81, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1840                            .dwattr $C$DW$81, DW_AT_decl_line(0x69)
    1841                            .dwattr $C$DW$81, DW_AT_decl_column(0x0c)
    1842                    
    1843                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1844                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x60)
    1845                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x19)
    1846                            .dwendtag $C$DW$T$22
    1847                    
    1848                    $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    1849                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$22)
    1850                    
    1851                    $C$DW$T$32      .dwtag  DW_TAG_typedef
    1852                            .dwattr $C$DW$T$32, DW_AT_name("gioPORT_t")
    1853                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1854                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1855                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1856                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x6a)
    1857                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1858                    
    1859                    $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1860                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1861                            .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    1862                    
    1863                    
    1864                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1865                            .dwattr $C$DW$T$23, DW_AT_name("gio_config_reg")
    1866                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x30)
    1867                    $C$DW$82        .dwtag  DW_TAG_member
    1868                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    1869                            .dwattr $C$DW$82, DW_AT_name("CONFIG_INTDET")
    1870                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("CONFIG_INTDET")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   35

    1871                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1872                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1873                            .dwattr $C$DW$82, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1874                            .dwattr $C$DW$82, DW_AT_decl_line(0x39)
    1875                            .dwattr $C$DW$82, DW_AT_decl_column(0x0c)
    1876                    
    1877                    $C$DW$83        .dwtag  DW_TAG_member
    1878                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1879                            .dwattr $C$DW$83, DW_AT_name("CONFIG_POL")
    1880                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("CONFIG_POL")
    1881                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1882                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1883                            .dwattr $C$DW$83, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1884                            .dwattr $C$DW$83, DW_AT_decl_line(0x3a)
    1885                            .dwattr $C$DW$83, DW_AT_decl_column(0x0c)
    1886                    
    1887                    $C$DW$84        .dwtag  DW_TAG_member
    1888                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    1889                            .dwattr $C$DW$84, DW_AT_name("CONFIG_INTENASET")
    1890                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("CONFIG_INTENASET")
    1891                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1892                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1893                            .dwattr $C$DW$84, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1894                            .dwattr $C$DW$84, DW_AT_decl_line(0x3b)
    1895                            .dwattr $C$DW$84, DW_AT_decl_column(0x0c)
    1896                    
    1897                    $C$DW$85        .dwtag  DW_TAG_member
    1898                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1899                            .dwattr $C$DW$85, DW_AT_name("CONFIG_LVLSET")
    1900                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("CONFIG_LVLSET")
    1901                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1902                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1903                            .dwattr $C$DW$85, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1904                            .dwattr $C$DW$85, DW_AT_decl_line(0x3c)
    1905                            .dwattr $C$DW$85, DW_AT_decl_column(0x0c)
    1906                    
    1907                    $C$DW$86        .dwtag  DW_TAG_member
    1908                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1909                            .dwattr $C$DW$86, DW_AT_name("CONFIG_PORTADIR")
    1910                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("CONFIG_PORTADIR")
    1911                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1912                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1913                            .dwattr $C$DW$86, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1914                            .dwattr $C$DW$86, DW_AT_decl_line(0x3e)
    1915                            .dwattr $C$DW$86, DW_AT_decl_column(0x09)
    1916                    
    1917                    $C$DW$87        .dwtag  DW_TAG_member
    1918                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    1919                            .dwattr $C$DW$87, DW_AT_name("CONFIG_PORTAPDR")
    1920                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("CONFIG_PORTAPDR")
    1921                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1922                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1923                            .dwattr $C$DW$87, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1924                            .dwattr $C$DW$87, DW_AT_decl_line(0x3f)
    1925                            .dwattr $C$DW$87, DW_AT_decl_column(0x09)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   36

    1926                    
    1927                    $C$DW$88        .dwtag  DW_TAG_member
    1928                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    1929                            .dwattr $C$DW$88, DW_AT_name("CONFIG_PORTAPSL")
    1930                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("CONFIG_PORTAPSL")
    1931                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1932                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1933                            .dwattr $C$DW$88, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1934                            .dwattr $C$DW$88, DW_AT_decl_line(0x40)
    1935                            .dwattr $C$DW$88, DW_AT_decl_column(0x09)
    1936                    
    1937                    $C$DW$89        .dwtag  DW_TAG_member
    1938                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1939                            .dwattr $C$DW$89, DW_AT_name("CONFIG_PORTAPULDIS")
    1940                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("CONFIG_PORTAPULDIS")
    1941                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1942                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1943                            .dwattr $C$DW$89, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1944                            .dwattr $C$DW$89, DW_AT_decl_line(0x41)
    1945                            .dwattr $C$DW$89, DW_AT_decl_column(0x09)
    1946                    
    1947                    $C$DW$90        .dwtag  DW_TAG_member
    1948                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    1949                            .dwattr $C$DW$90, DW_AT_name("CONFIG_PORTBDIR")
    1950                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("CONFIG_PORTBDIR")
    1951                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1952                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1953                            .dwattr $C$DW$90, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1954                            .dwattr $C$DW$90, DW_AT_decl_line(0x43)
    1955                            .dwattr $C$DW$90, DW_AT_decl_column(0x09)
    1956                    
    1957                    $C$DW$91        .dwtag  DW_TAG_member
    1958                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    1959                            .dwattr $C$DW$91, DW_AT_name("CONFIG_PORTBPDR")
    1960                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("CONFIG_PORTBPDR")
    1961                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1962                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1963                            .dwattr $C$DW$91, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1964                            .dwattr $C$DW$91, DW_AT_decl_line(0x44)
    1965                            .dwattr $C$DW$91, DW_AT_decl_column(0x09)
    1966                    
    1967                    $C$DW$92        .dwtag  DW_TAG_member
    1968                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    1969                            .dwattr $C$DW$92, DW_AT_name("CONFIG_PORTBPSL")
    1970                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("CONFIG_PORTBPSL")
    1971                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1972                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1973                            .dwattr $C$DW$92, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1974                            .dwattr $C$DW$92, DW_AT_decl_line(0x45)
    1975                            .dwattr $C$DW$92, DW_AT_decl_column(0x09)
    1976                    
    1977                    $C$DW$93        .dwtag  DW_TAG_member
    1978                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    1979                            .dwattr $C$DW$93, DW_AT_name("CONFIG_PORTBPULDIS")
    1980                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("CONFIG_PORTBPULDIS")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   37

    1981                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1982                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1983                            .dwattr $C$DW$93, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1984                            .dwattr $C$DW$93, DW_AT_decl_line(0x46)
    1985                            .dwattr $C$DW$93, DW_AT_decl_column(0x09)
    1986                    
    1987                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    1988                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x37)
    1989                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    1990                            .dwendtag $C$DW$T$23
    1991                    
    1992                    $C$DW$T$36      .dwtag  DW_TAG_typedef
    1993                            .dwattr $C$DW$T$36, DW_AT_name("gio_config_reg_t")
    1994                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$23)
    1995                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1996                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    1997                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x47)
    1998                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x02)
    1999                    
    2000                    $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2001                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2002                            .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    2003                    
    2004                    
    2005                    $C$DW$T$86      .dwtag  DW_TAG_enumeration_type
    2006                            .dwattr $C$DW$T$86, DW_AT_name("loopBackType")
    2007                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
    2008                    $C$DW$94        .dwtag  DW_TAG_enumerator
    2009                            .dwattr $C$DW$94, DW_AT_name("Digital_Lbk")
    2010                            .dwattr $C$DW$94, DW_AT_const_value(0x00)
    2011                            .dwattr $C$DW$94, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2012                            .dwattr $C$DW$94, DW_AT_decl_line(0x4e)
    2013                            .dwattr $C$DW$94, DW_AT_decl_column(0x05)
    2014                    
    2015                    $C$DW$95        .dwtag  DW_TAG_enumerator
    2016                            .dwattr $C$DW$95, DW_AT_name("Analog_Lbk")
    2017                            .dwattr $C$DW$95, DW_AT_const_value(0x01)
    2018                            .dwattr $C$DW$95, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2019                            .dwattr $C$DW$95, DW_AT_decl_line(0x4f)
    2020                            .dwattr $C$DW$95, DW_AT_decl_column(0x05)
    2021                    
    2022                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2023                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x4c)
    2024                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x0e)
    2025                            .dwendtag $C$DW$T$86
    2026                    
    2027                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    2028                            .dwattr $C$DW$T$87, DW_AT_name("loopBackType_t")
    2029                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2030                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2031                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2032                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x50)
    2033                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x02)
    2034                    
    2035                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   38

    2036                    $C$DW$T$88      .dwtag  DW_TAG_enumeration_type
    2037                            .dwattr $C$DW$T$88, DW_AT_name("systemInterrupt")
    2038                            .dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
    2039                    $C$DW$96        .dwtag  DW_TAG_enumerator
    2040                            .dwattr $C$DW$96, DW_AT_name("SYS_IRQ")
    2041                            .dwattr $C$DW$96, DW_AT_const_value(0x00)
    2042                            .dwattr $C$DW$96, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    2043                            .dwattr $C$DW$96, DW_AT_decl_line(0x4b)
    2044                            .dwattr $C$DW$96, DW_AT_decl_column(0x05)
    2045                    
    2046                    $C$DW$97        .dwtag  DW_TAG_enumerator
    2047                            .dwattr $C$DW$97, DW_AT_name("SYS_FIQ")
    2048                            .dwattr $C$DW$97, DW_AT_const_value(0x01)
    2049                            .dwattr $C$DW$97, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    2050                            .dwattr $C$DW$97, DW_AT_decl_line(0x4c)
    2051                            .dwattr $C$DW$97, DW_AT_decl_column(0x05)
    2052                    
    2053                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    2054                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x49)
    2055                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x0e)
    2056                            .dwendtag $C$DW$T$88
    2057                    
    2058                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    2059                            .dwattr $C$DW$T$89, DW_AT_name("systemInterrupt_t")
    2060                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    2061                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2062                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    2063                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x4d)
    2064                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x02)
    2065                    
    2066                    
    2067                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2068                            .dwattr $C$DW$T$26, DW_AT_name("vimBase")
    2069                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x1e0)
    2070                    $C$DW$98        .dwtag  DW_TAG_member
    2071                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$24)
    2072                            .dwattr $C$DW$98, DW_AT_name("rsvd1")
    2073                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("rsvd1")
    2074                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2075                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2076                            .dwattr $C$DW$98, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2077                            .dwattr $C$DW$98, DW_AT_decl_line(0x45)
    2078                            .dwattr $C$DW$98, DW_AT_decl_column(0x11)
    2079                    
    2080                    $C$DW$99        .dwtag  DW_TAG_member
    2081                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    2082                            .dwattr $C$DW$99, DW_AT_name("ECCSTAT")
    2083                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("ECCSTAT")
    2084                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2085                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2086                            .dwattr $C$DW$99, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2087                            .dwattr $C$DW$99, DW_AT_decl_line(0x46)
    2088                            .dwattr $C$DW$99, DW_AT_decl_column(0x11)
    2089                    
    2090                    $C$DW$100       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   39

    2091                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    2092                            .dwattr $C$DW$100, DW_AT_name("ECCCTL")
    2093                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("ECCCTL")
    2094                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2095                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2096                            .dwattr $C$DW$100, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2097                            .dwattr $C$DW$100, DW_AT_decl_line(0x47)
    2098                            .dwattr $C$DW$100, DW_AT_decl_column(0x11)
    2099                    
    2100                    $C$DW$101       .dwtag  DW_TAG_member
    2101                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    2102                            .dwattr $C$DW$101, DW_AT_name("UERRADDR")
    2103                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("UERRADDR")
    2104                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2105                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2106                            .dwattr $C$DW$101, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2107                            .dwattr $C$DW$101, DW_AT_decl_line(0x48)
    2108                            .dwattr $C$DW$101, DW_AT_decl_column(0x11)
    2109                    
    2110                    $C$DW$102       .dwtag  DW_TAG_member
    2111                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    2112                            .dwattr $C$DW$102, DW_AT_name("FBVECADDR")
    2113                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("FBVECADDR")
    2114                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    2115                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2116                            .dwattr $C$DW$102, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2117                            .dwattr $C$DW$102, DW_AT_decl_line(0x49)
    2118                            .dwattr $C$DW$102, DW_AT_decl_column(0x11)
    2119                    
    2120                    $C$DW$103       .dwtag  DW_TAG_member
    2121                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    2122                            .dwattr $C$DW$103, DW_AT_name("SBERRADDR")
    2123                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("SBERRADDR")
    2124                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2125                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2126                            .dwattr $C$DW$103, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2127                            .dwattr $C$DW$103, DW_AT_decl_line(0x4a)
    2128                            .dwattr $C$DW$103, DW_AT_decl_column(0x11)
    2129                    
    2130                    $C$DW$104       .dwtag  DW_TAG_member
    2131                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    2132                            .dwattr $C$DW$104, DW_AT_name("IRQINDEX")
    2133                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("IRQINDEX")
    2134                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2135                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2136                            .dwattr $C$DW$104, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2137                            .dwattr $C$DW$104, DW_AT_decl_line(0x4b)
    2138                            .dwattr $C$DW$104, DW_AT_decl_column(0x11)
    2139                    
    2140                    $C$DW$105       .dwtag  DW_TAG_member
    2141                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    2142                            .dwattr $C$DW$105, DW_AT_name("FIQINDEX")
    2143                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("FIQINDEX")
    2144                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2145                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   40

    2146                            .dwattr $C$DW$105, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2147                            .dwattr $C$DW$105, DW_AT_decl_line(0x4c)
    2148                            .dwattr $C$DW$105, DW_AT_decl_column(0x11)
    2149                    
    2150                    $C$DW$106       .dwtag  DW_TAG_member
    2151                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    2152                            .dwattr $C$DW$106, DW_AT_name("rsvd2")
    2153                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("rsvd2")
    2154                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    2155                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2156                            .dwattr $C$DW$106, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2157                            .dwattr $C$DW$106, DW_AT_decl_line(0x4d)
    2158                            .dwattr $C$DW$106, DW_AT_decl_column(0x11)
    2159                    
    2160                    $C$DW$107       .dwtag  DW_TAG_member
    2161                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    2162                            .dwattr $C$DW$107, DW_AT_name("rsvd3")
    2163                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd3")
    2164                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    2165                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2166                            .dwattr $C$DW$107, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2167                            .dwattr $C$DW$107, DW_AT_decl_line(0x4e)
    2168                            .dwattr $C$DW$107, DW_AT_decl_column(0x11)
    2169                    
    2170                    $C$DW$108       .dwtag  DW_TAG_member
    2171                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    2172                            .dwattr $C$DW$108, DW_AT_name("FIRQPR0")
    2173                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("FIRQPR0")
    2174                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2175                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2176                            .dwattr $C$DW$108, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2177                            .dwattr $C$DW$108, DW_AT_decl_line(0x4f)
    2178                            .dwattr $C$DW$108, DW_AT_decl_column(0x11)
    2179                    
    2180                    $C$DW$109       .dwtag  DW_TAG_member
    2181                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    2182                            .dwattr $C$DW$109, DW_AT_name("FIRQPR1")
    2183                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("FIRQPR1")
    2184                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2185                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2186                            .dwattr $C$DW$109, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2187                            .dwattr $C$DW$109, DW_AT_decl_line(0x50)
    2188                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    2189                    
    2190                    $C$DW$110       .dwtag  DW_TAG_member
    2191                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    2192                            .dwattr $C$DW$110, DW_AT_name("FIRQPR2")
    2193                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("FIRQPR2")
    2194                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2195                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2196                            .dwattr $C$DW$110, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2197                            .dwattr $C$DW$110, DW_AT_decl_line(0x51)
    2198                            .dwattr $C$DW$110, DW_AT_decl_column(0x11)
    2199                    
    2200                    $C$DW$111       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   41

    2201                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    2202                            .dwattr $C$DW$111, DW_AT_name("FIRQPR3")
    2203                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("FIRQPR3")
    2204                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    2205                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2206                            .dwattr $C$DW$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2207                            .dwattr $C$DW$111, DW_AT_decl_line(0x52)
    2208                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    2209                    
    2210                    $C$DW$112       .dwtag  DW_TAG_member
    2211                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    2212                            .dwattr $C$DW$112, DW_AT_name("INTREQ0")
    2213                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("INTREQ0")
    2214                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2215                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2216                            .dwattr $C$DW$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2217                            .dwattr $C$DW$112, DW_AT_decl_line(0x53)
    2218                            .dwattr $C$DW$112, DW_AT_decl_column(0x11)
    2219                    
    2220                    $C$DW$113       .dwtag  DW_TAG_member
    2221                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    2222                            .dwattr $C$DW$113, DW_AT_name("INTREQ1")
    2223                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("INTREQ1")
    2224                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    2225                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2226                            .dwattr $C$DW$113, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2227                            .dwattr $C$DW$113, DW_AT_decl_line(0x54)
    2228                            .dwattr $C$DW$113, DW_AT_decl_column(0x11)
    2229                    
    2230                    $C$DW$114       .dwtag  DW_TAG_member
    2231                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    2232                            .dwattr $C$DW$114, DW_AT_name("INTREQ2")
    2233                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("INTREQ2")
    2234                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    2235                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2236                            .dwattr $C$DW$114, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2237                            .dwattr $C$DW$114, DW_AT_decl_line(0x55)
    2238                            .dwattr $C$DW$114, DW_AT_decl_column(0x11)
    2239                    
    2240                    $C$DW$115       .dwtag  DW_TAG_member
    2241                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    2242                            .dwattr $C$DW$115, DW_AT_name("INTREQ3")
    2243                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("INTREQ3")
    2244                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    2245                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2246                            .dwattr $C$DW$115, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2247                            .dwattr $C$DW$115, DW_AT_decl_line(0x56)
    2248                            .dwattr $C$DW$115, DW_AT_decl_column(0x11)
    2249                    
    2250                    $C$DW$116       .dwtag  DW_TAG_member
    2251                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    2252                            .dwattr $C$DW$116, DW_AT_name("REQMASKSET0")
    2253                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("REQMASKSET0")
    2254                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    2255                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   42

    2256                            .dwattr $C$DW$116, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2257                            .dwattr $C$DW$116, DW_AT_decl_line(0x57)
    2258                            .dwattr $C$DW$116, DW_AT_decl_column(0x11)
    2259                    
    2260                    $C$DW$117       .dwtag  DW_TAG_member
    2261                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    2262                            .dwattr $C$DW$117, DW_AT_name("REQMASKSET1")
    2263                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("REQMASKSET1")
    2264                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    2265                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2266                            .dwattr $C$DW$117, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2267                            .dwattr $C$DW$117, DW_AT_decl_line(0x58)
    2268                            .dwattr $C$DW$117, DW_AT_decl_column(0x11)
    2269                    
    2270                    $C$DW$118       .dwtag  DW_TAG_member
    2271                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    2272                            .dwattr $C$DW$118, DW_AT_name("REQMASKSET2")
    2273                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("REQMASKSET2")
    2274                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    2275                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2276                            .dwattr $C$DW$118, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2277                            .dwattr $C$DW$118, DW_AT_decl_line(0x59)
    2278                            .dwattr $C$DW$118, DW_AT_decl_column(0x11)
    2279                    
    2280                    $C$DW$119       .dwtag  DW_TAG_member
    2281                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    2282                            .dwattr $C$DW$119, DW_AT_name("REQMASKSET3")
    2283                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("REQMASKSET3")
    2284                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    2285                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2286                            .dwattr $C$DW$119, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2287                            .dwattr $C$DW$119, DW_AT_decl_line(0x5a)
    2288                            .dwattr $C$DW$119, DW_AT_decl_column(0x11)
    2289                    
    2290                    $C$DW$120       .dwtag  DW_TAG_member
    2291                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    2292                            .dwattr $C$DW$120, DW_AT_name("REQMASKCLR0")
    2293                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("REQMASKCLR0")
    2294                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    2295                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2296                            .dwattr $C$DW$120, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2297                            .dwattr $C$DW$120, DW_AT_decl_line(0x5b)
    2298                            .dwattr $C$DW$120, DW_AT_decl_column(0x11)
    2299                    
    2300                    $C$DW$121       .dwtag  DW_TAG_member
    2301                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    2302                            .dwattr $C$DW$121, DW_AT_name("REQMASKCLR1")
    2303                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("REQMASKCLR1")
    2304                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    2305                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2306                            .dwattr $C$DW$121, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2307                            .dwattr $C$DW$121, DW_AT_decl_line(0x5c)
    2308                            .dwattr $C$DW$121, DW_AT_decl_column(0x11)
    2309                    
    2310                    $C$DW$122       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   43

    2311                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    2312                            .dwattr $C$DW$122, DW_AT_name("REQMASKCLR2")
    2313                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("REQMASKCLR2")
    2314                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    2315                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2316                            .dwattr $C$DW$122, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2317                            .dwattr $C$DW$122, DW_AT_decl_line(0x5d)
    2318                            .dwattr $C$DW$122, DW_AT_decl_column(0x11)
    2319                    
    2320                    $C$DW$123       .dwtag  DW_TAG_member
    2321                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    2322                            .dwattr $C$DW$123, DW_AT_name("REQMASKCLR3")
    2323                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("REQMASKCLR3")
    2324                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
    2325                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2326                            .dwattr $C$DW$123, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2327                            .dwattr $C$DW$123, DW_AT_decl_line(0x5e)
    2328                            .dwattr $C$DW$123, DW_AT_decl_column(0x11)
    2329                    
    2330                    $C$DW$124       .dwtag  DW_TAG_member
    2331                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    2332                            .dwattr $C$DW$124, DW_AT_name("WAKEMASKSET0")
    2333                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("WAKEMASKSET0")
    2334                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    2335                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2336                            .dwattr $C$DW$124, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2337                            .dwattr $C$DW$124, DW_AT_decl_line(0x5f)
    2338                            .dwattr $C$DW$124, DW_AT_decl_column(0x11)
    2339                    
    2340                    $C$DW$125       .dwtag  DW_TAG_member
    2341                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    2342                            .dwattr $C$DW$125, DW_AT_name("WAKEMASKSET1")
    2343                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("WAKEMASKSET1")
    2344                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
    2345                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2346                            .dwattr $C$DW$125, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2347                            .dwattr $C$DW$125, DW_AT_decl_line(0x60)
    2348                            .dwattr $C$DW$125, DW_AT_decl_column(0x11)
    2349                    
    2350                    $C$DW$126       .dwtag  DW_TAG_member
    2351                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    2352                            .dwattr $C$DW$126, DW_AT_name("WAKEMASKSET2")
    2353                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("WAKEMASKSET2")
    2354                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    2355                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2356                            .dwattr $C$DW$126, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2357                            .dwattr $C$DW$126, DW_AT_decl_line(0x61)
    2358                            .dwattr $C$DW$126, DW_AT_decl_column(0x11)
    2359                    
    2360                    $C$DW$127       .dwtag  DW_TAG_member
    2361                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    2362                            .dwattr $C$DW$127, DW_AT_name("WAKEMASKSET3")
    2363                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("WAKEMASKSET3")
    2364                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
    2365                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   44

    2366                            .dwattr $C$DW$127, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2367                            .dwattr $C$DW$127, DW_AT_decl_line(0x62)
    2368                            .dwattr $C$DW$127, DW_AT_decl_column(0x11)
    2369                    
    2370                    $C$DW$128       .dwtag  DW_TAG_member
    2371                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    2372                            .dwattr $C$DW$128, DW_AT_name("WAKEMASKCLR0")
    2373                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("WAKEMASKCLR0")
    2374                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
    2375                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2376                            .dwattr $C$DW$128, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2377                            .dwattr $C$DW$128, DW_AT_decl_line(0x63)
    2378                            .dwattr $C$DW$128, DW_AT_decl_column(0x11)
    2379                    
    2380                    $C$DW$129       .dwtag  DW_TAG_member
    2381                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    2382                            .dwattr $C$DW$129, DW_AT_name("WAKEMASKCLR1")
    2383                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("WAKEMASKCLR1")
    2384                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    2385                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2386                            .dwattr $C$DW$129, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2387                            .dwattr $C$DW$129, DW_AT_decl_line(0x64)
    2388                            .dwattr $C$DW$129, DW_AT_decl_column(0x11)
    2389                    
    2390                    $C$DW$130       .dwtag  DW_TAG_member
    2391                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    2392                            .dwattr $C$DW$130, DW_AT_name("WAKEMASKCLR2")
    2393                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("WAKEMASKCLR2")
    2394                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    2395                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2396                            .dwattr $C$DW$130, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2397                            .dwattr $C$DW$130, DW_AT_decl_line(0x65)
    2398                            .dwattr $C$DW$130, DW_AT_decl_column(0x11)
    2399                    
    2400                    $C$DW$131       .dwtag  DW_TAG_member
    2401                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    2402                            .dwattr $C$DW$131, DW_AT_name("WAKEMASKCLR3")
    2403                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("WAKEMASKCLR3")
    2404                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
    2405                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2406                            .dwattr $C$DW$131, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2407                            .dwattr $C$DW$131, DW_AT_decl_line(0x66)
    2408                            .dwattr $C$DW$131, DW_AT_decl_column(0x11)
    2409                    
    2410                    $C$DW$132       .dwtag  DW_TAG_member
    2411                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    2412                            .dwattr $C$DW$132, DW_AT_name("IRQVECREG")
    2413                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("IRQVECREG")
    2414                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    2415                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2416                            .dwattr $C$DW$132, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2417                            .dwattr $C$DW$132, DW_AT_decl_line(0x67)
    2418                            .dwattr $C$DW$132, DW_AT_decl_column(0x11)
    2419                    
    2420                    $C$DW$133       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   45

    2421                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    2422                            .dwattr $C$DW$133, DW_AT_name("FIQVECREG")
    2423                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("FIQVECREG")
    2424                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
    2425                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2426                            .dwattr $C$DW$133, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2427                            .dwattr $C$DW$133, DW_AT_decl_line(0x68)
    2428                            .dwattr $C$DW$133, DW_AT_decl_column(0x11)
    2429                    
    2430                    $C$DW$134       .dwtag  DW_TAG_member
    2431                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    2432                            .dwattr $C$DW$134, DW_AT_name("CAPEVT")
    2433                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("CAPEVT")
    2434                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    2435                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2436                            .dwattr $C$DW$134, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2437                            .dwattr $C$DW$134, DW_AT_decl_line(0x69)
    2438                            .dwattr $C$DW$134, DW_AT_decl_column(0x11)
    2439                    
    2440                    $C$DW$135       .dwtag  DW_TAG_member
    2441                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    2442                            .dwattr $C$DW$135, DW_AT_name("rsvd4")
    2443                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd4")
    2444                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
    2445                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2446                            .dwattr $C$DW$135, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2447                            .dwattr $C$DW$135, DW_AT_decl_line(0x6a)
    2448                            .dwattr $C$DW$135, DW_AT_decl_column(0x11)
    2449                    
    2450                    $C$DW$136       .dwtag  DW_TAG_member
    2451                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$25)
    2452                            .dwattr $C$DW$136, DW_AT_name("CHANCTRL")
    2453                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("CHANCTRL")
    2454                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    2455                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2456                            .dwattr $C$DW$136, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2457                            .dwattr $C$DW$136, DW_AT_decl_line(0x6b)
    2458                            .dwattr $C$DW$136, DW_AT_decl_column(0x11)
    2459                    
    2460                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2461                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x43)
    2462                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x19)
    2463                            .dwendtag $C$DW$T$26
    2464                    
    2465                    $C$DW$T$90      .dwtag  DW_TAG_volatile_type
    2466                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$26)
    2467                    
    2468                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    2469                            .dwattr $C$DW$T$91, DW_AT_name("vimBASE_t")
    2470                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    2471                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2472                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2473                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x6c)
    2474                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    2475                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   46

    2476                    
    2477                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2478                            .dwattr $C$DW$T$27, DW_AT_name("vim_config_reg")
    2479                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x94)
    2480                    $C$DW$137       .dwtag  DW_TAG_member
    2481                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    2482                            .dwattr $C$DW$137, DW_AT_name("CONFIG_FIRQPR0")
    2483                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("CONFIG_FIRQPR0")
    2484                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2485                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2486                            .dwattr $C$DW$137, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2487                            .dwattr $C$DW$137, DW_AT_decl_line(0x73)
    2488                            .dwattr $C$DW$137, DW_AT_decl_column(0x0c)
    2489                    
    2490                    $C$DW$138       .dwtag  DW_TAG_member
    2491                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    2492                            .dwattr $C$DW$138, DW_AT_name("CONFIG_FIRQPR1")
    2493                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("CONFIG_FIRQPR1")
    2494                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2495                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2496                            .dwattr $C$DW$138, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2497                            .dwattr $C$DW$138, DW_AT_decl_line(0x74)
    2498                            .dwattr $C$DW$138, DW_AT_decl_column(0x0c)
    2499                    
    2500                    $C$DW$139       .dwtag  DW_TAG_member
    2501                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    2502                            .dwattr $C$DW$139, DW_AT_name("CONFIG_FIRQPR2")
    2503                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("CONFIG_FIRQPR2")
    2504                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2505                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2506                            .dwattr $C$DW$139, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2507                            .dwattr $C$DW$139, DW_AT_decl_line(0x75)
    2508                            .dwattr $C$DW$139, DW_AT_decl_column(0x0c)
    2509                    
    2510                    $C$DW$140       .dwtag  DW_TAG_member
    2511                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    2512                            .dwattr $C$DW$140, DW_AT_name("CONFIG_FIRQPR3")
    2513                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("CONFIG_FIRQPR3")
    2514                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2515                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2516                            .dwattr $C$DW$140, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2517                            .dwattr $C$DW$140, DW_AT_decl_line(0x76)
    2518                            .dwattr $C$DW$140, DW_AT_decl_column(0x0c)
    2519                    
    2520                    $C$DW$141       .dwtag  DW_TAG_member
    2521                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    2522                            .dwattr $C$DW$141, DW_AT_name("CONFIG_REQMASKSET0")
    2523                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("CONFIG_REQMASKSET0")
    2524                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2525                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2526                            .dwattr $C$DW$141, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2527                            .dwattr $C$DW$141, DW_AT_decl_line(0x77)
    2528                            .dwattr $C$DW$141, DW_AT_decl_column(0x0c)
    2529                    
    2530                    $C$DW$142       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   47

    2531                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    2532                            .dwattr $C$DW$142, DW_AT_name("CONFIG_REQMASKSET1")
    2533                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("CONFIG_REQMASKSET1")
    2534                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2535                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2536                            .dwattr $C$DW$142, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2537                            .dwattr $C$DW$142, DW_AT_decl_line(0x78)
    2538                            .dwattr $C$DW$142, DW_AT_decl_column(0x0c)
    2539                    
    2540                    $C$DW$143       .dwtag  DW_TAG_member
    2541                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    2542                            .dwattr $C$DW$143, DW_AT_name("CONFIG_REQMASKSET2")
    2543                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("CONFIG_REQMASKSET2")
    2544                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2545                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2546                            .dwattr $C$DW$143, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2547                            .dwattr $C$DW$143, DW_AT_decl_line(0x79)
    2548                            .dwattr $C$DW$143, DW_AT_decl_column(0x0c)
    2549                    
    2550                    $C$DW$144       .dwtag  DW_TAG_member
    2551                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    2552                            .dwattr $C$DW$144, DW_AT_name("CONFIG_REQMASKSET3")
    2553                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("CONFIG_REQMASKSET3")
    2554                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2555                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2556                            .dwattr $C$DW$144, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2557                            .dwattr $C$DW$144, DW_AT_decl_line(0x7a)
    2558                            .dwattr $C$DW$144, DW_AT_decl_column(0x0c)
    2559                    
    2560                    $C$DW$145       .dwtag  DW_TAG_member
    2561                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    2562                            .dwattr $C$DW$145, DW_AT_name("CONFIG_WAKEMASKSET0")
    2563                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("CONFIG_WAKEMASKSET0")
    2564                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2565                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2566                            .dwattr $C$DW$145, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2567                            .dwattr $C$DW$145, DW_AT_decl_line(0x7b)
    2568                            .dwattr $C$DW$145, DW_AT_decl_column(0x0c)
    2569                    
    2570                    $C$DW$146       .dwtag  DW_TAG_member
    2571                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    2572                            .dwattr $C$DW$146, DW_AT_name("CONFIG_WAKEMASKSET1")
    2573                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("CONFIG_WAKEMASKSET1")
    2574                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2575                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2576                            .dwattr $C$DW$146, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2577                            .dwattr $C$DW$146, DW_AT_decl_line(0x7c)
    2578                            .dwattr $C$DW$146, DW_AT_decl_column(0x0c)
    2579                    
    2580                    $C$DW$147       .dwtag  DW_TAG_member
    2581                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    2582                            .dwattr $C$DW$147, DW_AT_name("CONFIG_WAKEMASKSET2")
    2583                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("CONFIG_WAKEMASKSET2")
    2584                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2585                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   48

    2586                            .dwattr $C$DW$147, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2587                            .dwattr $C$DW$147, DW_AT_decl_line(0x7d)
    2588                            .dwattr $C$DW$147, DW_AT_decl_column(0x0c)
    2589                    
    2590                    $C$DW$148       .dwtag  DW_TAG_member
    2591                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    2592                            .dwattr $C$DW$148, DW_AT_name("CONFIG_WAKEMASKSET3")
    2593                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("CONFIG_WAKEMASKSET3")
    2594                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2595                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2596                            .dwattr $C$DW$148, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2597                            .dwattr $C$DW$148, DW_AT_decl_line(0x7e)
    2598                            .dwattr $C$DW$148, DW_AT_decl_column(0x0c)
    2599                    
    2600                    $C$DW$149       .dwtag  DW_TAG_member
    2601                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    2602                            .dwattr $C$DW$149, DW_AT_name("CONFIG_CAPEVT")
    2603                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("CONFIG_CAPEVT")
    2604                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2605                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2606                            .dwattr $C$DW$149, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2607                            .dwattr $C$DW$149, DW_AT_decl_line(0x7f)
    2608                            .dwattr $C$DW$149, DW_AT_decl_column(0x0c)
    2609                    
    2610                    $C$DW$150       .dwtag  DW_TAG_member
    2611                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$25)
    2612                            .dwattr $C$DW$150, DW_AT_name("CONFIG_CHANCTRL")
    2613                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("CONFIG_CHANCTRL")
    2614                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2615                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2616                            .dwattr $C$DW$150, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    2617                            .dwattr $C$DW$150, DW_AT_decl_line(0x80)
    2618                            .dwattr $C$DW$150, DW_AT_decl_column(0x0c)
    2619                    
    2620                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    2621                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x71)
    2622                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2623                            .dwendtag $C$DW$T$27
    2624                    
    2625                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    2626                            .dwattr $C$DW$T$92, DW_AT_name("vim_config_reg_t")
    2627                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$27)
    2628                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2629                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    2630                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x81)
    2631                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    2632                    
    2633                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2634                    
    2635                    ;***************************************************************
    2636                    ;* DWARF CIE ENTRIES                                           *
    2637                    ;***************************************************************
    2638                    
    2639                    $C$DW$CIE       .dwcie 14
    2640                            .dwcfi  cfa_register, 13
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:09 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0703210                              PAGE   49

    2641                            .dwcfi  cfa_offset, 0
    2642                            .dwcfi  same_value, 4
    2643                            .dwcfi  same_value, 5
    2644                            .dwcfi  same_value, 6
    2645                            .dwcfi  same_value, 7
    2646                            .dwcfi  same_value, 8
    2647                            .dwcfi  same_value, 9
    2648                            .dwcfi  same_value, 10
    2649                            .dwcfi  same_value, 11
    2650                            .dwcfi  same_value, 80
    2651                            .dwcfi  same_value, 81
    2652                            .dwcfi  same_value, 82
    2653                            .dwcfi  same_value, 83
    2654                            .dwcfi  same_value, 84
    2655                            .dwcfi  same_value, 85
    2656                            .dwcfi  same_value, 86
    2657                            .dwcfi  same_value, 87
    2658                            .dwcfi  same_value, 88
    2659                            .dwcfi  same_value, 89
    2660                            .dwcfi  same_value, 90
    2661                            .dwcfi  same_value, 91
    2662                            .dwcfi  same_value, 92
    2663                            .dwcfi  same_value, 93
    2664                            .dwcfi  same_value, 94
    2665                            .dwcfi  same_value, 95
    2666                            .dwendentry
    2667                            .dwendtag $C$DW$CU
    2668                    

No Assembly Errors, No Assembly Warnings
