TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1148010                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 13:27:09 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_pinmux.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    ;       C:\ti\ccsv7\tools\compiler\ti-cgt-arm_16.9.0.LTS\bin\armacpia.exe -@C:\\Users\\bob\\AppData\\L

    1365                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1366                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x40)
    1367                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x11)
    1368                    
    1369                    
    1370                    $C$DW$T$70      .dwtag  DW_TAG_enumeration_type
    1371                            .dwattr $C$DW$T$70, DW_AT_name("config_value_type")
    1372                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x01)
    1373                    $C$DW$8 .dwtag  DW_TAG_enumerator
    1374                            .dwattr $C$DW$8, DW_AT_name("InitialValue")
    1375                            .dwattr $C$DW$8, DW_AT_const_value(0x00)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1148010                              PAGE   26

    1376                            .dwattr $C$DW$8, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
    1377                            .dwattr $C$DW$8, DW_AT_decl_line(0x5c)
    1378                            .dwattr $C$DW$8, DW_AT_decl_column(0x02)
    1379                    
    1380                    $C$DW$9 .dwtag  DW_TAG_enumerator
    1381                            .dwattr $C$DW$9, DW_AT_name("CurrentValue")
    1382                            .dwattr $C$DW$9, DW_AT_const_value(0x01)
    1383                            .dwattr $C$DW$9, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
    1384                            .dwattr $C$DW$9, DW_AT_decl_line(0x5d)
    1385                            .dwattr $C$DW$9, DW_AT_decl_column(0x02)
    1386                    
    1387                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1388                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x5a)
    1389                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x0e)
    1390                            .dwendtag $C$DW$T$70
    1391                    
    1392                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    1393                            .dwattr $C$DW$T$71, DW_AT_name("config_value_type_t")
    1394                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    1395                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1396                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1397                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x5e)
    1398                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x02)
    1399                    
    1400                    
    1401                    $C$DW$T$72      .dwtag  DW_TAG_enumeration_type
    1402                            .dwattr $C$DW$T$72, DW_AT_name("loopBackType")
    1403                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x01)
    1404                    $C$DW$10        .dwtag  DW_TAG_enumerator
    1405                            .dwattr $C$DW$10, DW_AT_name("Digital_Lbk")
    1406                            .dwattr $C$DW$10, DW_AT_const_value(0x00)
    1407                            .dwattr $C$DW$10, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1408                            .dwattr $C$DW$10, DW_AT_decl_line(0x4e)
    1409                            .dwattr $C$DW$10, DW_AT_decl_column(0x05)
    1410                    
    1411                    $C$DW$11        .dwtag  DW_TAG_enumerator
    1412                            .dwattr $C$DW$11, DW_AT_name("Analog_Lbk")
    1413                            .dwattr $C$DW$11, DW_AT_const_value(0x01)
    1414                            .dwattr $C$DW$11, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1415                            .dwattr $C$DW$11, DW_AT_decl_line(0x4f)
    1416                            .dwattr $C$DW$11, DW_AT_decl_column(0x05)
    1417                    
    1418                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1419                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x4c)
    1420                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x0e)
    1421                            .dwendtag $C$DW$T$72
    1422                    
    1423                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    1424                            .dwattr $C$DW$T$73, DW_AT_name("loopBackType_t")
    1425                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1426                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1427                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1428                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x50)
    1429                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x02)
    1430                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1148010                              PAGE   27

    1431                    
    1432                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1433                            .dwattr $C$DW$T$26, DW_AT_name("pinMuxBase")
    1434                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x3e0)
    1435                    $C$DW$12        .dwtag  DW_TAG_member
    1436                            .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
    1437                            .dwattr $C$DW$12, DW_AT_name("REVISION_REG")
    1438                            .dwattr $C$DW$12, DW_AT_TI_symbol_name("REVISION_REG")
    1439                            .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                            .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
    1441                            .dwattr $C$DW$12, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1442                            .dwattr $C$DW$12, DW_AT_decl_line(0x46)
    1443                            .dwattr $C$DW$12, DW_AT_decl_column(0x0c)
    1444                    
    1445                    $C$DW$13        .dwtag  DW_TAG_member
    1446                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$21)
    1447                            .dwattr $C$DW$13, DW_AT_name("rsvd1")
    1448                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("rsvd1")
    1449                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1450                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
    1451                            .dwattr $C$DW$13, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1452                            .dwattr $C$DW$13, DW_AT_decl_line(0x47)
    1453                            .dwattr $C$DW$13, DW_AT_decl_column(0x09)
    1454                    
    1455                    $C$DW$14        .dwtag  DW_TAG_member
    1456                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
    1457                            .dwattr $C$DW$14, DW_AT_name("BOOT_REG")
    1458                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("BOOT_REG")
    1459                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1460                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
    1461                            .dwattr $C$DW$14, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1462                            .dwattr $C$DW$14, DW_AT_decl_line(0x48)
    1463                            .dwattr $C$DW$14, DW_AT_decl_column(0x09)
    1464                    
    1465                    $C$DW$15        .dwtag  DW_TAG_member
    1466                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$22)
    1467                            .dwattr $C$DW$15, DW_AT_name("rsvd2")
    1468                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("rsvd2")
    1469                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1470                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
    1471                            .dwattr $C$DW$15, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1472                            .dwattr $C$DW$15, DW_AT_decl_line(0x49)
    1473                            .dwattr $C$DW$15, DW_AT_decl_column(0x09)
    1474                    
    1475                    $C$DW$16        .dwtag  DW_TAG_member
    1476                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
    1477                            .dwattr $C$DW$16, DW_AT_name("KICKER0")
    1478                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("KICKER0")
    1479                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1480                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
    1481                            .dwattr $C$DW$16, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1482                            .dwattr $C$DW$16, DW_AT_decl_line(0x4a)
    1483                            .dwattr $C$DW$16, DW_AT_decl_column(0x09)
    1484                    
    1485                    $C$DW$17        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1148010                              PAGE   28

    1486                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$20)
    1487                            .dwattr $C$DW$17, DW_AT_name("KICKER1")
    1488                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("KICKER1")
    1489                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1490                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
    1491                            .dwattr $C$DW$17, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1492                            .dwattr $C$DW$17, DW_AT_decl_line(0x4b)
    1493                            .dwattr $C$DW$17, DW_AT_decl_column(0x09)
    1494                    
    1495                    $C$DW$18        .dwtag  DW_TAG_member
    1496                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$23)
    1497                            .dwattr $C$DW$18, DW_AT_name("rsvd3")
    1498                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("rsvd3")
    1499                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1500                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
    1501                            .dwattr $C$DW$18, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1502                            .dwattr $C$DW$18, DW_AT_decl_line(0x4c)
    1503                            .dwattr $C$DW$18, DW_AT_decl_column(0x09)
    1504                    
    1505                    $C$DW$19        .dwtag  DW_TAG_member
    1506                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
    1507                            .dwattr $C$DW$19, DW_AT_name("ERR_RAW_STATUS_REG")
    1508                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("ERR_RAW_STATUS_REG")
    1509                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1510                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
    1511                            .dwattr $C$DW$19, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1512                            .dwattr $C$DW$19, DW_AT_decl_line(0x4d)
    1513                            .dwattr $C$DW$19, DW_AT_decl_column(0x09)
    1514                    
    1515                    $C$DW$20        .dwtag  DW_TAG_member
    1516                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
    1517                            .dwattr $C$DW$20, DW_AT_name("ERR_ENABLED_STATUS_REG")
    1518                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("ERR_ENABLED_STATUS_REG")
    1519                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    1520                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
    1521                            .dwattr $C$DW$20, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1522                            .dwattr $C$DW$20, DW_AT_decl_line(0x4e)
    1523                            .dwattr $C$DW$20, DW_AT_decl_column(0x09)
    1524                    
    1525                    $C$DW$21        .dwtag  DW_TAG_member
    1526                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$20)
    1527                            .dwattr $C$DW$21, DW_AT_name("ERR_ENABLE_REG")
    1528                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("ERR_ENABLE_REG")
    1529                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1530                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
    1531                            .dwattr $C$DW$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1532                            .dwattr $C$DW$21, DW_AT_decl_line(0x4f)
    1533                            .dwattr $C$DW$21, DW_AT_decl_column(0x09)
    1534                    
    1535                    $C$DW$22        .dwtag  DW_TAG_member
    1536                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
    1537                            .dwattr $C$DW$22, DW_AT_name("ERR_ENABLE_CLR_REG")
    1538                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("ERR_ENABLE_CLR_REG")
    1539                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1540                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1148010                              PAGE   29

    1541                            .dwattr $C$DW$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1542                            .dwattr $C$DW$22, DW_AT_decl_line(0x50)
    1543                            .dwattr $C$DW$22, DW_AT_decl_column(0x09)
    1544                    
    1545                    $C$DW$23        .dwtag  DW_TAG_member
    1546                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
    1547                            .dwattr $C$DW$23, DW_AT_name("rsvd4")
    1548                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("rsvd4")
    1549                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1550                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
    1551                            .dwattr $C$DW$23, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1552                            .dwattr $C$DW$23, DW_AT_decl_line(0x51)
    1553                            .dwattr $C$DW$23, DW_AT_decl_column(0x09)
    1554                    
    1555                    $C$DW$24        .dwtag  DW_TAG_member
    1556                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
    1557                            .dwattr $C$DW$24, DW_AT_name("FAULT_ADDRESS_REG")
    1558                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("FAULT_ADDRESS_REG")
    1559                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1560                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
    1561                            .dwattr $C$DW$24, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1562                            .dwattr $C$DW$24, DW_AT_decl_line(0x52)
    1563                            .dwattr $C$DW$24, DW_AT_decl_column(0x09)
    1564                    
    1565                    $C$DW$25        .dwtag  DW_TAG_member
    1566                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
    1567                            .dwattr $C$DW$25, DW_AT_name("FAULT_STATUS_REG")
    1568                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("FAULT_STATUS_REG")
    1569                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1570                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
    1571                            .dwattr $C$DW$25, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1572                            .dwattr $C$DW$25, DW_AT_decl_line(0x53)
    1573                            .dwattr $C$DW$25, DW_AT_decl_column(0x09)
    1574                    
    1575                    $C$DW$26        .dwtag  DW_TAG_member
    1576                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
    1577                            .dwattr $C$DW$26, DW_AT_name("FAULT_CLEAR_REG")
    1578                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("FAULT_CLEAR_REG")
    1579                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    1580                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
    1581                            .dwattr $C$DW$26, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1582                            .dwattr $C$DW$26, DW_AT_decl_line(0x54)
    1583                            .dwattr $C$DW$26, DW_AT_decl_column(0x09)
    1584                    
    1585                    $C$DW$27        .dwtag  DW_TAG_member
    1586                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$24)
    1587                            .dwattr $C$DW$27, DW_AT_name("rsvd5")
    1588                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("rsvd5")
    1589                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1590                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
    1591                            .dwattr $C$DW$27, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1592                            .dwattr $C$DW$27, DW_AT_decl_line(0x55)
    1593                            .dwattr $C$DW$27, DW_AT_decl_column(0x09)
    1594                    
    1595                    $C$DW$28        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1148010                              PAGE   30

    1596                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$25)
    1597                            .dwattr $C$DW$28, DW_AT_name("PINMUX")
    1598                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("PINMUX")
    1599                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1600                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
    1601                            .dwattr $C$DW$28, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1602                            .dwattr $C$DW$28, DW_AT_decl_line(0x56)
    1603                            .dwattr $C$DW$28, DW_AT_decl_column(0x09)
    1604                    
    1605                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1606                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x44)
    1607                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x19)
    1608                            .dwendtag $C$DW$T$26
    1609                    
    1610                    $C$DW$T$74      .dwtag  DW_TAG_volatile_type
    1611                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$26)
    1612                    
    1613                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    1614                            .dwattr $C$DW$T$75, DW_AT_name("pinMuxBASE_t")
    1615                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    1616                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1617                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1618                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x59)
    1619                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x02)
    1620                    
    1621                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1622                    
    1623                    ;***************************************************************
    1624                    ;* DWARF CIE ENTRIES                                           *
    1625                    ;***************************************************************
    1626                    
    1627                    $C$DW$CIE       .dwcie 14
    1628                            .dwcfi  cfa_register, 13
    1629                            .dwcfi  cfa_offset, 0
    1630                            .dwcfi  same_value, 4
    1631                            .dwcfi  same_value, 5
    1632                            .dwcfi  same_value, 6
    1633                            .dwcfi  same_value, 7
    1634                            .dwcfi  same_value, 8
    1635                            .dwcfi  same_value, 9
    1636                            .dwcfi  same_value, 10
    1637                            .dwcfi  same_value, 11
    1638                            .dwcfi  same_value, 80
    1639                            .dwcfi  same_value, 81
    1640                            .dwcfi  same_value, 82
    1641                            .dwcfi  same_value, 83
    1642                            .dwcfi  same_value, 84
    1643                            .dwcfi  same_value, 85
    1644                            .dwcfi  same_value, 86
    1645                            .dwcfi  same_value, 87
    1646                            .dwcfi  same_value, 88
    1647                            .dwcfi  same_value, 89
    1648                            .dwcfi  same_value, 90
    1649                            .dwcfi  same_value, 91
    1650                            .dwcfi  same_value, 92
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1148010                              PAGE   31

    1651                            .dwcfi  same_value, 93
    1652                            .dwcfi  same_value, 94
    1653                            .dwcfi  same_value, 95
    1654                            .dwendentry
    1655                            .dwendtag $C$DW$CU
    1656                    

