TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Sun Feb 19 22:01:17 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_sys_vim.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   48

    2586                    $C$DW$T$109     .dwtag  DW_TAG_typedef
    2587                            .dwattr $C$DW$T$109, DW_AT_name("uint_least64_t")
    2588                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$106)
    2589                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2590                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    2591                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x41)
    2592                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x16)
    2593                    
    2594                    $C$DW$T$110     .dwtag  DW_TAG_typedef
    2595                            .dwattr $C$DW$T$110, DW_AT_name("uintmax_t")
    2596                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$15)
    2597                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    2598                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    2599                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x57)
    2600                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x20)
    2601                    
    2602                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    2603                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2604                            .dwattr $C$DW$T$16, DW_AT_name("float")
    2605                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    2606                    
    2607                    $C$DW$T$111     .dwtag  DW_TAG_typedef
    2608                            .dwattr $C$DW$T$111, DW_AT_name("float32")
    2609                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$16)
    2610                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    2611                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2612                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x6d)
    2613                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x0f)
    2614                    
    2615                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    2616                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2617                            .dwattr $C$DW$T$17, DW_AT_name("double")
    2618                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    2619                    
    2620                    $C$DW$T$112     .dwtag  DW_TAG_typedef
    2621                            .dwattr $C$DW$T$112, DW_AT_name("float64")
    2622                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$17)
    2623                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    2624                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2625                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x72)
    2626                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x10)
    2627                    
    2628                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    2629                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2630                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    2631                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    2632                    
    2633                    $C$DW$T$113     .dwtag  DW_TAG_base_type
    2634                            .dwattr $C$DW$T$113, DW_AT_encoding(DW_ATE_unsigned_char)
    2635                            .dwattr $C$DW$T$113, DW_AT_name("unsigned char")
    2636                            .dwattr $C$DW$T$113, DW_AT_byte_size(0x01)
    2637                    
    2638                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    2639                            .dwattr $C$DW$T$114, DW_AT_name("boolean")
    2640                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   49

    2641                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2642                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2643                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x53)
    2644                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x0f)
    2645                    
    2646                    $C$DW$T$115     .dwtag  DW_TAG_typedef
    2647                            .dwattr $C$DW$T$115, DW_AT_name("tBoolean")
    2648                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    2649                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    2650                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2651                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x40)
    2652                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x11)
    2653                    
    2654                    
    2655                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2656                            .dwattr $C$DW$T$21, DW_AT_name("ccmr5Base")
    2657                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x28)
    2658                    $C$DW$76        .dwtag  DW_TAG_member
    2659                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    2660                            .dwattr $C$DW$76, DW_AT_name("CCMSR1")
    2661                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("CCMSR1")
    2662                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2663                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    2664                            .dwattr $C$DW$76, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2665                            .dwattr $C$DW$76, DW_AT_decl_line(0x45)
    2666                            .dwattr $C$DW$76, DW_AT_decl_column(0x0c)
    2667                    
    2668                    $C$DW$77        .dwtag  DW_TAG_member
    2669                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
    2670                            .dwattr $C$DW$77, DW_AT_name("CCMKEYR1")
    2671                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("CCMKEYR1")
    2672                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2673                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    2674                            .dwattr $C$DW$77, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2675                            .dwattr $C$DW$77, DW_AT_decl_line(0x46)
    2676                            .dwattr $C$DW$77, DW_AT_decl_column(0x0c)
    2677                    
    2678                    $C$DW$78        .dwtag  DW_TAG_member
    2679                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    2680                            .dwattr $C$DW$78, DW_AT_name("CCMSR2")
    2681                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("CCMSR2")
    2682                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2683                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    2684                            .dwattr $C$DW$78, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2685                            .dwattr $C$DW$78, DW_AT_decl_line(0x47)
    2686                            .dwattr $C$DW$78, DW_AT_decl_column(0x0c)
    2687                    
    2688                    $C$DW$79        .dwtag  DW_TAG_member
    2689                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    2690                            .dwattr $C$DW$79, DW_AT_name("CCMKEYR2")
    2691                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("CCMKEYR2")
    2692                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2693                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    2694                            .dwattr $C$DW$79, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2695                            .dwattr $C$DW$79, DW_AT_decl_line(0x48)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   50

    2696                            .dwattr $C$DW$79, DW_AT_decl_column(0x0c)
    2697                    
    2698                    $C$DW$80        .dwtag  DW_TAG_member
    2699                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    2700                            .dwattr $C$DW$80, DW_AT_name("CCMSR3")
    2701                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("CCMSR3")
    2702                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2703                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    2704                            .dwattr $C$DW$80, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2705                            .dwattr $C$DW$80, DW_AT_decl_line(0x49)
    2706                            .dwattr $C$DW$80, DW_AT_decl_column(0x0c)
    2707                    
    2708                    $C$DW$81        .dwtag  DW_TAG_member
    2709                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    2710                            .dwattr $C$DW$81, DW_AT_name("CCMKEYR3")
    2711                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("CCMKEYR3")
    2712                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2713                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    2714                            .dwattr $C$DW$81, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2715                            .dwattr $C$DW$81, DW_AT_decl_line(0x4a)
    2716                            .dwattr $C$DW$81, DW_AT_decl_column(0x0c)
    2717                    
    2718                    $C$DW$82        .dwtag  DW_TAG_member
    2719                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    2720                            .dwattr $C$DW$82, DW_AT_name("CCMPOLCNTRL")
    2721                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("CCMPOLCNTRL")
    2722                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2723                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    2724                            .dwattr $C$DW$82, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2725                            .dwattr $C$DW$82, DW_AT_decl_line(0x4b)
    2726                            .dwattr $C$DW$82, DW_AT_decl_column(0x0c)
    2727                    
    2728                    $C$DW$83        .dwtag  DW_TAG_member
    2729                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    2730                            .dwattr $C$DW$83, DW_AT_name("CCMSR4")
    2731                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("CCMSR4")
    2732                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2733                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2734                            .dwattr $C$DW$83, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2735                            .dwattr $C$DW$83, DW_AT_decl_line(0x4c)
    2736                            .dwattr $C$DW$83, DW_AT_decl_column(0x0c)
    2737                    
    2738                    $C$DW$84        .dwtag  DW_TAG_member
    2739                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    2740                            .dwattr $C$DW$84, DW_AT_name("CCMKEYR4")
    2741                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("CCMKEYR4")
    2742                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2743                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2744                            .dwattr $C$DW$84, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2745                            .dwattr $C$DW$84, DW_AT_decl_line(0x4d)
    2746                            .dwattr $C$DW$84, DW_AT_decl_column(0x0c)
    2747                    
    2748                    $C$DW$85        .dwtag  DW_TAG_member
    2749                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    2750                            .dwattr $C$DW$85, DW_AT_name("CCMPDSTAT0")
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   51

    2751                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("CCMPDSTAT0")
    2752                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2753                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2754                            .dwattr $C$DW$85, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2755                            .dwattr $C$DW$85, DW_AT_decl_line(0x4e)
    2756                            .dwattr $C$DW$85, DW_AT_decl_column(0x0c)
    2757                    
    2758                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2759                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x43)
    2760                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x19)
    2761                            .dwendtag $C$DW$T$21
    2762                    
    2763                    $C$DW$T$116     .dwtag  DW_TAG_volatile_type
    2764                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$21)
    2765                    
    2766                    $C$DW$T$117     .dwtag  DW_TAG_typedef
    2767                            .dwattr $C$DW$T$117, DW_AT_name("ccmr5BASE_t")
    2768                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    2769                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    2770                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2771                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x4f)
    2772                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x03)
    2773                    
    2774                    
    2775                    $C$DW$T$69      .dwtag  DW_TAG_enumeration_type
    2776                            .dwattr $C$DW$T$69, DW_AT_name("config_value_type")
    2777                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x01)
    2778                    $C$DW$86        .dwtag  DW_TAG_enumerator
    2779                            .dwattr $C$DW$86, DW_AT_name("InitialValue")
    2780                            .dwattr $C$DW$86, DW_AT_const_value(0x00)
    2781                            .dwattr $C$DW$86, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2782                            .dwattr $C$DW$86, DW_AT_decl_line(0x5c)
    2783                            .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    2784                    
    2785                    $C$DW$87        .dwtag  DW_TAG_enumerator
    2786                            .dwattr $C$DW$87, DW_AT_name("CurrentValue")
    2787                            .dwattr $C$DW$87, DW_AT_const_value(0x01)
    2788                            .dwattr $C$DW$87, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2789                            .dwattr $C$DW$87, DW_AT_decl_line(0x5d)
    2790                            .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    2791                    
    2792                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2793                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x5a)
    2794                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2795                            .dwendtag $C$DW$T$69
    2796                    
    2797                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    2798                            .dwattr $C$DW$T$70, DW_AT_name("config_value_type_t")
    2799                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2800                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2801                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2802                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x5e)
    2803                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    2804                    
    2805                    
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   52

    2806                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2807                            .dwattr $C$DW$T$24, DW_AT_name("esmBase")
    2808                            .dwattr $C$DW$T$24, DW_AT_byte_size(0xa4)
    2809                    $C$DW$88        .dwtag  DW_TAG_member
    2810                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    2811                            .dwattr $C$DW$88, DW_AT_name("EEPAPR1")
    2812                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("EEPAPR1")
    2813                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2814                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2815                            .dwattr $C$DW$88, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2816                            .dwattr $C$DW$88, DW_AT_decl_line(0x48)
    2817                            .dwattr $C$DW$88, DW_AT_decl_column(0x0c)
    2818                    
    2819                    $C$DW$89        .dwtag  DW_TAG_member
    2820                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    2821                            .dwattr $C$DW$89, DW_AT_name("DEPAPR1")
    2822                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("DEPAPR1")
    2823                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2824                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2825                            .dwattr $C$DW$89, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2826                            .dwattr $C$DW$89, DW_AT_decl_line(0x49)
    2827                            .dwattr $C$DW$89, DW_AT_decl_column(0x0c)
    2828                    
    2829                    $C$DW$90        .dwtag  DW_TAG_member
    2830                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    2831                            .dwattr $C$DW$90, DW_AT_name("IESR1")
    2832                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("IESR1")
    2833                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2834                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2835                            .dwattr $C$DW$90, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2836                            .dwattr $C$DW$90, DW_AT_decl_line(0x4a)
    2837                            .dwattr $C$DW$90, DW_AT_decl_column(0x0c)
    2838                    
    2839                    $C$DW$91        .dwtag  DW_TAG_member
    2840                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    2841                            .dwattr $C$DW$91, DW_AT_name("IECR1")
    2842                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("IECR1")
    2843                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2844                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2845                            .dwattr $C$DW$91, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2846                            .dwattr $C$DW$91, DW_AT_decl_line(0x4b)
    2847                            .dwattr $C$DW$91, DW_AT_decl_column(0x0c)
    2848                    
    2849                    $C$DW$92        .dwtag  DW_TAG_member
    2850                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    2851                            .dwattr $C$DW$92, DW_AT_name("ILSR1")
    2852                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("ILSR1")
    2853                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2854                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2855                            .dwattr $C$DW$92, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2856                            .dwattr $C$DW$92, DW_AT_decl_line(0x4c)
    2857                            .dwattr $C$DW$92, DW_AT_decl_column(0x0c)
    2858                    
    2859                    $C$DW$93        .dwtag  DW_TAG_member
    2860                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   53

    2861                            .dwattr $C$DW$93, DW_AT_name("ILCR1")
    2862                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("ILCR1")
    2863                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2864                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2865                            .dwattr $C$DW$93, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2866                            .dwattr $C$DW$93, DW_AT_decl_line(0x4d)
    2867                            .dwattr $C$DW$93, DW_AT_decl_column(0x0c)
    2868                    
    2869                    $C$DW$94        .dwtag  DW_TAG_member
    2870                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$22)
    2871                            .dwattr $C$DW$94, DW_AT_name("SR1")
    2872                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("SR1")
    2873                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2874                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2875                            .dwattr $C$DW$94, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2876                            .dwattr $C$DW$94, DW_AT_decl_line(0x4e)
    2877                            .dwattr $C$DW$94, DW_AT_decl_column(0x0c)
    2878                    
    2879                    $C$DW$95        .dwtag  DW_TAG_member
    2880                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    2881                            .dwattr $C$DW$95, DW_AT_name("EPSR")
    2882                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("EPSR")
    2883                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2884                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2885                            .dwattr $C$DW$95, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2886                            .dwattr $C$DW$95, DW_AT_decl_line(0x4f)
    2887                            .dwattr $C$DW$95, DW_AT_decl_column(0x0c)
    2888                    
    2889                    $C$DW$96        .dwtag  DW_TAG_member
    2890                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    2891                            .dwattr $C$DW$96, DW_AT_name("IOFFHR")
    2892                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("IOFFHR")
    2893                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2894                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2895                            .dwattr $C$DW$96, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2896                            .dwattr $C$DW$96, DW_AT_decl_line(0x50)
    2897                            .dwattr $C$DW$96, DW_AT_decl_column(0x0c)
    2898                    
    2899                    $C$DW$97        .dwtag  DW_TAG_member
    2900                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    2901                            .dwattr $C$DW$97, DW_AT_name("IOFFLR")
    2902                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("IOFFLR")
    2903                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2904                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2905                            .dwattr $C$DW$97, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2906                            .dwattr $C$DW$97, DW_AT_decl_line(0x51)
    2907                            .dwattr $C$DW$97, DW_AT_decl_column(0x0c)
    2908                    
    2909                    $C$DW$98        .dwtag  DW_TAG_member
    2910                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    2911                            .dwattr $C$DW$98, DW_AT_name("LTCR")
    2912                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("LTCR")
    2913                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2914                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2915                            .dwattr $C$DW$98, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   54

    2916                            .dwattr $C$DW$98, DW_AT_decl_line(0x52)
    2917                            .dwattr $C$DW$98, DW_AT_decl_column(0x0c)
    2918                    
    2919                    $C$DW$99        .dwtag  DW_TAG_member
    2920                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    2921                            .dwattr $C$DW$99, DW_AT_name("LTCPR")
    2922                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("LTCPR")
    2923                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2924                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2925                            .dwattr $C$DW$99, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2926                            .dwattr $C$DW$99, DW_AT_decl_line(0x53)
    2927                            .dwattr $C$DW$99, DW_AT_decl_column(0x0c)
    2928                    
    2929                    $C$DW$100       .dwtag  DW_TAG_member
    2930                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    2931                            .dwattr $C$DW$100, DW_AT_name("EKR")
    2932                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("EKR")
    2933                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2934                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2935                            .dwattr $C$DW$100, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2936                            .dwattr $C$DW$100, DW_AT_decl_line(0x54)
    2937                            .dwattr $C$DW$100, DW_AT_decl_column(0x0c)
    2938                    
    2939                    $C$DW$101       .dwtag  DW_TAG_member
    2940                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    2941                            .dwattr $C$DW$101, DW_AT_name("SSR2")
    2942                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("SSR2")
    2943                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2944                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2945                            .dwattr $C$DW$101, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2946                            .dwattr $C$DW$101, DW_AT_decl_line(0x55)
    2947                            .dwattr $C$DW$101, DW_AT_decl_column(0x0c)
    2948                    
    2949                    $C$DW$102       .dwtag  DW_TAG_member
    2950                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    2951                            .dwattr $C$DW$102, DW_AT_name("IEPSR4")
    2952                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("IEPSR4")
    2953                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2954                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2955                            .dwattr $C$DW$102, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2956                            .dwattr $C$DW$102, DW_AT_decl_line(0x56)
    2957                            .dwattr $C$DW$102, DW_AT_decl_column(0x0c)
    2958                    
    2959                    $C$DW$103       .dwtag  DW_TAG_member
    2960                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    2961                            .dwattr $C$DW$103, DW_AT_name("IEPCR4")
    2962                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("IEPCR4")
    2963                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2964                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2965                            .dwattr $C$DW$103, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2966                            .dwattr $C$DW$103, DW_AT_decl_line(0x57)
    2967                            .dwattr $C$DW$103, DW_AT_decl_column(0x0c)
    2968                    
    2969                    $C$DW$104       .dwtag  DW_TAG_member
    2970                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   55

    2971                            .dwattr $C$DW$104, DW_AT_name("IESR4")
    2972                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("IESR4")
    2973                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2974                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2975                            .dwattr $C$DW$104, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2976                            .dwattr $C$DW$104, DW_AT_decl_line(0x58)
    2977                            .dwattr $C$DW$104, DW_AT_decl_column(0x0c)
    2978                    
    2979                    $C$DW$105       .dwtag  DW_TAG_member
    2980                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    2981                            .dwattr $C$DW$105, DW_AT_name("IECR4")
    2982                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("IECR4")
    2983                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2984                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2985                            .dwattr $C$DW$105, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2986                            .dwattr $C$DW$105, DW_AT_decl_line(0x59)
    2987                            .dwattr $C$DW$105, DW_AT_decl_column(0x0c)
    2988                    
    2989                    $C$DW$106       .dwtag  DW_TAG_member
    2990                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    2991                            .dwattr $C$DW$106, DW_AT_name("ILSR4")
    2992                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("ILSR4")
    2993                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2994                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2995                            .dwattr $C$DW$106, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2996                            .dwattr $C$DW$106, DW_AT_decl_line(0x5a)
    2997                            .dwattr $C$DW$106, DW_AT_decl_column(0x0c)
    2998                    
    2999                    $C$DW$107       .dwtag  DW_TAG_member
    3000                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    3001                            .dwattr $C$DW$107, DW_AT_name("ILCR4")
    3002                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("ILCR4")
    3003                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3004                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    3005                            .dwattr $C$DW$107, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3006                            .dwattr $C$DW$107, DW_AT_decl_line(0x5b)
    3007                            .dwattr $C$DW$107, DW_AT_decl_column(0x0c)
    3008                    
    3009                    $C$DW$108       .dwtag  DW_TAG_member
    3010                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$22)
    3011                            .dwattr $C$DW$108, DW_AT_name("SR4")
    3012                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("SR4")
    3013                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3014                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    3015                            .dwattr $C$DW$108, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3016                            .dwattr $C$DW$108, DW_AT_decl_line(0x5c)
    3017                            .dwattr $C$DW$108, DW_AT_decl_column(0x0c)
    3018                    
    3019                    $C$DW$109       .dwtag  DW_TAG_member
    3020                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$23)
    3021                            .dwattr $C$DW$109, DW_AT_name("rsvd1")
    3022                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd1")
    3023                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3024                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    3025                            .dwattr $C$DW$109, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   56

    3026                            .dwattr $C$DW$109, DW_AT_decl_line(0x5d)
    3027                            .dwattr $C$DW$109, DW_AT_decl_column(0x0c)
    3028                    
    3029                    $C$DW$110       .dwtag  DW_TAG_member
    3030                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    3031                            .dwattr $C$DW$110, DW_AT_name("IEPSR7")
    3032                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("IEPSR7")
    3033                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3034                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    3035                            .dwattr $C$DW$110, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3036                            .dwattr $C$DW$110, DW_AT_decl_line(0x5e)
    3037                            .dwattr $C$DW$110, DW_AT_decl_column(0x0c)
    3038                    
    3039                    $C$DW$111       .dwtag  DW_TAG_member
    3040                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    3041                            .dwattr $C$DW$111, DW_AT_name("IEPCR7")
    3042                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("IEPCR7")
    3043                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3044                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    3045                            .dwattr $C$DW$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3046                            .dwattr $C$DW$111, DW_AT_decl_line(0x5f)
    3047                            .dwattr $C$DW$111, DW_AT_decl_column(0x0c)
    3048                    
    3049                    $C$DW$112       .dwtag  DW_TAG_member
    3050                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    3051                            .dwattr $C$DW$112, DW_AT_name("IESR7")
    3052                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("IESR7")
    3053                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3054                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    3055                            .dwattr $C$DW$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3056                            .dwattr $C$DW$112, DW_AT_decl_line(0x60)
    3057                            .dwattr $C$DW$112, DW_AT_decl_column(0x0c)
    3058                    
    3059                    $C$DW$113       .dwtag  DW_TAG_member
    3060                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    3061                            .dwattr $C$DW$113, DW_AT_name("IECR7")
    3062                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("IECR7")
    3063                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    3064                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    3065                            .dwattr $C$DW$113, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3066                            .dwattr $C$DW$113, DW_AT_decl_line(0x61)
    3067                            .dwattr $C$DW$113, DW_AT_decl_column(0x0c)
    3068                    
    3069                    $C$DW$114       .dwtag  DW_TAG_member
    3070                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    3071                            .dwattr $C$DW$114, DW_AT_name("ILSR7")
    3072                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("ILSR7")
    3073                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3074                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    3075                            .dwattr $C$DW$114, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3076                            .dwattr $C$DW$114, DW_AT_decl_line(0x62)
    3077                            .dwattr $C$DW$114, DW_AT_decl_column(0x0c)
    3078                    
    3079                    $C$DW$115       .dwtag  DW_TAG_member
    3080                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   57

    3081                            .dwattr $C$DW$115, DW_AT_name("ILCR7")
    3082                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("ILCR7")
    3083                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    3084                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    3085                            .dwattr $C$DW$115, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3086                            .dwattr $C$DW$115, DW_AT_decl_line(0x63)
    3087                            .dwattr $C$DW$115, DW_AT_decl_column(0x0c)
    3088                    
    3089                    $C$DW$116       .dwtag  DW_TAG_member
    3090                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$22)
    3091                            .dwattr $C$DW$116, DW_AT_name("SR7")
    3092                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("SR7")
    3093                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    3094                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    3095                            .dwattr $C$DW$116, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3096                            .dwattr $C$DW$116, DW_AT_decl_line(0x64)
    3097                            .dwattr $C$DW$116, DW_AT_decl_column(0x0c)
    3098                    
    3099                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3100                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x46)
    3101                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x19)
    3102                            .dwendtag $C$DW$T$24
    3103                    
    3104                    $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    3105                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$24)
    3106                    
    3107                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    3108                            .dwattr $C$DW$T$58, DW_AT_name("esmBASE_t")
    3109                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3110                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3111                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3112                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x65)
    3113                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    3114                    
    3115                    $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    3116                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3117                            .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    3118                    
    3119                    
    3120                    $C$DW$T$118     .dwtag  DW_TAG_enumeration_type
    3121                            .dwattr $C$DW$T$118, DW_AT_name("esmSelfTestFlag")
    3122                            .dwattr $C$DW$T$118, DW_AT_byte_size(0x01)
    3123                    $C$DW$117       .dwtag  DW_TAG_enumerator
    3124                            .dwattr $C$DW$117, DW_AT_name("esmSelfTest_Passed")
    3125                            .dwattr $C$DW$117, DW_AT_const_value(0x00)
    3126                            .dwattr $C$DW$117, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3127                            .dwattr $C$DW$117, DW_AT_decl_line(0x3c2)
    3128                            .dwattr $C$DW$117, DW_AT_decl_column(0x05)
    3129                    
    3130                    $C$DW$118       .dwtag  DW_TAG_enumerator
    3131                            .dwattr $C$DW$118, DW_AT_name("esmSelfTest_Active")
    3132                            .dwattr $C$DW$118, DW_AT_const_value(0x01)
    3133                            .dwattr $C$DW$118, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3134                            .dwattr $C$DW$118, DW_AT_decl_line(0x3c3)
    3135                            .dwattr $C$DW$118, DW_AT_decl_column(0x05)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   58

    3136                    
    3137                    $C$DW$119       .dwtag  DW_TAG_enumerator
    3138                            .dwattr $C$DW$119, DW_AT_name("esmSelfTest_NotStarted")
    3139                            .dwattr $C$DW$119, DW_AT_const_value(0x02)
    3140                            .dwattr $C$DW$119, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3141                            .dwattr $C$DW$119, DW_AT_decl_line(0x3c4)
    3142                            .dwattr $C$DW$119, DW_AT_decl_column(0x05)
    3143                    
    3144                    $C$DW$120       .dwtag  DW_TAG_enumerator
    3145                            .dwattr $C$DW$120, DW_AT_name("esmSelfTest_Failed")
    3146                            .dwattr $C$DW$120, DW_AT_const_value(0x03)
    3147                            .dwattr $C$DW$120, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3148                            .dwattr $C$DW$120, DW_AT_decl_line(0x3c5)
    3149                            .dwattr $C$DW$120, DW_AT_decl_column(0x05)
    3150                    
    3151                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3152                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x3c0)
    3153                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x0e)
    3154                            .dwendtag $C$DW$T$118
    3155                    
    3156                    $C$DW$T$119     .dwtag  DW_TAG_typedef
    3157                            .dwattr $C$DW$T$119, DW_AT_name("esmSelfTestFlag_t")
    3158                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    3159                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3160                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3161                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x3c6)
    3162                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x02)
    3163                    
    3164                    
    3165                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3166                            .dwattr $C$DW$T$25, DW_AT_name("esm_config_reg")
    3167                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x2c)
    3168                    $C$DW$121       .dwtag  DW_TAG_member
    3169                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    3170                            .dwattr $C$DW$121, DW_AT_name("CONFIG_EEPAPR1")
    3171                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("CONFIG_EEPAPR1")
    3172                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3173                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    3174                            .dwattr $C$DW$121, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3175                            .dwattr $C$DW$121, DW_AT_decl_line(0x3cb)
    3176                            .dwattr $C$DW$121, DW_AT_decl_column(0x0c)
    3177                    
    3178                    $C$DW$122       .dwtag  DW_TAG_member
    3179                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    3180                            .dwattr $C$DW$122, DW_AT_name("CONFIG_IESR1")
    3181                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("CONFIG_IESR1")
    3182                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3183                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    3184                            .dwattr $C$DW$122, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3185                            .dwattr $C$DW$122, DW_AT_decl_line(0x3cc)
    3186                            .dwattr $C$DW$122, DW_AT_decl_column(0x0c)
    3187                    
    3188                    $C$DW$123       .dwtag  DW_TAG_member
    3189                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    3190                            .dwattr $C$DW$123, DW_AT_name("CONFIG_ILSR1")
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   59

    3191                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("CONFIG_ILSR1")
    3192                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3193                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    3194                            .dwattr $C$DW$123, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3195                            .dwattr $C$DW$123, DW_AT_decl_line(0x3cd)
    3196                            .dwattr $C$DW$123, DW_AT_decl_column(0x0c)
    3197                    
    3198                    $C$DW$124       .dwtag  DW_TAG_member
    3199                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    3200                            .dwattr $C$DW$124, DW_AT_name("CONFIG_LTCPR")
    3201                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("CONFIG_LTCPR")
    3202                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3203                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    3204                            .dwattr $C$DW$124, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3205                            .dwattr $C$DW$124, DW_AT_decl_line(0x3ce)
    3206                            .dwattr $C$DW$124, DW_AT_decl_column(0x0c)
    3207                    
    3208                    $C$DW$125       .dwtag  DW_TAG_member
    3209                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    3210                            .dwattr $C$DW$125, DW_AT_name("CONFIG_EKR")
    3211                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("CONFIG_EKR")
    3212                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3213                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    3214                            .dwattr $C$DW$125, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3215                            .dwattr $C$DW$125, DW_AT_decl_line(0x3cf)
    3216                            .dwattr $C$DW$125, DW_AT_decl_column(0x0c)
    3217                    
    3218                    $C$DW$126       .dwtag  DW_TAG_member
    3219                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    3220                            .dwattr $C$DW$126, DW_AT_name("CONFIG_IEPSR4")
    3221                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("CONFIG_IEPSR4")
    3222                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3223                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    3224                            .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3225                            .dwattr $C$DW$126, DW_AT_decl_line(0x3d0)
    3226                            .dwattr $C$DW$126, DW_AT_decl_column(0x0c)
    3227                    
    3228                    $C$DW$127       .dwtag  DW_TAG_member
    3229                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    3230                            .dwattr $C$DW$127, DW_AT_name("CONFIG_IESR4")
    3231                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("CONFIG_IESR4")
    3232                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3233                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    3234                            .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3235                            .dwattr $C$DW$127, DW_AT_decl_line(0x3d1)
    3236                            .dwattr $C$DW$127, DW_AT_decl_column(0x0c)
    3237                    
    3238                    $C$DW$128       .dwtag  DW_TAG_member
    3239                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    3240                            .dwattr $C$DW$128, DW_AT_name("CONFIG_ILSR4")
    3241                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("CONFIG_ILSR4")
    3242                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3243                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    3244                            .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3245                            .dwattr $C$DW$128, DW_AT_decl_line(0x3d2)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   60

    3246                            .dwattr $C$DW$128, DW_AT_decl_column(0x0c)
    3247                    
    3248                    $C$DW$129       .dwtag  DW_TAG_member
    3249                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    3250                            .dwattr $C$DW$129, DW_AT_name("CONFIG_IEPSR7")
    3251                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("CONFIG_IEPSR7")
    3252                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3253                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    3254                            .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3255                            .dwattr $C$DW$129, DW_AT_decl_line(0x3d3)
    3256                            .dwattr $C$DW$129, DW_AT_decl_column(0x0c)
    3257                    
    3258                    $C$DW$130       .dwtag  DW_TAG_member
    3259                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    3260                            .dwattr $C$DW$130, DW_AT_name("CONFIG_IESR7")
    3261                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("CONFIG_IESR7")
    3262                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3263                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    3264                            .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3265                            .dwattr $C$DW$130, DW_AT_decl_line(0x3d4)
    3266                            .dwattr $C$DW$130, DW_AT_decl_column(0x0c)
    3267                    
    3268                    $C$DW$131       .dwtag  DW_TAG_member
    3269                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    3270                            .dwattr $C$DW$131, DW_AT_name("CONFIG_ILSR7")
    3271                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("CONFIG_ILSR7")
    3272                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3273                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    3274                            .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3275                            .dwattr $C$DW$131, DW_AT_decl_line(0x3d5)
    3276                            .dwattr $C$DW$131, DW_AT_decl_column(0x0c)
    3277                    
    3278                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3279                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x3c9)
    3280                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3281                            .dwendtag $C$DW$T$25
    3282                    
    3283                    $C$DW$T$120     .dwtag  DW_TAG_typedef
    3284                            .dwattr $C$DW$T$120, DW_AT_name("esm_config_reg_t")
    3285                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$25)
    3286                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3287                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3288                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x3d6)
    3289                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x03)
    3290                    
    3291                    
    3292                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3293                            .dwattr $C$DW$T$30, DW_AT_name("flashWBase")
    3294                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x410)
    3295                    $C$DW$132       .dwtag  DW_TAG_member
    3296                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    3297                            .dwattr $C$DW$132, DW_AT_name("FRDCNTL")
    3298                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("FRDCNTL")
    3299                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3300                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   61

    3301                            .dwattr $C$DW$132, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3302                            .dwattr $C$DW$132, DW_AT_decl_line(0x48)
    3303                            .dwattr $C$DW$132, DW_AT_decl_column(0x0c)
    3304                    
    3305                    $C$DW$133       .dwtag  DW_TAG_member
    3306                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    3307                            .dwattr $C$DW$133, DW_AT_name("rsvd1")
    3308                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("rsvd1")
    3309                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3310                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    3311                            .dwattr $C$DW$133, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3312                            .dwattr $C$DW$133, DW_AT_decl_line(0x49)
    3313                            .dwattr $C$DW$133, DW_AT_decl_column(0x0c)
    3314                    
    3315                    $C$DW$134       .dwtag  DW_TAG_member
    3316                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    3317                            .dwattr $C$DW$134, DW_AT_name("EE_FEDACCTRL1")
    3318                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("EE_FEDACCTRL1")
    3319                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3320                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    3321                            .dwattr $C$DW$134, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3322                            .dwattr $C$DW$134, DW_AT_decl_line(0x4a)
    3323                            .dwattr $C$DW$134, DW_AT_decl_column(0x0c)
    3324                    
    3325                    $C$DW$135       .dwtag  DW_TAG_member
    3326                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    3327                            .dwattr $C$DW$135, DW_AT_name("rsvd2")
    3328                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd2")
    3329                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3330                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    3331                            .dwattr $C$DW$135, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3332                            .dwattr $C$DW$135, DW_AT_decl_line(0x4b)
    3333                            .dwattr $C$DW$135, DW_AT_decl_column(0x0c)
    3334                    
    3335                    $C$DW$136       .dwtag  DW_TAG_member
    3336                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    3337                            .dwattr $C$DW$136, DW_AT_name("rsvd3")
    3338                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("rsvd3")
    3339                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3340                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    3341                            .dwattr $C$DW$136, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3342                            .dwattr $C$DW$136, DW_AT_decl_line(0x4c)
    3343                            .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    3344                    
    3345                    $C$DW$137       .dwtag  DW_TAG_member
    3346                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    3347                            .dwattr $C$DW$137, DW_AT_name("FEDAC_PASTATUS")
    3348                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("FEDAC_PASTATUS")
    3349                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3350                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    3351                            .dwattr $C$DW$137, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3352                            .dwattr $C$DW$137, DW_AT_decl_line(0x4d)
    3353                            .dwattr $C$DW$137, DW_AT_decl_column(0x0c)
    3354                    
    3355                    $C$DW$138       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   62

    3356                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    3357                            .dwattr $C$DW$138, DW_AT_name("FEDAC_PBSTATUS")
    3358                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("FEDAC_PBSTATUS")
    3359                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3360                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    3361                            .dwattr $C$DW$138, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3362                            .dwattr $C$DW$138, DW_AT_decl_line(0x4e)
    3363                            .dwattr $C$DW$138, DW_AT_decl_column(0x0c)
    3364                    
    3365                    $C$DW$139       .dwtag  DW_TAG_member
    3366                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    3367                            .dwattr $C$DW$139, DW_AT_name("FEDAC_GBLSTATUS")
    3368                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("FEDAC_GBLSTATUS")
    3369                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3370                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    3371                            .dwattr $C$DW$139, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3372                            .dwattr $C$DW$139, DW_AT_decl_line(0x4f)
    3373                            .dwattr $C$DW$139, DW_AT_decl_column(0x0c)
    3374                    
    3375                    $C$DW$140       .dwtag  DW_TAG_member
    3376                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    3377                            .dwattr $C$DW$140, DW_AT_name("rsvd4")
    3378                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("rsvd4")
    3379                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3380                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    3381                            .dwattr $C$DW$140, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3382                            .dwattr $C$DW$140, DW_AT_decl_line(0x50)
    3383                            .dwattr $C$DW$140, DW_AT_decl_column(0x0c)
    3384                    
    3385                    $C$DW$141       .dwtag  DW_TAG_member
    3386                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    3387                            .dwattr $C$DW$141, DW_AT_name("FEDACSDIS")
    3388                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("FEDACSDIS")
    3389                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3390                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    3391                            .dwattr $C$DW$141, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3392                            .dwattr $C$DW$141, DW_AT_decl_line(0x51)
    3393                            .dwattr $C$DW$141, DW_AT_decl_column(0x0c)
    3394                    
    3395                    $C$DW$142       .dwtag  DW_TAG_member
    3396                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    3397                            .dwattr $C$DW$142, DW_AT_name("FPRIM_ADD_TAG")
    3398                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("FPRIM_ADD_TAG")
    3399                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3400                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    3401                            .dwattr $C$DW$142, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3402                            .dwattr $C$DW$142, DW_AT_decl_line(0x52)
    3403                            .dwattr $C$DW$142, DW_AT_decl_column(0x0c)
    3404                    
    3405                    $C$DW$143       .dwtag  DW_TAG_member
    3406                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    3407                            .dwattr $C$DW$143, DW_AT_name("FDUP_ADD_TAG")
    3408                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("FDUP_ADD_TAG")
    3409                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3410                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   63

    3411                            .dwattr $C$DW$143, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3412                            .dwattr $C$DW$143, DW_AT_decl_line(0x53)
    3413                            .dwattr $C$DW$143, DW_AT_decl_column(0x0c)
    3414                    
    3415                    $C$DW$144       .dwtag  DW_TAG_member
    3416                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    3417                            .dwattr $C$DW$144, DW_AT_name("FBPROT")
    3418                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("FBPROT")
    3419                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3420                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    3421                            .dwattr $C$DW$144, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3422                            .dwattr $C$DW$144, DW_AT_decl_line(0x54)
    3423                            .dwattr $C$DW$144, DW_AT_decl_column(0x0c)
    3424                    
    3425                    $C$DW$145       .dwtag  DW_TAG_member
    3426                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    3427                            .dwattr $C$DW$145, DW_AT_name("FBSE")
    3428                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("FBSE")
    3429                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3430                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    3431                            .dwattr $C$DW$145, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3432                            .dwattr $C$DW$145, DW_AT_decl_line(0x55)
    3433                            .dwattr $C$DW$145, DW_AT_decl_column(0x0c)
    3434                    
    3435                    $C$DW$146       .dwtag  DW_TAG_member
    3436                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    3437                            .dwattr $C$DW$146, DW_AT_name("FBBUSY")
    3438                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("FBBUSY")
    3439                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3440                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    3441                            .dwattr $C$DW$146, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3442                            .dwattr $C$DW$146, DW_AT_decl_line(0x56)
    3443                            .dwattr $C$DW$146, DW_AT_decl_column(0x0c)
    3444                    
    3445                    $C$DW$147       .dwtag  DW_TAG_member
    3446                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    3447                            .dwattr $C$DW$147, DW_AT_name("FBAC")
    3448                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("FBAC")
    3449                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3450                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3451                            .dwattr $C$DW$147, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3452                            .dwattr $C$DW$147, DW_AT_decl_line(0x57)
    3453                            .dwattr $C$DW$147, DW_AT_decl_column(0x0c)
    3454                    
    3455                    $C$DW$148       .dwtag  DW_TAG_member
    3456                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    3457                            .dwattr $C$DW$148, DW_AT_name("FBPWRMODE")
    3458                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("FBPWRMODE")
    3459                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3460                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3461                            .dwattr $C$DW$148, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3462                            .dwattr $C$DW$148, DW_AT_decl_line(0x58)
    3463                            .dwattr $C$DW$148, DW_AT_decl_column(0x0c)
    3464                    
    3465                    $C$DW$149       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   64

    3466                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    3467                            .dwattr $C$DW$149, DW_AT_name("FBPRDY")
    3468                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("FBPRDY")
    3469                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3470                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3471                            .dwattr $C$DW$149, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3472                            .dwattr $C$DW$149, DW_AT_decl_line(0x59)
    3473                            .dwattr $C$DW$149, DW_AT_decl_column(0x0c)
    3474                    
    3475                    $C$DW$150       .dwtag  DW_TAG_member
    3476                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    3477                            .dwattr $C$DW$150, DW_AT_name("FPAC1")
    3478                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("FPAC1")
    3479                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3480                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3481                            .dwattr $C$DW$150, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3482                            .dwattr $C$DW$150, DW_AT_decl_line(0x5a)
    3483                            .dwattr $C$DW$150, DW_AT_decl_column(0x0c)
    3484                    
    3485                    $C$DW$151       .dwtag  DW_TAG_member
    3486                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    3487                            .dwattr $C$DW$151, DW_AT_name("rsvd5")
    3488                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("rsvd5")
    3489                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3490                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3491                            .dwattr $C$DW$151, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3492                            .dwattr $C$DW$151, DW_AT_decl_line(0x5b)
    3493                            .dwattr $C$DW$151, DW_AT_decl_column(0x0c)
    3494                    
    3495                    $C$DW$152       .dwtag  DW_TAG_member
    3496                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    3497                            .dwattr $C$DW$152, DW_AT_name("FMAC")
    3498                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("FMAC")
    3499                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3500                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3501                            .dwattr $C$DW$152, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3502                            .dwattr $C$DW$152, DW_AT_decl_line(0x5c)
    3503                            .dwattr $C$DW$152, DW_AT_decl_column(0x0c)
    3504                    
    3505                    $C$DW$153       .dwtag  DW_TAG_member
    3506                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    3507                            .dwattr $C$DW$153, DW_AT_name("FMSTAT")
    3508                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("FMSTAT")
    3509                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3510                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3511                            .dwattr $C$DW$153, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3512                            .dwattr $C$DW$153, DW_AT_decl_line(0x5d)
    3513                            .dwattr $C$DW$153, DW_AT_decl_column(0x0c)
    3514                    
    3515                    $C$DW$154       .dwtag  DW_TAG_member
    3516                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    3517                            .dwattr $C$DW$154, DW_AT_name("FEMU_DMSW")
    3518                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("FEMU_DMSW")
    3519                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3520                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   65

    3521                            .dwattr $C$DW$154, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3522                            .dwattr $C$DW$154, DW_AT_decl_line(0x5e)
    3523                            .dwattr $C$DW$154, DW_AT_decl_column(0x0c)
    3524                    
    3525                    $C$DW$155       .dwtag  DW_TAG_member
    3526                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    3527                            .dwattr $C$DW$155, DW_AT_name("FEMU_DLSW")
    3528                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("FEMU_DLSW")
    3529                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3530                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3531                            .dwattr $C$DW$155, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3532                            .dwattr $C$DW$155, DW_AT_decl_line(0x5f)
    3533                            .dwattr $C$DW$155, DW_AT_decl_column(0x0c)
    3534                    
    3535                    $C$DW$156       .dwtag  DW_TAG_member
    3536                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    3537                            .dwattr $C$DW$156, DW_AT_name("FEMU_ECC")
    3538                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("FEMU_ECC")
    3539                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3540                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3541                            .dwattr $C$DW$156, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3542                            .dwattr $C$DW$156, DW_AT_decl_line(0x60)
    3543                            .dwattr $C$DW$156, DW_AT_decl_column(0x0c)
    3544                    
    3545                    $C$DW$157       .dwtag  DW_TAG_member
    3546                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    3547                            .dwattr $C$DW$157, DW_AT_name("FLOCK")
    3548                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("FLOCK")
    3549                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3550                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3551                            .dwattr $C$DW$157, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3552                            .dwattr $C$DW$157, DW_AT_decl_line(0x61)
    3553                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    3554                    
    3555                    $C$DW$158       .dwtag  DW_TAG_member
    3556                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    3557                            .dwattr $C$DW$158, DW_AT_name("rsvd6")
    3558                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("rsvd6")
    3559                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3560                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3561                            .dwattr $C$DW$158, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3562                            .dwattr $C$DW$158, DW_AT_decl_line(0x62)
    3563                            .dwattr $C$DW$158, DW_AT_decl_column(0x0c)
    3564                    
    3565                    $C$DW$159       .dwtag  DW_TAG_member
    3566                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    3567                            .dwattr $C$DW$159, DW_AT_name("FDIAGCTRL")
    3568                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("FDIAGCTRL")
    3569                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3570                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3571                            .dwattr $C$DW$159, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3572                            .dwattr $C$DW$159, DW_AT_decl_line(0x63)
    3573                            .dwattr $C$DW$159, DW_AT_decl_column(0x0c)
    3574                    
    3575                    $C$DW$160       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   66

    3576                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    3577                            .dwattr $C$DW$160, DW_AT_name("rsvd7")
    3578                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("rsvd7")
    3579                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    3580                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3581                            .dwattr $C$DW$160, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3582                            .dwattr $C$DW$160, DW_AT_decl_line(0x64)
    3583                            .dwattr $C$DW$160, DW_AT_decl_column(0x0c)
    3584                    
    3585                    $C$DW$161       .dwtag  DW_TAG_member
    3586                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    3587                            .dwattr $C$DW$161, DW_AT_name("FRAW_ADDR")
    3588                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("FRAW_ADDR")
    3589                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3590                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3591                            .dwattr $C$DW$161, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3592                            .dwattr $C$DW$161, DW_AT_decl_line(0x65)
    3593                            .dwattr $C$DW$161, DW_AT_decl_column(0x0c)
    3594                    
    3595                    $C$DW$162       .dwtag  DW_TAG_member
    3596                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    3597                            .dwattr $C$DW$162, DW_AT_name("rsvd8")
    3598                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("rsvd8")
    3599                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3600                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3601                            .dwattr $C$DW$162, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3602                            .dwattr $C$DW$162, DW_AT_decl_line(0x66)
    3603                            .dwattr $C$DW$162, DW_AT_decl_column(0x0c)
    3604                    
    3605                    $C$DW$163       .dwtag  DW_TAG_member
    3606                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    3607                            .dwattr $C$DW$163, DW_AT_name("FPAR_OVR")
    3608                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("FPAR_OVR")
    3609                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    3610                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3611                            .dwattr $C$DW$163, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3612                            .dwattr $C$DW$163, DW_AT_decl_line(0x67)
    3613                            .dwattr $C$DW$163, DW_AT_decl_column(0x0c)
    3614                    
    3615                    $C$DW$164       .dwtag  DW_TAG_member
    3616                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$26)
    3617                            .dwattr $C$DW$164, DW_AT_name("rsvd9")
    3618                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd9")
    3619                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3620                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3621                            .dwattr $C$DW$164, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3622                            .dwattr $C$DW$164, DW_AT_decl_line(0x68)
    3623                            .dwattr $C$DW$164, DW_AT_decl_column(0x0c)
    3624                    
    3625                    $C$DW$165       .dwtag  DW_TAG_member
    3626                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    3627                            .dwattr $C$DW$165, DW_AT_name("RCR_VALID")
    3628                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("RCR_VALID")
    3629                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    3630                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   67

    3631                            .dwattr $C$DW$165, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3632                            .dwattr $C$DW$165, DW_AT_decl_line(0x69)
    3633                            .dwattr $C$DW$165, DW_AT_decl_column(0x0c)
    3634                    
    3635                    $C$DW$166       .dwtag  DW_TAG_member
    3636                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    3637                            .dwattr $C$DW$166, DW_AT_name("ACC_THRESHOLD")
    3638                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("ACC_THRESHOLD")
    3639                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    3640                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3641                            .dwattr $C$DW$166, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3642                            .dwattr $C$DW$166, DW_AT_decl_line(0x6a)
    3643                            .dwattr $C$DW$166, DW_AT_decl_column(0x0c)
    3644                    
    3645                    $C$DW$167       .dwtag  DW_TAG_member
    3646                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    3647                            .dwattr $C$DW$167, DW_AT_name("rsvd10")
    3648                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("rsvd10")
    3649                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3650                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3651                            .dwattr $C$DW$167, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3652                            .dwattr $C$DW$167, DW_AT_decl_line(0x6b)
    3653                            .dwattr $C$DW$167, DW_AT_decl_column(0x0c)
    3654                    
    3655                    $C$DW$168       .dwtag  DW_TAG_member
    3656                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    3657                            .dwattr $C$DW$168, DW_AT_name("FEDACSDIS2")
    3658                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("FEDACSDIS2")
    3659                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3660                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3661                            .dwattr $C$DW$168, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3662                            .dwattr $C$DW$168, DW_AT_decl_line(0x6c)
    3663                            .dwattr $C$DW$168, DW_AT_decl_column(0x0c)
    3664                    
    3665                    $C$DW$169       .dwtag  DW_TAG_member
    3666                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    3667                            .dwattr $C$DW$169, DW_AT_name("rsvd11")
    3668                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("rsvd11")
    3669                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3670                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3671                            .dwattr $C$DW$169, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3672                            .dwattr $C$DW$169, DW_AT_decl_line(0x6d)
    3673                            .dwattr $C$DW$169, DW_AT_decl_column(0x0c)
    3674                    
    3675                    $C$DW$170       .dwtag  DW_TAG_member
    3676                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    3677                            .dwattr $C$DW$170, DW_AT_name("rsvd12")
    3678                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("rsvd12")
    3679                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3680                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3681                            .dwattr $C$DW$170, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3682                            .dwattr $C$DW$170, DW_AT_decl_line(0x6e)
    3683                            .dwattr $C$DW$170, DW_AT_decl_column(0x0c)
    3684                    
    3685                    $C$DW$171       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   68

    3686                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    3687                            .dwattr $C$DW$171, DW_AT_name("rsvd13")
    3688                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("rsvd13")
    3689                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3690                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3691                            .dwattr $C$DW$171, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3692                            .dwattr $C$DW$171, DW_AT_decl_line(0x6f)
    3693                            .dwattr $C$DW$171, DW_AT_decl_column(0x0c)
    3694                    
    3695                    $C$DW$172       .dwtag  DW_TAG_member
    3696                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    3697                            .dwattr $C$DW$172, DW_AT_name("RCR_VALUE0")
    3698                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("RCR_VALUE0")
    3699                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3700                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3701                            .dwattr $C$DW$172, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3702                            .dwattr $C$DW$172, DW_AT_decl_line(0x70)
    3703                            .dwattr $C$DW$172, DW_AT_decl_column(0x0c)
    3704                    
    3705                    $C$DW$173       .dwtag  DW_TAG_member
    3706                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    3707                            .dwattr $C$DW$173, DW_AT_name("RCR_VALUE1")
    3708                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("RCR_VALUE1")
    3709                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3710                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3711                            .dwattr $C$DW$173, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3712                            .dwattr $C$DW$173, DW_AT_decl_line(0x71)
    3713                            .dwattr $C$DW$173, DW_AT_decl_column(0x0c)
    3714                    
    3715                    $C$DW$174       .dwtag  DW_TAG_member
    3716                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    3717                            .dwattr $C$DW$174, DW_AT_name("rsvd14")
    3718                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("rsvd14")
    3719                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3720                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3721                            .dwattr $C$DW$174, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3722                            .dwattr $C$DW$174, DW_AT_decl_line(0x72)
    3723                            .dwattr $C$DW$174, DW_AT_decl_column(0x0c)
    3724                    
    3725                    $C$DW$175       .dwtag  DW_TAG_member
    3726                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    3727                            .dwattr $C$DW$175, DW_AT_name("FSM_WR_ENA")
    3728                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("FSM_WR_ENA")
    3729                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x28c]
    3730                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3731                            .dwattr $C$DW$175, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3732                            .dwattr $C$DW$175, DW_AT_decl_line(0x73)
    3733                            .dwattr $C$DW$175, DW_AT_decl_column(0x0c)
    3734                    
    3735                    $C$DW$176       .dwtag  DW_TAG_member
    3736                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$28)
    3737                            .dwattr $C$DW$176, DW_AT_name("rsvd15")
    3738                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("rsvd15")
    3739                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x290]
    3740                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Sun Feb 19 22:01:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1332410                              PAGE   69

    3741                            .dwattr $C$DW$176, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3742                            .dwattr $C$DW$176, DW_AT_decl_line(0x74)
    3743                            .dwattr $C$DW$176, DW_AT_decl_column(0x0c)
    3744                    
    3745                    $C$DW$177       .dwtag  DW_TAG_member
    3746                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    3747                            .dwattr $C$DW$177, DW_AT_name("EEPROM_CONFIG")
    3748                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("EEPROM_CONFIG")
