TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Sun Feb 19 14:13:26 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_sys_vim.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    2609                    
    2610                    $C$DW$T$109     .dwtag  DW_TAG_typedef
    2611                            .dwattr $C$DW$T$109, DW_AT_name("uint_least64_t")
    2612                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$106)
    2613                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2614                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    2615                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x41)
    2616                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x16)
    2617                    
    2618                    $C$DW$T$110     .dwtag  DW_TAG_typedef
    2619                            .dwattr $C$DW$T$110, DW_AT_name("uintmax_t")
    2620                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$15)
    2621                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    2622                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    2623                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x57)
    2624                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x20)
    2625                    
    2626                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    2627                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2628                            .dwattr $C$DW$T$16, DW_AT_name("float")
    2629                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    2630                    
    2631                    $C$DW$T$111     .dwtag  DW_TAG_typedef
    2632                            .dwattr $C$DW$T$111, DW_AT_name("float32")
    2633                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$16)
    2634                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    2635                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2636                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x6d)
    2637                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x0f)
    2638                    
    2639                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    2640                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   49

    2641                            .dwattr $C$DW$T$17, DW_AT_name("double")
    2642                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    2643                    
    2644                    $C$DW$T$112     .dwtag  DW_TAG_typedef
    2645                            .dwattr $C$DW$T$112, DW_AT_name("float64")
    2646                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$17)
    2647                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    2648                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2649                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x72)
    2650                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x10)
    2651                    
    2652                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    2653                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2654                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    2655                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    2656                    
    2657                    $C$DW$T$113     .dwtag  DW_TAG_base_type
    2658                            .dwattr $C$DW$T$113, DW_AT_encoding(DW_ATE_unsigned_char)
    2659                            .dwattr $C$DW$T$113, DW_AT_name("unsigned char")
    2660                            .dwattr $C$DW$T$113, DW_AT_byte_size(0x01)
    2661                    
    2662                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    2663                            .dwattr $C$DW$T$114, DW_AT_name("boolean")
    2664                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    2665                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2666                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2667                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x53)
    2668                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x0f)
    2669                    
    2670                    $C$DW$T$115     .dwtag  DW_TAG_typedef
    2671                            .dwattr $C$DW$T$115, DW_AT_name("tBoolean")
    2672                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    2673                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    2674                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2675                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x40)
    2676                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x11)
    2677                    
    2678                    
    2679                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2680                            .dwattr $C$DW$T$21, DW_AT_name("ccmr5Base")
    2681                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x28)
    2682                    $C$DW$78        .dwtag  DW_TAG_member
    2683                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    2684                            .dwattr $C$DW$78, DW_AT_name("CCMSR1")
    2685                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("CCMSR1")
    2686                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2687                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    2688                            .dwattr $C$DW$78, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2689                            .dwattr $C$DW$78, DW_AT_decl_line(0x45)
    2690                            .dwattr $C$DW$78, DW_AT_decl_column(0x0c)
    2691                    
    2692                    $C$DW$79        .dwtag  DW_TAG_member
    2693                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    2694                            .dwattr $C$DW$79, DW_AT_name("CCMKEYR1")
    2695                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("CCMKEYR1")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   50

    2696                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2697                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    2698                            .dwattr $C$DW$79, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2699                            .dwattr $C$DW$79, DW_AT_decl_line(0x46)
    2700                            .dwattr $C$DW$79, DW_AT_decl_column(0x0c)
    2701                    
    2702                    $C$DW$80        .dwtag  DW_TAG_member
    2703                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    2704                            .dwattr $C$DW$80, DW_AT_name("CCMSR2")
    2705                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("CCMSR2")
    2706                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2707                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    2708                            .dwattr $C$DW$80, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2709                            .dwattr $C$DW$80, DW_AT_decl_line(0x47)
    2710                            .dwattr $C$DW$80, DW_AT_decl_column(0x0c)
    2711                    
    2712                    $C$DW$81        .dwtag  DW_TAG_member
    2713                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    2714                            .dwattr $C$DW$81, DW_AT_name("CCMKEYR2")
    2715                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("CCMKEYR2")
    2716                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2717                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    2718                            .dwattr $C$DW$81, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2719                            .dwattr $C$DW$81, DW_AT_decl_line(0x48)
    2720                            .dwattr $C$DW$81, DW_AT_decl_column(0x0c)
    2721                    
    2722                    $C$DW$82        .dwtag  DW_TAG_member
    2723                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    2724                            .dwattr $C$DW$82, DW_AT_name("CCMSR3")
    2725                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("CCMSR3")
    2726                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2727                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    2728                            .dwattr $C$DW$82, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2729                            .dwattr $C$DW$82, DW_AT_decl_line(0x49)
    2730                            .dwattr $C$DW$82, DW_AT_decl_column(0x0c)
    2731                    
    2732                    $C$DW$83        .dwtag  DW_TAG_member
    2733                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    2734                            .dwattr $C$DW$83, DW_AT_name("CCMKEYR3")
    2735                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("CCMKEYR3")
    2736                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2737                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2738                            .dwattr $C$DW$83, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2739                            .dwattr $C$DW$83, DW_AT_decl_line(0x4a)
    2740                            .dwattr $C$DW$83, DW_AT_decl_column(0x0c)
    2741                    
    2742                    $C$DW$84        .dwtag  DW_TAG_member
    2743                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    2744                            .dwattr $C$DW$84, DW_AT_name("CCMPOLCNTRL")
    2745                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("CCMPOLCNTRL")
    2746                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2747                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2748                            .dwattr $C$DW$84, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2749                            .dwattr $C$DW$84, DW_AT_decl_line(0x4b)
    2750                            .dwattr $C$DW$84, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   51

    2751                    
    2752                    $C$DW$85        .dwtag  DW_TAG_member
    2753                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    2754                            .dwattr $C$DW$85, DW_AT_name("CCMSR4")
    2755                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("CCMSR4")
    2756                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2757                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2758                            .dwattr $C$DW$85, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2759                            .dwattr $C$DW$85, DW_AT_decl_line(0x4c)
    2760                            .dwattr $C$DW$85, DW_AT_decl_column(0x0c)
    2761                    
    2762                    $C$DW$86        .dwtag  DW_TAG_member
    2763                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    2764                            .dwattr $C$DW$86, DW_AT_name("CCMKEYR4")
    2765                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("CCMKEYR4")
    2766                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2767                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2768                            .dwattr $C$DW$86, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2769                            .dwattr $C$DW$86, DW_AT_decl_line(0x4d)
    2770                            .dwattr $C$DW$86, DW_AT_decl_column(0x0c)
    2771                    
    2772                    $C$DW$87        .dwtag  DW_TAG_member
    2773                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    2774                            .dwattr $C$DW$87, DW_AT_name("CCMPDSTAT0")
    2775                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("CCMPDSTAT0")
    2776                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2777                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2778                            .dwattr $C$DW$87, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2779                            .dwattr $C$DW$87, DW_AT_decl_line(0x4e)
    2780                            .dwattr $C$DW$87, DW_AT_decl_column(0x0c)
    2781                    
    2782                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2783                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x43)
    2784                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x19)
    2785                            .dwendtag $C$DW$T$21
    2786                    
    2787                    $C$DW$T$116     .dwtag  DW_TAG_volatile_type
    2788                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$21)
    2789                    
    2790                    $C$DW$T$117     .dwtag  DW_TAG_typedef
    2791                            .dwattr $C$DW$T$117, DW_AT_name("ccmr5BASE_t")
    2792                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    2793                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    2794                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2795                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x4f)
    2796                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x03)
    2797                    
    2798                    
    2799                    $C$DW$T$69      .dwtag  DW_TAG_enumeration_type
    2800                            .dwattr $C$DW$T$69, DW_AT_name("config_value_type")
    2801                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x01)
    2802                    $C$DW$88        .dwtag  DW_TAG_enumerator
    2803                            .dwattr $C$DW$88, DW_AT_name("InitialValue")
    2804                            .dwattr $C$DW$88, DW_AT_const_value(0x00)
    2805                            .dwattr $C$DW$88, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   52

    2806                            .dwattr $C$DW$88, DW_AT_decl_line(0x5c)
    2807                            .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    2808                    
    2809                    $C$DW$89        .dwtag  DW_TAG_enumerator
    2810                            .dwattr $C$DW$89, DW_AT_name("CurrentValue")
    2811                            .dwattr $C$DW$89, DW_AT_const_value(0x01)
    2812                            .dwattr $C$DW$89, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2813                            .dwattr $C$DW$89, DW_AT_decl_line(0x5d)
    2814                            .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    2815                    
    2816                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2817                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x5a)
    2818                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2819                            .dwendtag $C$DW$T$69
    2820                    
    2821                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    2822                            .dwattr $C$DW$T$70, DW_AT_name("config_value_type_t")
    2823                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2824                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2825                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2826                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x5e)
    2827                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    2828                    
    2829                    
    2830                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2831                            .dwattr $C$DW$T$24, DW_AT_name("esmBase")
    2832                            .dwattr $C$DW$T$24, DW_AT_byte_size(0xa4)
    2833                    $C$DW$90        .dwtag  DW_TAG_member
    2834                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    2835                            .dwattr $C$DW$90, DW_AT_name("EEPAPR1")
    2836                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("EEPAPR1")
    2837                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2838                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2839                            .dwattr $C$DW$90, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2840                            .dwattr $C$DW$90, DW_AT_decl_line(0x48)
    2841                            .dwattr $C$DW$90, DW_AT_decl_column(0x0c)
    2842                    
    2843                    $C$DW$91        .dwtag  DW_TAG_member
    2844                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    2845                            .dwattr $C$DW$91, DW_AT_name("DEPAPR1")
    2846                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("DEPAPR1")
    2847                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2848                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2849                            .dwattr $C$DW$91, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2850                            .dwattr $C$DW$91, DW_AT_decl_line(0x49)
    2851                            .dwattr $C$DW$91, DW_AT_decl_column(0x0c)
    2852                    
    2853                    $C$DW$92        .dwtag  DW_TAG_member
    2854                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    2855                            .dwattr $C$DW$92, DW_AT_name("IESR1")
    2856                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("IESR1")
    2857                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2858                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2859                            .dwattr $C$DW$92, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2860                            .dwattr $C$DW$92, DW_AT_decl_line(0x4a)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   53

    2861                            .dwattr $C$DW$92, DW_AT_decl_column(0x0c)
    2862                    
    2863                    $C$DW$93        .dwtag  DW_TAG_member
    2864                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    2865                            .dwattr $C$DW$93, DW_AT_name("IECR1")
    2866                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("IECR1")
    2867                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2868                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2869                            .dwattr $C$DW$93, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2870                            .dwattr $C$DW$93, DW_AT_decl_line(0x4b)
    2871                            .dwattr $C$DW$93, DW_AT_decl_column(0x0c)
    2872                    
    2873                    $C$DW$94        .dwtag  DW_TAG_member
    2874                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
    2875                            .dwattr $C$DW$94, DW_AT_name("ILSR1")
    2876                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("ILSR1")
    2877                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2878                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2879                            .dwattr $C$DW$94, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2880                            .dwattr $C$DW$94, DW_AT_decl_line(0x4c)
    2881                            .dwattr $C$DW$94, DW_AT_decl_column(0x0c)
    2882                    
    2883                    $C$DW$95        .dwtag  DW_TAG_member
    2884                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    2885                            .dwattr $C$DW$95, DW_AT_name("ILCR1")
    2886                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("ILCR1")
    2887                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2888                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2889                            .dwattr $C$DW$95, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2890                            .dwattr $C$DW$95, DW_AT_decl_line(0x4d)
    2891                            .dwattr $C$DW$95, DW_AT_decl_column(0x0c)
    2892                    
    2893                    $C$DW$96        .dwtag  DW_TAG_member
    2894                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$22)
    2895                            .dwattr $C$DW$96, DW_AT_name("SR1")
    2896                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("SR1")
    2897                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2898                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2899                            .dwattr $C$DW$96, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2900                            .dwattr $C$DW$96, DW_AT_decl_line(0x4e)
    2901                            .dwattr $C$DW$96, DW_AT_decl_column(0x0c)
    2902                    
    2903                    $C$DW$97        .dwtag  DW_TAG_member
    2904                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    2905                            .dwattr $C$DW$97, DW_AT_name("EPSR")
    2906                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("EPSR")
    2907                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2908                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2909                            .dwattr $C$DW$97, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2910                            .dwattr $C$DW$97, DW_AT_decl_line(0x4f)
    2911                            .dwattr $C$DW$97, DW_AT_decl_column(0x0c)
    2912                    
    2913                    $C$DW$98        .dwtag  DW_TAG_member
    2914                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    2915                            .dwattr $C$DW$98, DW_AT_name("IOFFHR")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   54

    2916                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("IOFFHR")
    2917                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2918                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2919                            .dwattr $C$DW$98, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2920                            .dwattr $C$DW$98, DW_AT_decl_line(0x50)
    2921                            .dwattr $C$DW$98, DW_AT_decl_column(0x0c)
    2922                    
    2923                    $C$DW$99        .dwtag  DW_TAG_member
    2924                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    2925                            .dwattr $C$DW$99, DW_AT_name("IOFFLR")
    2926                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("IOFFLR")
    2927                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2928                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2929                            .dwattr $C$DW$99, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2930                            .dwattr $C$DW$99, DW_AT_decl_line(0x51)
    2931                            .dwattr $C$DW$99, DW_AT_decl_column(0x0c)
    2932                    
    2933                    $C$DW$100       .dwtag  DW_TAG_member
    2934                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    2935                            .dwattr $C$DW$100, DW_AT_name("LTCR")
    2936                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("LTCR")
    2937                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2938                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2939                            .dwattr $C$DW$100, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2940                            .dwattr $C$DW$100, DW_AT_decl_line(0x52)
    2941                            .dwattr $C$DW$100, DW_AT_decl_column(0x0c)
    2942                    
    2943                    $C$DW$101       .dwtag  DW_TAG_member
    2944                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    2945                            .dwattr $C$DW$101, DW_AT_name("LTCPR")
    2946                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("LTCPR")
    2947                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2948                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2949                            .dwattr $C$DW$101, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2950                            .dwattr $C$DW$101, DW_AT_decl_line(0x53)
    2951                            .dwattr $C$DW$101, DW_AT_decl_column(0x0c)
    2952                    
    2953                    $C$DW$102       .dwtag  DW_TAG_member
    2954                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    2955                            .dwattr $C$DW$102, DW_AT_name("EKR")
    2956                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("EKR")
    2957                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2958                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2959                            .dwattr $C$DW$102, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2960                            .dwattr $C$DW$102, DW_AT_decl_line(0x54)
    2961                            .dwattr $C$DW$102, DW_AT_decl_column(0x0c)
    2962                    
    2963                    $C$DW$103       .dwtag  DW_TAG_member
    2964                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    2965                            .dwattr $C$DW$103, DW_AT_name("SSR2")
    2966                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("SSR2")
    2967                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2968                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2969                            .dwattr $C$DW$103, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2970                            .dwattr $C$DW$103, DW_AT_decl_line(0x55)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   55

    2971                            .dwattr $C$DW$103, DW_AT_decl_column(0x0c)
    2972                    
    2973                    $C$DW$104       .dwtag  DW_TAG_member
    2974                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    2975                            .dwattr $C$DW$104, DW_AT_name("IEPSR4")
    2976                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("IEPSR4")
    2977                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2978                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2979                            .dwattr $C$DW$104, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2980                            .dwattr $C$DW$104, DW_AT_decl_line(0x56)
    2981                            .dwattr $C$DW$104, DW_AT_decl_column(0x0c)
    2982                    
    2983                    $C$DW$105       .dwtag  DW_TAG_member
    2984                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    2985                            .dwattr $C$DW$105, DW_AT_name("IEPCR4")
    2986                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("IEPCR4")
    2987                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2988                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2989                            .dwattr $C$DW$105, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2990                            .dwattr $C$DW$105, DW_AT_decl_line(0x57)
    2991                            .dwattr $C$DW$105, DW_AT_decl_column(0x0c)
    2992                    
    2993                    $C$DW$106       .dwtag  DW_TAG_member
    2994                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    2995                            .dwattr $C$DW$106, DW_AT_name("IESR4")
    2996                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("IESR4")
    2997                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2998                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2999                            .dwattr $C$DW$106, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3000                            .dwattr $C$DW$106, DW_AT_decl_line(0x58)
    3001                            .dwattr $C$DW$106, DW_AT_decl_column(0x0c)
    3002                    
    3003                    $C$DW$107       .dwtag  DW_TAG_member
    3004                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    3005                            .dwattr $C$DW$107, DW_AT_name("IECR4")
    3006                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("IECR4")
    3007                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3008                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    3009                            .dwattr $C$DW$107, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3010                            .dwattr $C$DW$107, DW_AT_decl_line(0x59)
    3011                            .dwattr $C$DW$107, DW_AT_decl_column(0x0c)
    3012                    
    3013                    $C$DW$108       .dwtag  DW_TAG_member
    3014                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    3015                            .dwattr $C$DW$108, DW_AT_name("ILSR4")
    3016                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("ILSR4")
    3017                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3018                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    3019                            .dwattr $C$DW$108, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3020                            .dwattr $C$DW$108, DW_AT_decl_line(0x5a)
    3021                            .dwattr $C$DW$108, DW_AT_decl_column(0x0c)
    3022                    
    3023                    $C$DW$109       .dwtag  DW_TAG_member
    3024                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    3025                            .dwattr $C$DW$109, DW_AT_name("ILCR4")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   56

    3026                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("ILCR4")
    3027                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3028                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    3029                            .dwattr $C$DW$109, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3030                            .dwattr $C$DW$109, DW_AT_decl_line(0x5b)
    3031                            .dwattr $C$DW$109, DW_AT_decl_column(0x0c)
    3032                    
    3033                    $C$DW$110       .dwtag  DW_TAG_member
    3034                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    3035                            .dwattr $C$DW$110, DW_AT_name("SR4")
    3036                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("SR4")
    3037                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3038                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    3039                            .dwattr $C$DW$110, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3040                            .dwattr $C$DW$110, DW_AT_decl_line(0x5c)
    3041                            .dwattr $C$DW$110, DW_AT_decl_column(0x0c)
    3042                    
    3043                    $C$DW$111       .dwtag  DW_TAG_member
    3044                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$23)
    3045                            .dwattr $C$DW$111, DW_AT_name("rsvd1")
    3046                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd1")
    3047                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3048                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    3049                            .dwattr $C$DW$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3050                            .dwattr $C$DW$111, DW_AT_decl_line(0x5d)
    3051                            .dwattr $C$DW$111, DW_AT_decl_column(0x0c)
    3052                    
    3053                    $C$DW$112       .dwtag  DW_TAG_member
    3054                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    3055                            .dwattr $C$DW$112, DW_AT_name("IEPSR7")
    3056                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("IEPSR7")
    3057                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3058                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    3059                            .dwattr $C$DW$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3060                            .dwattr $C$DW$112, DW_AT_decl_line(0x5e)
    3061                            .dwattr $C$DW$112, DW_AT_decl_column(0x0c)
    3062                    
    3063                    $C$DW$113       .dwtag  DW_TAG_member
    3064                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    3065                            .dwattr $C$DW$113, DW_AT_name("IEPCR7")
    3066                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("IEPCR7")
    3067                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3068                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    3069                            .dwattr $C$DW$113, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3070                            .dwattr $C$DW$113, DW_AT_decl_line(0x5f)
    3071                            .dwattr $C$DW$113, DW_AT_decl_column(0x0c)
    3072                    
    3073                    $C$DW$114       .dwtag  DW_TAG_member
    3074                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    3075                            .dwattr $C$DW$114, DW_AT_name("IESR7")
    3076                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("IESR7")
    3077                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3078                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    3079                            .dwattr $C$DW$114, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3080                            .dwattr $C$DW$114, DW_AT_decl_line(0x60)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   57

    3081                            .dwattr $C$DW$114, DW_AT_decl_column(0x0c)
    3082                    
    3083                    $C$DW$115       .dwtag  DW_TAG_member
    3084                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    3085                            .dwattr $C$DW$115, DW_AT_name("IECR7")
    3086                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("IECR7")
    3087                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    3088                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    3089                            .dwattr $C$DW$115, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3090                            .dwattr $C$DW$115, DW_AT_decl_line(0x61)
    3091                            .dwattr $C$DW$115, DW_AT_decl_column(0x0c)
    3092                    
    3093                    $C$DW$116       .dwtag  DW_TAG_member
    3094                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    3095                            .dwattr $C$DW$116, DW_AT_name("ILSR7")
    3096                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("ILSR7")
    3097                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3098                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    3099                            .dwattr $C$DW$116, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3100                            .dwattr $C$DW$116, DW_AT_decl_line(0x62)
    3101                            .dwattr $C$DW$116, DW_AT_decl_column(0x0c)
    3102                    
    3103                    $C$DW$117       .dwtag  DW_TAG_member
    3104                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    3105                            .dwattr $C$DW$117, DW_AT_name("ILCR7")
    3106                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("ILCR7")
    3107                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    3108                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    3109                            .dwattr $C$DW$117, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3110                            .dwattr $C$DW$117, DW_AT_decl_line(0x63)
    3111                            .dwattr $C$DW$117, DW_AT_decl_column(0x0c)
    3112                    
    3113                    $C$DW$118       .dwtag  DW_TAG_member
    3114                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$22)
    3115                            .dwattr $C$DW$118, DW_AT_name("SR7")
    3116                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("SR7")
    3117                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    3118                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    3119                            .dwattr $C$DW$118, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3120                            .dwattr $C$DW$118, DW_AT_decl_line(0x64)
    3121                            .dwattr $C$DW$118, DW_AT_decl_column(0x0c)
    3122                    
    3123                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3124                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x46)
    3125                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x19)
    3126                            .dwendtag $C$DW$T$24
    3127                    
    3128                    $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    3129                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$24)
    3130                    
    3131                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    3132                            .dwattr $C$DW$T$58, DW_AT_name("esmBASE_t")
    3133                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3134                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3135                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   58

    3136                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x65)
    3137                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    3138                    
    3139                    $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    3140                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3141                            .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    3142                    
    3143                    
    3144                    $C$DW$T$118     .dwtag  DW_TAG_enumeration_type
    3145                            .dwattr $C$DW$T$118, DW_AT_name("esmSelfTestFlag")
    3146                            .dwattr $C$DW$T$118, DW_AT_byte_size(0x01)
    3147                    $C$DW$119       .dwtag  DW_TAG_enumerator
    3148                            .dwattr $C$DW$119, DW_AT_name("esmSelfTest_Passed")
    3149                            .dwattr $C$DW$119, DW_AT_const_value(0x00)
    3150                            .dwattr $C$DW$119, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3151                            .dwattr $C$DW$119, DW_AT_decl_line(0x3c2)
    3152                            .dwattr $C$DW$119, DW_AT_decl_column(0x05)
    3153                    
    3154                    $C$DW$120       .dwtag  DW_TAG_enumerator
    3155                            .dwattr $C$DW$120, DW_AT_name("esmSelfTest_Active")
    3156                            .dwattr $C$DW$120, DW_AT_const_value(0x01)
    3157                            .dwattr $C$DW$120, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3158                            .dwattr $C$DW$120, DW_AT_decl_line(0x3c3)
    3159                            .dwattr $C$DW$120, DW_AT_decl_column(0x05)
    3160                    
    3161                    $C$DW$121       .dwtag  DW_TAG_enumerator
    3162                            .dwattr $C$DW$121, DW_AT_name("esmSelfTest_NotStarted")
    3163                            .dwattr $C$DW$121, DW_AT_const_value(0x02)
    3164                            .dwattr $C$DW$121, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3165                            .dwattr $C$DW$121, DW_AT_decl_line(0x3c4)
    3166                            .dwattr $C$DW$121, DW_AT_decl_column(0x05)
    3167                    
    3168                    $C$DW$122       .dwtag  DW_TAG_enumerator
    3169                            .dwattr $C$DW$122, DW_AT_name("esmSelfTest_Failed")
    3170                            .dwattr $C$DW$122, DW_AT_const_value(0x03)
    3171                            .dwattr $C$DW$122, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3172                            .dwattr $C$DW$122, DW_AT_decl_line(0x3c5)
    3173                            .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    3174                    
    3175                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3176                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x3c0)
    3177                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x0e)
    3178                            .dwendtag $C$DW$T$118
    3179                    
    3180                    $C$DW$T$119     .dwtag  DW_TAG_typedef
    3181                            .dwattr $C$DW$T$119, DW_AT_name("esmSelfTestFlag_t")
    3182                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    3183                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3184                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3185                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x3c6)
    3186                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x02)
    3187                    
    3188                    
    3189                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3190                            .dwattr $C$DW$T$25, DW_AT_name("esm_config_reg")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   59

    3191                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x2c)
    3192                    $C$DW$123       .dwtag  DW_TAG_member
    3193                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    3194                            .dwattr $C$DW$123, DW_AT_name("CONFIG_EEPAPR1")
    3195                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("CONFIG_EEPAPR1")
    3196                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3197                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    3198                            .dwattr $C$DW$123, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3199                            .dwattr $C$DW$123, DW_AT_decl_line(0x3cb)
    3200                            .dwattr $C$DW$123, DW_AT_decl_column(0x0c)
    3201                    
    3202                    $C$DW$124       .dwtag  DW_TAG_member
    3203                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    3204                            .dwattr $C$DW$124, DW_AT_name("CONFIG_IESR1")
    3205                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("CONFIG_IESR1")
    3206                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3207                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    3208                            .dwattr $C$DW$124, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3209                            .dwattr $C$DW$124, DW_AT_decl_line(0x3cc)
    3210                            .dwattr $C$DW$124, DW_AT_decl_column(0x0c)
    3211                    
    3212                    $C$DW$125       .dwtag  DW_TAG_member
    3213                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    3214                            .dwattr $C$DW$125, DW_AT_name("CONFIG_ILSR1")
    3215                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("CONFIG_ILSR1")
    3216                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3217                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    3218                            .dwattr $C$DW$125, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3219                            .dwattr $C$DW$125, DW_AT_decl_line(0x3cd)
    3220                            .dwattr $C$DW$125, DW_AT_decl_column(0x0c)
    3221                    
    3222                    $C$DW$126       .dwtag  DW_TAG_member
    3223                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    3224                            .dwattr $C$DW$126, DW_AT_name("CONFIG_LTCPR")
    3225                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("CONFIG_LTCPR")
    3226                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3227                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    3228                            .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3229                            .dwattr $C$DW$126, DW_AT_decl_line(0x3ce)
    3230                            .dwattr $C$DW$126, DW_AT_decl_column(0x0c)
    3231                    
    3232                    $C$DW$127       .dwtag  DW_TAG_member
    3233                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    3234                            .dwattr $C$DW$127, DW_AT_name("CONFIG_EKR")
    3235                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("CONFIG_EKR")
    3236                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3237                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    3238                            .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3239                            .dwattr $C$DW$127, DW_AT_decl_line(0x3cf)
    3240                            .dwattr $C$DW$127, DW_AT_decl_column(0x0c)
    3241                    
    3242                    $C$DW$128       .dwtag  DW_TAG_member
    3243                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    3244                            .dwattr $C$DW$128, DW_AT_name("CONFIG_IEPSR4")
    3245                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("CONFIG_IEPSR4")
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   60

    3246                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3247                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    3248                            .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3249                            .dwattr $C$DW$128, DW_AT_decl_line(0x3d0)
    3250                            .dwattr $C$DW$128, DW_AT_decl_column(0x0c)
    3251                    
    3252                    $C$DW$129       .dwtag  DW_TAG_member
    3253                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    3254                            .dwattr $C$DW$129, DW_AT_name("CONFIG_IESR4")
    3255                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("CONFIG_IESR4")
    3256                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3257                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    3258                            .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3259                            .dwattr $C$DW$129, DW_AT_decl_line(0x3d1)
    3260                            .dwattr $C$DW$129, DW_AT_decl_column(0x0c)
    3261                    
    3262                    $C$DW$130       .dwtag  DW_TAG_member
    3263                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    3264                            .dwattr $C$DW$130, DW_AT_name("CONFIG_ILSR4")
    3265                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("CONFIG_ILSR4")
    3266                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3267                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    3268                            .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3269                            .dwattr $C$DW$130, DW_AT_decl_line(0x3d2)
    3270                            .dwattr $C$DW$130, DW_AT_decl_column(0x0c)
    3271                    
    3272                    $C$DW$131       .dwtag  DW_TAG_member
    3273                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    3274                            .dwattr $C$DW$131, DW_AT_name("CONFIG_IEPSR7")
    3275                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("CONFIG_IEPSR7")
    3276                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3277                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    3278                            .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3279                            .dwattr $C$DW$131, DW_AT_decl_line(0x3d3)
    3280                            .dwattr $C$DW$131, DW_AT_decl_column(0x0c)
    3281                    
    3282                    $C$DW$132       .dwtag  DW_TAG_member
    3283                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    3284                            .dwattr $C$DW$132, DW_AT_name("CONFIG_IESR7")
    3285                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("CONFIG_IESR7")
    3286                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3287                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    3288                            .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3289                            .dwattr $C$DW$132, DW_AT_decl_line(0x3d4)
    3290                            .dwattr $C$DW$132, DW_AT_decl_column(0x0c)
    3291                    
    3292                    $C$DW$133       .dwtag  DW_TAG_member
    3293                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    3294                            .dwattr $C$DW$133, DW_AT_name("CONFIG_ILSR7")
    3295                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("CONFIG_ILSR7")
    3296                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3297                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    3298                            .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3299                            .dwattr $C$DW$133, DW_AT_decl_line(0x3d5)
    3300                            .dwattr $C$DW$133, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   61

    3301                    
    3302                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3303                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x3c9)
    3304                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3305                            .dwendtag $C$DW$T$25
    3306                    
    3307                    $C$DW$T$120     .dwtag  DW_TAG_typedef
    3308                            .dwattr $C$DW$T$120, DW_AT_name("esm_config_reg_t")
    3309                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$25)
    3310                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3311                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3312                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x3d6)
    3313                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x03)
    3314                    
    3315                    
    3316                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3317                            .dwattr $C$DW$T$30, DW_AT_name("flashWBase")
    3318                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x410)
    3319                    $C$DW$134       .dwtag  DW_TAG_member
    3320                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    3321                            .dwattr $C$DW$134, DW_AT_name("FRDCNTL")
    3322                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("FRDCNTL")
    3323                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3324                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    3325                            .dwattr $C$DW$134, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3326                            .dwattr $C$DW$134, DW_AT_decl_line(0x48)
    3327                            .dwattr $C$DW$134, DW_AT_decl_column(0x0c)
    3328                    
    3329                    $C$DW$135       .dwtag  DW_TAG_member
    3330                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    3331                            .dwattr $C$DW$135, DW_AT_name("rsvd1")
    3332                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd1")
    3333                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3334                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    3335                            .dwattr $C$DW$135, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3336                            .dwattr $C$DW$135, DW_AT_decl_line(0x49)
    3337                            .dwattr $C$DW$135, DW_AT_decl_column(0x0c)
    3338                    
    3339                    $C$DW$136       .dwtag  DW_TAG_member
    3340                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    3341                            .dwattr $C$DW$136, DW_AT_name("EE_FEDACCTRL1")
    3342                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("EE_FEDACCTRL1")
    3343                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3344                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    3345                            .dwattr $C$DW$136, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3346                            .dwattr $C$DW$136, DW_AT_decl_line(0x4a)
    3347                            .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    3348                    
    3349                    $C$DW$137       .dwtag  DW_TAG_member
    3350                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    3351                            .dwattr $C$DW$137, DW_AT_name("rsvd2")
    3352                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("rsvd2")
    3353                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3354                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    3355                            .dwattr $C$DW$137, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   62

    3356                            .dwattr $C$DW$137, DW_AT_decl_line(0x4b)
    3357                            .dwattr $C$DW$137, DW_AT_decl_column(0x0c)
    3358                    
    3359                    $C$DW$138       .dwtag  DW_TAG_member
    3360                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    3361                            .dwattr $C$DW$138, DW_AT_name("rsvd3")
    3362                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("rsvd3")
    3363                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3364                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    3365                            .dwattr $C$DW$138, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3366                            .dwattr $C$DW$138, DW_AT_decl_line(0x4c)
    3367                            .dwattr $C$DW$138, DW_AT_decl_column(0x0c)
    3368                    
    3369                    $C$DW$139       .dwtag  DW_TAG_member
    3370                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    3371                            .dwattr $C$DW$139, DW_AT_name("FEDAC_PASTATUS")
    3372                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("FEDAC_PASTATUS")
    3373                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3374                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    3375                            .dwattr $C$DW$139, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3376                            .dwattr $C$DW$139, DW_AT_decl_line(0x4d)
    3377                            .dwattr $C$DW$139, DW_AT_decl_column(0x0c)
    3378                    
    3379                    $C$DW$140       .dwtag  DW_TAG_member
    3380                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    3381                            .dwattr $C$DW$140, DW_AT_name("FEDAC_PBSTATUS")
    3382                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("FEDAC_PBSTATUS")
    3383                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3384                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    3385                            .dwattr $C$DW$140, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3386                            .dwattr $C$DW$140, DW_AT_decl_line(0x4e)
    3387                            .dwattr $C$DW$140, DW_AT_decl_column(0x0c)
    3388                    
    3389                    $C$DW$141       .dwtag  DW_TAG_member
    3390                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    3391                            .dwattr $C$DW$141, DW_AT_name("FEDAC_GBLSTATUS")
    3392                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("FEDAC_GBLSTATUS")
    3393                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3394                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    3395                            .dwattr $C$DW$141, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3396                            .dwattr $C$DW$141, DW_AT_decl_line(0x4f)
    3397                            .dwattr $C$DW$141, DW_AT_decl_column(0x0c)
    3398                    
    3399                    $C$DW$142       .dwtag  DW_TAG_member
    3400                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    3401                            .dwattr $C$DW$142, DW_AT_name("rsvd4")
    3402                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("rsvd4")
    3403                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3404                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    3405                            .dwattr $C$DW$142, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3406                            .dwattr $C$DW$142, DW_AT_decl_line(0x50)
    3407                            .dwattr $C$DW$142, DW_AT_decl_column(0x0c)
    3408                    
    3409                    $C$DW$143       .dwtag  DW_TAG_member
    3410                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   63

    3411                            .dwattr $C$DW$143, DW_AT_name("FEDACSDIS")
    3412                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("FEDACSDIS")
    3413                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3414                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    3415                            .dwattr $C$DW$143, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3416                            .dwattr $C$DW$143, DW_AT_decl_line(0x51)
    3417                            .dwattr $C$DW$143, DW_AT_decl_column(0x0c)
    3418                    
    3419                    $C$DW$144       .dwtag  DW_TAG_member
    3420                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    3421                            .dwattr $C$DW$144, DW_AT_name("FPRIM_ADD_TAG")
    3422                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("FPRIM_ADD_TAG")
    3423                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3424                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    3425                            .dwattr $C$DW$144, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3426                            .dwattr $C$DW$144, DW_AT_decl_line(0x52)
    3427                            .dwattr $C$DW$144, DW_AT_decl_column(0x0c)
    3428                    
    3429                    $C$DW$145       .dwtag  DW_TAG_member
    3430                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    3431                            .dwattr $C$DW$145, DW_AT_name("FDUP_ADD_TAG")
    3432                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("FDUP_ADD_TAG")
    3433                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3434                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    3435                            .dwattr $C$DW$145, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3436                            .dwattr $C$DW$145, DW_AT_decl_line(0x53)
    3437                            .dwattr $C$DW$145, DW_AT_decl_column(0x0c)
    3438                    
    3439                    $C$DW$146       .dwtag  DW_TAG_member
    3440                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    3441                            .dwattr $C$DW$146, DW_AT_name("FBPROT")
    3442                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("FBPROT")
    3443                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3444                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    3445                            .dwattr $C$DW$146, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3446                            .dwattr $C$DW$146, DW_AT_decl_line(0x54)
    3447                            .dwattr $C$DW$146, DW_AT_decl_column(0x0c)
    3448                    
    3449                    $C$DW$147       .dwtag  DW_TAG_member
    3450                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    3451                            .dwattr $C$DW$147, DW_AT_name("FBSE")
    3452                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("FBSE")
    3453                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3454                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3455                            .dwattr $C$DW$147, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3456                            .dwattr $C$DW$147, DW_AT_decl_line(0x55)
    3457                            .dwattr $C$DW$147, DW_AT_decl_column(0x0c)
    3458                    
    3459                    $C$DW$148       .dwtag  DW_TAG_member
    3460                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    3461                            .dwattr $C$DW$148, DW_AT_name("FBBUSY")
    3462                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("FBBUSY")
    3463                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3464                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3465                            .dwattr $C$DW$148, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   64

    3466                            .dwattr $C$DW$148, DW_AT_decl_line(0x56)
    3467                            .dwattr $C$DW$148, DW_AT_decl_column(0x0c)
    3468                    
    3469                    $C$DW$149       .dwtag  DW_TAG_member
    3470                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    3471                            .dwattr $C$DW$149, DW_AT_name("FBAC")
    3472                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("FBAC")
    3473                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3474                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3475                            .dwattr $C$DW$149, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3476                            .dwattr $C$DW$149, DW_AT_decl_line(0x57)
    3477                            .dwattr $C$DW$149, DW_AT_decl_column(0x0c)
    3478                    
    3479                    $C$DW$150       .dwtag  DW_TAG_member
    3480                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    3481                            .dwattr $C$DW$150, DW_AT_name("FBPWRMODE")
    3482                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("FBPWRMODE")
    3483                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3484                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3485                            .dwattr $C$DW$150, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3486                            .dwattr $C$DW$150, DW_AT_decl_line(0x58)
    3487                            .dwattr $C$DW$150, DW_AT_decl_column(0x0c)
    3488                    
    3489                    $C$DW$151       .dwtag  DW_TAG_member
    3490                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    3491                            .dwattr $C$DW$151, DW_AT_name("FBPRDY")
    3492                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("FBPRDY")
    3493                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3494                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3495                            .dwattr $C$DW$151, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3496                            .dwattr $C$DW$151, DW_AT_decl_line(0x59)
    3497                            .dwattr $C$DW$151, DW_AT_decl_column(0x0c)
    3498                    
    3499                    $C$DW$152       .dwtag  DW_TAG_member
    3500                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    3501                            .dwattr $C$DW$152, DW_AT_name("FPAC1")
    3502                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("FPAC1")
    3503                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3504                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3505                            .dwattr $C$DW$152, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3506                            .dwattr $C$DW$152, DW_AT_decl_line(0x5a)
    3507                            .dwattr $C$DW$152, DW_AT_decl_column(0x0c)
    3508                    
    3509                    $C$DW$153       .dwtag  DW_TAG_member
    3510                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    3511                            .dwattr $C$DW$153, DW_AT_name("rsvd5")
    3512                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("rsvd5")
    3513                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3514                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3515                            .dwattr $C$DW$153, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3516                            .dwattr $C$DW$153, DW_AT_decl_line(0x5b)
    3517                            .dwattr $C$DW$153, DW_AT_decl_column(0x0c)
    3518                    
    3519                    $C$DW$154       .dwtag  DW_TAG_member
    3520                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   65

    3521                            .dwattr $C$DW$154, DW_AT_name("FMAC")
    3522                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("FMAC")
    3523                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3524                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3525                            .dwattr $C$DW$154, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3526                            .dwattr $C$DW$154, DW_AT_decl_line(0x5c)
    3527                            .dwattr $C$DW$154, DW_AT_decl_column(0x0c)
    3528                    
    3529                    $C$DW$155       .dwtag  DW_TAG_member
    3530                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    3531                            .dwattr $C$DW$155, DW_AT_name("FMSTAT")
    3532                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("FMSTAT")
    3533                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3534                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3535                            .dwattr $C$DW$155, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3536                            .dwattr $C$DW$155, DW_AT_decl_line(0x5d)
    3537                            .dwattr $C$DW$155, DW_AT_decl_column(0x0c)
    3538                    
    3539                    $C$DW$156       .dwtag  DW_TAG_member
    3540                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    3541                            .dwattr $C$DW$156, DW_AT_name("FEMU_DMSW")
    3542                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("FEMU_DMSW")
    3543                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3544                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3545                            .dwattr $C$DW$156, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3546                            .dwattr $C$DW$156, DW_AT_decl_line(0x5e)
    3547                            .dwattr $C$DW$156, DW_AT_decl_column(0x0c)
    3548                    
    3549                    $C$DW$157       .dwtag  DW_TAG_member
    3550                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    3551                            .dwattr $C$DW$157, DW_AT_name("FEMU_DLSW")
    3552                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("FEMU_DLSW")
    3553                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3554                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3555                            .dwattr $C$DW$157, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3556                            .dwattr $C$DW$157, DW_AT_decl_line(0x5f)
    3557                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    3558                    
    3559                    $C$DW$158       .dwtag  DW_TAG_member
    3560                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    3561                            .dwattr $C$DW$158, DW_AT_name("FEMU_ECC")
    3562                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("FEMU_ECC")
    3563                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3564                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3565                            .dwattr $C$DW$158, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3566                            .dwattr $C$DW$158, DW_AT_decl_line(0x60)
    3567                            .dwattr $C$DW$158, DW_AT_decl_column(0x0c)
    3568                    
    3569                    $C$DW$159       .dwtag  DW_TAG_member
    3570                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    3571                            .dwattr $C$DW$159, DW_AT_name("FLOCK")
    3572                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("FLOCK")
    3573                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3574                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3575                            .dwattr $C$DW$159, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   66

    3576                            .dwattr $C$DW$159, DW_AT_decl_line(0x61)
    3577                            .dwattr $C$DW$159, DW_AT_decl_column(0x0c)
    3578                    
    3579                    $C$DW$160       .dwtag  DW_TAG_member
    3580                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    3581                            .dwattr $C$DW$160, DW_AT_name("rsvd6")
    3582                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("rsvd6")
    3583                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3584                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3585                            .dwattr $C$DW$160, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3586                            .dwattr $C$DW$160, DW_AT_decl_line(0x62)
    3587                            .dwattr $C$DW$160, DW_AT_decl_column(0x0c)
    3588                    
    3589                    $C$DW$161       .dwtag  DW_TAG_member
    3590                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    3591                            .dwattr $C$DW$161, DW_AT_name("FDIAGCTRL")
    3592                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("FDIAGCTRL")
    3593                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3594                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3595                            .dwattr $C$DW$161, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3596                            .dwattr $C$DW$161, DW_AT_decl_line(0x63)
    3597                            .dwattr $C$DW$161, DW_AT_decl_column(0x0c)
    3598                    
    3599                    $C$DW$162       .dwtag  DW_TAG_member
    3600                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    3601                            .dwattr $C$DW$162, DW_AT_name("rsvd7")
    3602                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("rsvd7")
    3603                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    3604                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3605                            .dwattr $C$DW$162, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3606                            .dwattr $C$DW$162, DW_AT_decl_line(0x64)
    3607                            .dwattr $C$DW$162, DW_AT_decl_column(0x0c)
    3608                    
    3609                    $C$DW$163       .dwtag  DW_TAG_member
    3610                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    3611                            .dwattr $C$DW$163, DW_AT_name("FRAW_ADDR")
    3612                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("FRAW_ADDR")
    3613                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3614                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3615                            .dwattr $C$DW$163, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3616                            .dwattr $C$DW$163, DW_AT_decl_line(0x65)
    3617                            .dwattr $C$DW$163, DW_AT_decl_column(0x0c)
    3618                    
    3619                    $C$DW$164       .dwtag  DW_TAG_member
    3620                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    3621                            .dwattr $C$DW$164, DW_AT_name("rsvd8")
    3622                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd8")
    3623                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3624                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3625                            .dwattr $C$DW$164, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3626                            .dwattr $C$DW$164, DW_AT_decl_line(0x66)
    3627                            .dwattr $C$DW$164, DW_AT_decl_column(0x0c)
    3628                    
    3629                    $C$DW$165       .dwtag  DW_TAG_member
    3630                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   67

    3631                            .dwattr $C$DW$165, DW_AT_name("FPAR_OVR")
    3632                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("FPAR_OVR")
    3633                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    3634                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3635                            .dwattr $C$DW$165, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3636                            .dwattr $C$DW$165, DW_AT_decl_line(0x67)
    3637                            .dwattr $C$DW$165, DW_AT_decl_column(0x0c)
    3638                    
    3639                    $C$DW$166       .dwtag  DW_TAG_member
    3640                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$26)
    3641                            .dwattr $C$DW$166, DW_AT_name("rsvd9")
    3642                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("rsvd9")
    3643                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3644                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3645                            .dwattr $C$DW$166, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3646                            .dwattr $C$DW$166, DW_AT_decl_line(0x68)
    3647                            .dwattr $C$DW$166, DW_AT_decl_column(0x0c)
    3648                    
    3649                    $C$DW$167       .dwtag  DW_TAG_member
    3650                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    3651                            .dwattr $C$DW$167, DW_AT_name("RCR_VALID")
    3652                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("RCR_VALID")
    3653                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    3654                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3655                            .dwattr $C$DW$167, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3656                            .dwattr $C$DW$167, DW_AT_decl_line(0x69)
    3657                            .dwattr $C$DW$167, DW_AT_decl_column(0x0c)
    3658                    
    3659                    $C$DW$168       .dwtag  DW_TAG_member
    3660                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    3661                            .dwattr $C$DW$168, DW_AT_name("ACC_THRESHOLD")
    3662                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("ACC_THRESHOLD")
    3663                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    3664                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3665                            .dwattr $C$DW$168, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3666                            .dwattr $C$DW$168, DW_AT_decl_line(0x6a)
    3667                            .dwattr $C$DW$168, DW_AT_decl_column(0x0c)
    3668                    
    3669                    $C$DW$169       .dwtag  DW_TAG_member
    3670                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    3671                            .dwattr $C$DW$169, DW_AT_name("rsvd10")
    3672                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("rsvd10")
    3673                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3674                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3675                            .dwattr $C$DW$169, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3676                            .dwattr $C$DW$169, DW_AT_decl_line(0x6b)
    3677                            .dwattr $C$DW$169, DW_AT_decl_column(0x0c)
    3678                    
    3679                    $C$DW$170       .dwtag  DW_TAG_member
    3680                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    3681                            .dwattr $C$DW$170, DW_AT_name("FEDACSDIS2")
    3682                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("FEDACSDIS2")
    3683                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3684                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3685                            .dwattr $C$DW$170, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   68

    3686                            .dwattr $C$DW$170, DW_AT_decl_line(0x6c)
    3687                            .dwattr $C$DW$170, DW_AT_decl_column(0x0c)
    3688                    
    3689                    $C$DW$171       .dwtag  DW_TAG_member
    3690                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    3691                            .dwattr $C$DW$171, DW_AT_name("rsvd11")
    3692                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("rsvd11")
    3693                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3694                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3695                            .dwattr $C$DW$171, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3696                            .dwattr $C$DW$171, DW_AT_decl_line(0x6d)
    3697                            .dwattr $C$DW$171, DW_AT_decl_column(0x0c)
    3698                    
    3699                    $C$DW$172       .dwtag  DW_TAG_member
    3700                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    3701                            .dwattr $C$DW$172, DW_AT_name("rsvd12")
    3702                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("rsvd12")
    3703                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3704                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3705                            .dwattr $C$DW$172, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3706                            .dwattr $C$DW$172, DW_AT_decl_line(0x6e)
    3707                            .dwattr $C$DW$172, DW_AT_decl_column(0x0c)
    3708                    
    3709                    $C$DW$173       .dwtag  DW_TAG_member
    3710                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    3711                            .dwattr $C$DW$173, DW_AT_name("rsvd13")
    3712                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("rsvd13")
    3713                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3714                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3715                            .dwattr $C$DW$173, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3716                            .dwattr $C$DW$173, DW_AT_decl_line(0x6f)
    3717                            .dwattr $C$DW$173, DW_AT_decl_column(0x0c)
    3718                    
    3719                    $C$DW$174       .dwtag  DW_TAG_member
    3720                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    3721                            .dwattr $C$DW$174, DW_AT_name("RCR_VALUE0")
    3722                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("RCR_VALUE0")
    3723                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3724                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3725                            .dwattr $C$DW$174, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3726                            .dwattr $C$DW$174, DW_AT_decl_line(0x70)
    3727                            .dwattr $C$DW$174, DW_AT_decl_column(0x0c)
    3728                    
    3729                    $C$DW$175       .dwtag  DW_TAG_member
    3730                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    3731                            .dwattr $C$DW$175, DW_AT_name("RCR_VALUE1")
    3732                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("RCR_VALUE1")
    3733                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3734                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3735                            .dwattr $C$DW$175, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3736                            .dwattr $C$DW$175, DW_AT_decl_line(0x71)
    3737                            .dwattr $C$DW$175, DW_AT_decl_column(0x0c)
    3738                    
    3739                    $C$DW$176       .dwtag  DW_TAG_member
    3740                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
TI ARM Assembler PC v16.9.0 Sun Feb 19 14:13:26 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0781610                              PAGE   69

    3741                            .dwattr $C$DW$176, DW_AT_name("rsvd14")
    3742                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("rsvd14")
    3743                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3744                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3745                            .dwattr $C$DW$176, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3746                            .dwattr $C$DW$176, DW_AT_decl_line(0x72)
    3747                            .dwattr $C$DW$176, DW_AT_decl_column(0x0c)
    3748                    
    3749                    $C$DW$177       .dwtag  DW_TAG_member
    3750                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    3751                            .dwattr $C$DW$177, DW_AT_name("FSM_WR_ENA")
    3752                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("FSM_WR_ENA")
    3753                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x28c]
    3754                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3755                            .dwattr $C$DW$177, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3756                            .dwattr $C$DW$177, DW_AT_decl_line(0x73)
    3757                            .dwattr $C$DW$177, DW_AT_decl_column(0x0c)
    3758                    
    3759                    $C$DW$178       .dwtag  DW_TAG_member
    3760                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$28)
    3761                            .dwattr $C$DW$178, DW_AT_name("rsvd15")
    3762                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("rsvd15")
    3763                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x290]
    3764                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3765                            .dwattr $C$DW$178, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3766                            .dwattr $C$DW$178, DW_AT_decl_line(0x74)
    3767                            .dwattr $C$DW$178, DW_AT_decl_column(0x0c)
    3768                    
    3769                    $C$DW$179       .dwtag  DW_TAG_member
    3770                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    3771                            .dwattr $C$DW$179, DW_AT_name("EEPROM_CONFIG")
    3772                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("EEPROM_CONFIG")
    3773                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c0]
