TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0311210                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 13:27:11 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_sys_pmm.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    ;       C:\ti\ccsv7\tools\compiler\ti-cgt-arm_16.9.0.LTS\bin\armacpia.exe -@C:\\Users\\bob\\AppData\\L

     990                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0311210                              PAGE   19

     991                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x40)
     992                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x11)
     993                    
     994                    
     995                    $C$DW$T$70      .dwtag  DW_TAG_enumeration_type
     996                            .dwattr $C$DW$T$70, DW_AT_name("config_value_type")
     997                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x01)
     998                    $C$DW$19        .dwtag  DW_TAG_enumerator
     999                            .dwattr $C$DW$19, DW_AT_name("InitialValue")
    1000                            .dwattr $C$DW$19, DW_AT_const_value(0x00)
    1001                            .dwattr $C$DW$19, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1002                            .dwattr $C$DW$19, DW_AT_decl_line(0x5c)
    1003                            .dwattr $C$DW$19, DW_AT_decl_column(0x02)
    1004                    
    1005                    $C$DW$20        .dwtag  DW_TAG_enumerator
    1006                            .dwattr $C$DW$20, DW_AT_name("CurrentValue")
    1007                            .dwattr $C$DW$20, DW_AT_const_value(0x01)
    1008                            .dwattr $C$DW$20, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1009                            .dwattr $C$DW$20, DW_AT_decl_line(0x5d)
    1010                            .dwattr $C$DW$20, DW_AT_decl_column(0x02)
    1011                    
    1012                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1013                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x5a)
    1014                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x0e)
    1015                            .dwendtag $C$DW$T$70
    1016                    
    1017                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    1018                            .dwattr $C$DW$T$71, DW_AT_name("config_value_type_t")
    1019                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    1020                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1021                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1022                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x5e)
    1023                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x02)
    1024                    
    1025                    
    1026                    $C$DW$T$72      .dwtag  DW_TAG_enumeration_type
    1027                            .dwattr $C$DW$T$72, DW_AT_name("loopBackType")
    1028                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x01)
    1029                    $C$DW$21        .dwtag  DW_TAG_enumerator
    1030                            .dwattr $C$DW$21, DW_AT_name("Digital_Lbk")
    1031                            .dwattr $C$DW$21, DW_AT_const_value(0x00)
    1032                            .dwattr $C$DW$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1033                            .dwattr $C$DW$21, DW_AT_decl_line(0x4e)
    1034                            .dwattr $C$DW$21, DW_AT_decl_column(0x05)
    1035                    
    1036                    $C$DW$22        .dwtag  DW_TAG_enumerator
    1037                            .dwattr $C$DW$22, DW_AT_name("Analog_Lbk")
    1038                            .dwattr $C$DW$22, DW_AT_const_value(0x01)
    1039                            .dwattr $C$DW$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1040                            .dwattr $C$DW$22, DW_AT_decl_line(0x4f)
    1041                            .dwattr $C$DW$22, DW_AT_decl_column(0x05)
    1042                    
    1043                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1044                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x4c)
    1045                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0311210                              PAGE   20

    1046                            .dwendtag $C$DW$T$72
    1047                    
    1048                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    1049                            .dwattr $C$DW$T$73, DW_AT_name("loopBackType_t")
    1050                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1051                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1052                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1053                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x50)
    1054                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x02)
    1055                    
    1056                    
    1057                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1058                            .dwattr $C$DW$T$24, DW_AT_name("pmmBase")
    1059                            .dwattr $C$DW$T$24, DW_AT_byte_size(0xc4)
    1060                    $C$DW$23        .dwtag  DW_TAG_member
    1061                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
    1062                            .dwattr $C$DW$23, DW_AT_name("LOGICPDPWRCTRL0")
    1063                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("LOGICPDPWRCTRL0")
    1064                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1065                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
    1066                            .dwattr $C$DW$23, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1067                            .dwattr $C$DW$23, DW_AT_decl_line(0x45)
    1068                            .dwattr $C$DW$23, DW_AT_decl_column(0x0c)
    1069                    
    1070                    $C$DW$24        .dwtag  DW_TAG_member
    1071                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
    1072                            .dwattr $C$DW$24, DW_AT_name("LOGICPDPWRCTRL1")
    1073                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("LOGICPDPWRCTRL1")
    1074                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1075                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
    1076                            .dwattr $C$DW$24, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1077                            .dwattr $C$DW$24, DW_AT_decl_line(0x46)
    1078                            .dwattr $C$DW$24, DW_AT_decl_column(0x0c)
    1079                    
    1080                    $C$DW$25        .dwtag  DW_TAG_member
    1081                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$21)
    1082                            .dwattr $C$DW$25, DW_AT_name("rsvd1")
    1083                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("rsvd1")
    1084                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1085                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
    1086                            .dwattr $C$DW$25, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1087                            .dwattr $C$DW$25, DW_AT_decl_line(0x47)
    1088                            .dwattr $C$DW$25, DW_AT_decl_column(0x0c)
    1089                    
    1090                    $C$DW$26        .dwtag  DW_TAG_member
    1091                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
    1092                            .dwattr $C$DW$26, DW_AT_name("PDCLKDIS")
    1093                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("PDCLKDIS")
    1094                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1095                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
    1096                            .dwattr $C$DW$26, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1097                            .dwattr $C$DW$26, DW_AT_decl_line(0x48)
    1098                            .dwattr $C$DW$26, DW_AT_decl_column(0x0c)
    1099                    
    1100                    $C$DW$27        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0311210                              PAGE   21

    1101                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$20)
    1102                            .dwattr $C$DW$27, DW_AT_name("PDCLKDISSET")
    1103                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("PDCLKDISSET")
    1104                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1105                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
    1106                            .dwattr $C$DW$27, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1107                            .dwattr $C$DW$27, DW_AT_decl_line(0x49)
    1108                            .dwattr $C$DW$27, DW_AT_decl_column(0x0c)
    1109                    
    1110                    $C$DW$28        .dwtag  DW_TAG_member
    1111                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
    1112                            .dwattr $C$DW$28, DW_AT_name("PDCLKDISCLR")
    1113                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("PDCLKDISCLR")
    1114                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1115                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
    1116                            .dwattr $C$DW$28, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1117                            .dwattr $C$DW$28, DW_AT_decl_line(0x4a)
    1118                            .dwattr $C$DW$28, DW_AT_decl_column(0x0c)
    1119                    
    1120                    $C$DW$29        .dwtag  DW_TAG_member
    1121                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$22)
    1122                            .dwattr $C$DW$29, DW_AT_name("rsvd2")
    1123                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("rsvd2")
    1124                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1125                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
    1126                            .dwattr $C$DW$29, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1127                            .dwattr $C$DW$29, DW_AT_decl_line(0x4b)
    1128                            .dwattr $C$DW$29, DW_AT_decl_column(0x0c)
    1129                    
    1130                    $C$DW$30        .dwtag  DW_TAG_member
    1131                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$22)
    1132                            .dwattr $C$DW$30, DW_AT_name("LOGICPDPWRSTAT")
    1133                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("LOGICPDPWRSTAT")
    1134                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1135                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
    1136                            .dwattr $C$DW$30, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1137                            .dwattr $C$DW$30, DW_AT_decl_line(0x4c)
    1138                            .dwattr $C$DW$30, DW_AT_decl_column(0x0c)
    1139                    
    1140                    $C$DW$31        .dwtag  DW_TAG_member
    1141                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
    1142                            .dwattr $C$DW$31, DW_AT_name("rsvd3")
    1143                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("rsvd3")
    1144                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1145                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
    1146                            .dwattr $C$DW$31, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1147                            .dwattr $C$DW$31, DW_AT_decl_line(0x52)
    1148                            .dwattr $C$DW$31, DW_AT_decl_column(0x0c)
    1149                    
    1150                    $C$DW$32        .dwtag  DW_TAG_member
    1151                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
    1152                            .dwattr $C$DW$32, DW_AT_name("GLOBALCTRL1")
    1153                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("GLOBALCTRL1")
    1154                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1155                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0311210                              PAGE   22

    1156                            .dwattr $C$DW$32, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1157                            .dwattr $C$DW$32, DW_AT_decl_line(0x53)
    1158                            .dwattr $C$DW$32, DW_AT_decl_column(0x0c)
    1159                    
    1160                    $C$DW$33        .dwtag  DW_TAG_member
    1161                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
    1162                            .dwattr $C$DW$33, DW_AT_name("rsvd4")
    1163                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("rsvd4")
    1164                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1165                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    1166                            .dwattr $C$DW$33, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1167                            .dwattr $C$DW$33, DW_AT_decl_line(0x54)
    1168                            .dwattr $C$DW$33, DW_AT_decl_column(0x0c)
    1169                    
    1170                    $C$DW$34        .dwtag  DW_TAG_member
    1171                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$20)
    1172                            .dwattr $C$DW$34, DW_AT_name("GLOBALSTAT")
    1173                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("GLOBALSTAT")
    1174                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1175                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
    1176                            .dwattr $C$DW$34, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1177                            .dwattr $C$DW$34, DW_AT_decl_line(0x55)
    1178                            .dwattr $C$DW$34, DW_AT_decl_column(0x0c)
    1179                    
    1180                    $C$DW$35        .dwtag  DW_TAG_member
    1181                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$20)
    1182                            .dwattr $C$DW$35, DW_AT_name("PRCKEYREG")
    1183                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRCKEYREG")
    1184                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1185                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    1186                            .dwattr $C$DW$35, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1187                            .dwattr $C$DW$35, DW_AT_decl_line(0x56)
    1188                            .dwattr $C$DW$35, DW_AT_decl_column(0x0c)
    1189                    
    1190                    $C$DW$36        .dwtag  DW_TAG_member
    1191                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$20)
    1192                            .dwattr $C$DW$36, DW_AT_name("LPDDCSTAT1")
    1193                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("LPDDCSTAT1")
    1194                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1195                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
    1196                            .dwattr $C$DW$36, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1197                            .dwattr $C$DW$36, DW_AT_decl_line(0x57)
    1198                            .dwattr $C$DW$36, DW_AT_decl_column(0x0c)
    1199                    
    1200                    $C$DW$37        .dwtag  DW_TAG_member
    1201                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$20)
    1202                            .dwattr $C$DW$37, DW_AT_name("LPDDCSTAT2")
    1203                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("LPDDCSTAT2")
    1204                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1205                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1206                            .dwattr $C$DW$37, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1207                            .dwattr $C$DW$37, DW_AT_decl_line(0x58)
    1208                            .dwattr $C$DW$37, DW_AT_decl_column(0x0c)
    1209                    
    1210                    $C$DW$38        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0311210                              PAGE   23

    1211                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$20)
    1212                            .dwattr $C$DW$38, DW_AT_name("rsvd5")
    1213                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("rsvd5")
    1214                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1215                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1216                            .dwattr $C$DW$38, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1217                            .dwattr $C$DW$38, DW_AT_decl_line(0x59)
    1218                            .dwattr $C$DW$38, DW_AT_decl_column(0x0c)
    1219                    
    1220                    $C$DW$39        .dwtag  DW_TAG_member
    1221                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$20)
    1222                            .dwattr $C$DW$39, DW_AT_name("rsvd6")
    1223                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("rsvd6")
    1224                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1225                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1226                            .dwattr $C$DW$39, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1227                            .dwattr $C$DW$39, DW_AT_decl_line(0x5a)
    1228                            .dwattr $C$DW$39, DW_AT_decl_column(0x0c)
    1229                    
    1230                    $C$DW$40        .dwtag  DW_TAG_member
    1231                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$20)
    1232                            .dwattr $C$DW$40, DW_AT_name("ISODIAGSTAT")
    1233                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("ISODIAGSTAT")
    1234                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1235                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1236                            .dwattr $C$DW$40, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    1237                            .dwattr $C$DW$40, DW_AT_decl_line(0x5b)
    1238                            .dwattr $C$DW$40, DW_AT_decl_column(0x0c)
    1239                    
    1240                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1241                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x43)
    1242                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x19)
    1243                            .dwendtag $C$DW$T$24
    1244                    
    1245                    $C$DW$T$74      .dwtag  DW_TAG_volatile_type
    1246                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$24)
    1247                    
    1248                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    1249                            .dwattr $C$DW$T$75, DW_AT_name("pmmBase_t")
    1250                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    1251                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1252                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    1253                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x5c)
    1254                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x02)
    1255                    
    1256                    
    1257                    $C$DW$T$66      .dwtag  DW_TAG_enumeration_type
    1258                            .dwattr $C$DW$T$66, DW_AT_name("pmmLogicPDTag")
    1259                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
    1260                    $C$DW$41        .dwtag  DW_TAG_enumerator
    1261                            .dwattr $C$DW$41, DW_AT_name("PMM_LOGICPD1")
    1262                            .dwattr $C$DW$41, DW_AT_const_value(0x05)
    1263                            .dwattr $C$DW$41, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1264                            .dwattr $C$DW$41, DW_AT_decl_line(0x43)
    1265                            .dwattr $C$DW$41, DW_AT_decl_column(0x02)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:11 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0311210                              PAGE   24

    1266                    
    1267                    $C$DW$42        .dwtag  DW_TAG_enumerator
    1268                            .dwattr $C$DW$42, DW_AT_name("PMM_LOGICPD2")
    1269                            .dwattr $C$DW$42, DW_AT_const_value(0x00)
    1270                            .dwattr $C$DW$42, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1271                            .dwattr $C$DW$42, DW_AT_decl_line(0x44)
    1272                            .dwattr $C$DW$42, DW_AT_decl_column(0x02)
    1273                    
    1274                    $C$DW$43        .dwtag  DW_TAG_enumerator
    1275                            .dwattr $C$DW$43, DW_AT_name("PMM_LOGICPD3")
    1276                            .dwattr $C$DW$43, DW_AT_const_value(0x01)
    1277                            .dwattr $C$DW$43, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/Pr
    1278                            .dwattr $C$DW$43, DW_AT_decl_line(0x45)
    1279                            .dwattr $C$DW$43, DW_AT_decl_column(0x02)
    1280                    
    1281                    $C$DW$44        .dwtag  DW_TAG_enumerator
    1282                            .dwattr $C$DW$44, DW_AT_name("PMM_LOGICPD4")
    1283                            .dwattr $C$DW$44, DW_AT_const_value(0x02)
