TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 13:27:11 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_sys_pcr.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    ;       C:\ti\ccsv7\tools\compiler\ti-cgt-arm_16.9.0.LTS\bin\armacpia.exe -@C:\\Users\\bob\\AppData\\L

    4026                            .dwattr $C$DW$318, DW_AT_name("PPCS8")
    4027                            .dwattr $C$DW$318, DW_AT_const_value(0x08)
    4028                            .dwattr $C$DW$318, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4029                            .dwattr $C$DW$318, DW_AT_decl_line(0x78)
    4030                            .dwattr $C$DW$318, DW_AT_decl_column(0x02)
    4031                    
    4032                    $C$DW$319       .dwtag  DW_TAG_enumerator
    4033                            .dwattr $C$DW$319, DW_AT_name("PPCS9")
    4034                            .dwattr $C$DW$319, DW_AT_const_value(0x09)
    4035                            .dwattr $C$DW$319, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4036                            .dwattr $C$DW$319, DW_AT_decl_line(0x78)
    4037                            .dwattr $C$DW$319, DW_AT_decl_column(0x0a)
    4038                    
    4039                    $C$DW$320       .dwtag  DW_TAG_enumerator
    4040                            .dwattr $C$DW$320, DW_AT_name("PPCS10")
    4041                            .dwattr $C$DW$320, DW_AT_const_value(0x0a)
    4042                            .dwattr $C$DW$320, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4043                            .dwattr $C$DW$320, DW_AT_decl_line(0x78)
    4044                            .dwattr $C$DW$320, DW_AT_decl_column(0x11)
    4045                    
    4046                    $C$DW$321       .dwtag  DW_TAG_enumerator
    4047                            .dwattr $C$DW$321, DW_AT_name("PPCS11")
    4048                            .dwattr $C$DW$321, DW_AT_const_value(0x0b)
    4049                            .dwattr $C$DW$321, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4050                            .dwattr $C$DW$321, DW_AT_decl_line(0x78)
    4051                            .dwattr $C$DW$321, DW_AT_decl_column(0x19)
    4052                    
    4053                    $C$DW$322       .dwtag  DW_TAG_enumerator
    4054                            .dwattr $C$DW$322, DW_AT_name("PPCS12")
    4055                            .dwattr $C$DW$322, DW_AT_const_value(0x0c)
    4056                            .dwattr $C$DW$322, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4057                            .dwattr $C$DW$322, DW_AT_decl_line(0x79)
    4058                            .dwattr $C$DW$322, DW_AT_decl_column(0x02)
    4059                    
    4060                    $C$DW$323       .dwtag  DW_TAG_enumerator
    4061                            .dwattr $C$DW$323, DW_AT_name("PPCS13")
    4062                            .dwattr $C$DW$323, DW_AT_const_value(0x0d)
    4063                            .dwattr $C$DW$323, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4064                            .dwattr $C$DW$323, DW_AT_decl_line(0x79)
    4065                            .dwattr $C$DW$323, DW_AT_decl_column(0x0b)
    4066                    
    4067                    $C$DW$324       .dwtag  DW_TAG_enumerator
    4068                            .dwattr $C$DW$324, DW_AT_name("PPCS14")
    4069                            .dwattr $C$DW$324, DW_AT_const_value(0x0e)
    4070                            .dwattr $C$DW$324, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   75

    4071                            .dwattr $C$DW$324, DW_AT_decl_line(0x79)
    4072                            .dwattr $C$DW$324, DW_AT_decl_column(0x13)
    4073                    
    4074                    $C$DW$325       .dwtag  DW_TAG_enumerator
    4075                            .dwattr $C$DW$325, DW_AT_name("PPCS15")
    4076                            .dwattr $C$DW$325, DW_AT_const_value(0x0f)
    4077                            .dwattr $C$DW$325, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    4078                            .dwattr $C$DW$325, DW_AT_decl_line(0x79)
    4079                            .dwattr $C$DW$325, DW_AT_decl_column(0x1b)
    4080                    
    4081                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    4082                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x75)
    4083                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    4084                            .dwendtag $C$DW$T$44
    4085                    
    4086                    $C$DW$T$45      .dwtag  DW_TAG_typedef
    4087                            .dwattr $C$DW$T$45, DW_AT_name("privileged_Peripheral_Memory_t")
    4088                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4089                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4090                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    4091                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x7a)
    4092                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
    4093                    
    4094                    
    4095                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4096                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    4097                    $C$DW$326       .dwtag  DW_TAG_member
    4098                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
    4099                            .dwattr $C$DW$326, DW_AT_name("PSxMSTID_L")
    4100                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("PSxMSTID_L")
    4101                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4102                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4103                            .dwattr $C$DW$326, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4104                            .dwattr $C$DW$326, DW_AT_decl_line(0x6e)
    4105                            .dwattr $C$DW$326, DW_AT_decl_column(0x10)
    4106                    
    4107                    $C$DW$327       .dwtag  DW_TAG_member
    4108                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    4109                            .dwattr $C$DW$327, DW_AT_name("PSxMSTID_H")
    4110                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("PSxMSTID_H")
    4111                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4112                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4113                            .dwattr $C$DW$327, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4114                            .dwattr $C$DW$327, DW_AT_decl_line(0x6f)
    4115                            .dwattr $C$DW$327, DW_AT_decl_column(0x10)
    4116                    
    4117                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4118                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x6d)
    4119                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x05)
    4120                            .dwendtag $C$DW$T$21
    4121                    
    4122                    
    4123                    $C$DW$T$28      .dwtag  DW_TAG_array_type
    4124                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$21)
    4125                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   76

    4126                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x100)
    4127                    $C$DW$328       .dwtag  DW_TAG_subrange_type
    4128                            .dwattr $C$DW$328, DW_AT_upper_bound(0x1f)
    4129                    
    4130                            .dwendtag $C$DW$T$28
    4131                    
    4132                    
    4133                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4134                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    4135                    $C$DW$329       .dwtag  DW_TAG_member
    4136                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
    4137                            .dwattr $C$DW$329, DW_AT_name("PPSxMSTID_L")
    4138                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("PPSxMSTID_L")
    4139                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4140                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4141                            .dwattr $C$DW$329, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4142                            .dwattr $C$DW$329, DW_AT_decl_line(0x73)
    4143                            .dwattr $C$DW$329, DW_AT_decl_column(0x10)
    4144                    
    4145                    $C$DW$330       .dwtag  DW_TAG_member
    4146                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    4147                            .dwattr $C$DW$330, DW_AT_name("PPSxMSTID_H")
    4148                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("PPSxMSTID_H")
    4149                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4150                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4151                            .dwattr $C$DW$330, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4152                            .dwattr $C$DW$330, DW_AT_decl_line(0x74)
    4153                            .dwattr $C$DW$330, DW_AT_decl_column(0x10)
    4154                    
    4155                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4156                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x72)
    4157                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x05)
    4158                            .dwendtag $C$DW$T$22
    4159                    
    4160                    
    4161                    $C$DW$T$29      .dwtag  DW_TAG_array_type
    4162                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$22)
    4163                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4164                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x40)
    4165                    $C$DW$331       .dwtag  DW_TAG_subrange_type
    4166                            .dwattr $C$DW$331, DW_AT_upper_bound(0x07)
    4167                    
    4168                            .dwendtag $C$DW$T$29
    4169                    
    4170                    
    4171                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4172                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    4173                    $C$DW$332       .dwtag  DW_TAG_member
    4174                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
    4175                            .dwattr $C$DW$332, DW_AT_name("PPSExMSTID_L")
    4176                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("PPSExMSTID_L")
    4177                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4178                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4179                            .dwattr $C$DW$332, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4180                            .dwattr $C$DW$332, DW_AT_decl_line(0x78)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   77

    4181                            .dwattr $C$DW$332, DW_AT_decl_column(0x10)
    4182                    
    4183                    $C$DW$333       .dwtag  DW_TAG_member
    4184                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
    4185                            .dwattr $C$DW$333, DW_AT_name("PPSExMSTID_H")
    4186                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("PPSExMSTID_H")
    4187                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4188                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4189                            .dwattr $C$DW$333, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4190                            .dwattr $C$DW$333, DW_AT_decl_line(0x79)
    4191                            .dwattr $C$DW$333, DW_AT_decl_column(0x10)
    4192                    
    4193                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4194                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x77)
    4195                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x05)
    4196                            .dwendtag $C$DW$T$23
    4197                    
    4198                    
    4199                    $C$DW$T$30      .dwtag  DW_TAG_array_type
    4200                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$23)
    4201                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    4202                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x100)
    4203                    $C$DW$334       .dwtag  DW_TAG_subrange_type
    4204                            .dwattr $C$DW$334, DW_AT_upper_bound(0x1f)
    4205                    
    4206                            .dwendtag $C$DW$T$30
    4207                    
    4208                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4209                            .dwattr $C$DW$T$2, DW_AT_name("void")
    4210                    
    4211                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    4212                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4213                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    4214                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4215                    
    4216                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    4217                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4218                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4219                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4220                    
    4221                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    4222                            .dwattr $C$DW$T$66, DW_AT_name("int8_t")
    4223                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$5)
    4224                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4225                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4226                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x2a)
    4227                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x1d)
    4228                    
    4229                    $C$DW$T$67      .dwtag  DW_TAG_typedef
    4230                            .dwattr $C$DW$T$67, DW_AT_name("int_least8_t")
    4231                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    4232                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4233                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4234                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x37)
    4235                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x17)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   78

    4236                    
    4237                    $C$DW$T$68      .dwtag  DW_TAG_typedef
    4238                            .dwattr $C$DW$T$68, DW_AT_name("sint8")
    4239                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$66)
    4240                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4241                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4242                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x68)
    4243                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
    4244                    
    4245                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    4246                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4247                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4248                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4249                    
    4250                    $C$DW$T$69      .dwtag  DW_TAG_typedef
    4251                            .dwattr $C$DW$T$69, DW_AT_name("uint8_t")
    4252                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$6)
    4253                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4254                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4255                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x2b)
    4256                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x1c)
    4257                    
    4258                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    4259                            .dwattr $C$DW$T$70, DW_AT_name("uint8")
    4260                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    4261                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4262                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4263                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x4b)
    4264                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x11)
    4265                    
    4266                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    4267                            .dwattr $C$DW$T$71, DW_AT_name("uint_least8_t")
    4268                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    4269                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    4270                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4271                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x38)
    4272                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x16)
    4273                    
    4274                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    4275                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4276                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4277                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4278                    
    4279                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    4280                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4281                            .dwattr $C$DW$T$8, DW_AT_name("short")
    4282                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4283                    
    4284                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    4285                            .dwattr $C$DW$T$72, DW_AT_name("int16_t")
    4286                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$8)
    4287                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4288                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4289                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x2c)
    4290                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   79

    4291                    
    4292                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    4293                            .dwattr $C$DW$T$73, DW_AT_name("int_least16_t")
    4294                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    4295                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4296                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4297                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x3a)
    4298                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x17)
    4299                    
    4300                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    4301                            .dwattr $C$DW$T$74, DW_AT_name("sint16")
    4302                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$72)
    4303                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4304                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4305                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x63)
    4306                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x11)
    4307                    
    4308                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    4309                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4310                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4311                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4312                    
    4313                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    4314                            .dwattr $C$DW$T$75, DW_AT_name("uint16_t")
    4315                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$9)
    4316                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4317                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4318                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2d)
    4319                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x1c)
    4320                    
    4321                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    4322                            .dwattr $C$DW$T$76, DW_AT_name("uint16")
    4323                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    4324                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4325                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4326                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x46)
    4327                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x12)
    4328                    
    4329                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    4330                            .dwattr $C$DW$T$77, DW_AT_name("uint_least16_t")
    4331                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$75)
    4332                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    4333                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4334                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x3b)
    4335                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x16)
    4336                    
    4337                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    4338                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4339                            .dwattr $C$DW$T$10, DW_AT_name("int")
    4340                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    4341                    
    4342                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    4343                            .dwattr $C$DW$T$78, DW_AT_name("int32_t")
    4344                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$10)
    4345                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   80

    4346                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4347                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x2e)
    4348                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x1d)
    4349                    
    4350                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    4351                            .dwattr $C$DW$T$79, DW_AT_name("int_fast16_t")
    4352                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    4353                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    4354                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4355                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x47)
    4356                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x17)
    4357                    
    4358                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    4359                            .dwattr $C$DW$T$80, DW_AT_name("int_fast32_t")
    4360                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$78)
    4361                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4362                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4363                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x4a)
    4364                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x17)
    4365                    
    4366                    $C$DW$T$81      .dwtag  DW_TAG_typedef
    4367                            .dwattr $C$DW$T$81, DW_AT_name("int_fast8_t")
    4368                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$78)
    4369                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4370                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4371                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x45)
    4372                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x17)
    4373                    
    4374                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    4375                            .dwattr $C$DW$T$82, DW_AT_name("int_least32_t")
    4376                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$78)
    4377                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    4378                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4379                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x3c)
    4380                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x17)
    4381                    
    4382                    $C$DW$T$83      .dwtag  DW_TAG_typedef
    4383                            .dwattr $C$DW$T$83, DW_AT_name("sint32")
    4384                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$78)
    4385                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4386                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4387                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x5e)
    4388                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x11)
    4389                    
    4390                    $C$DW$T$84      .dwtag  DW_TAG_typedef
    4391                            .dwattr $C$DW$T$84, DW_AT_name("intptr_t")
    4392                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$10)
    4393                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4394                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4395                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x52)
    4396                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x1a)
    4397                    
    4398                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    4399                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4400                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   81

    4401                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    4402                    
    4403                    $C$DW$T$19      .dwtag  DW_TAG_typedef
    4404                            .dwattr $C$DW$T$19, DW_AT_name("uint32_t")
    4405                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    4406                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4407                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4408                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2f)
    4409                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    4410                    
    4411                    $C$DW$T$20      .dwtag  DW_TAG_typedef
    4412                            .dwattr $C$DW$T$20, DW_AT_name("uint32")
    4413                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4414                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4415                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4416                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x41)
    4417                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x12)
    4418                    
    4419                    
    4420                    $C$DW$T$24      .dwtag  DW_TAG_array_type
    4421                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$20)
    4422                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4423                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    4424                    $C$DW$335       .dwtag  DW_TAG_subrange_type
    4425                            .dwattr $C$DW$335, DW_AT_upper_bound(0x01)
    4426                    
    4427                            .dwendtag $C$DW$T$24
    4428                    
    4429                    
    4430                    $C$DW$T$25      .dwtag  DW_TAG_array_type
    4431                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    4432                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4433                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4434                    $C$DW$336       .dwtag  DW_TAG_subrange_type
    4435                            .dwattr $C$DW$336, DW_AT_upper_bound(0x03)
    4436                    
    4437                            .dwendtag $C$DW$T$25
    4438                    
    4439                    
    4440                    $C$DW$T$26      .dwtag  DW_TAG_array_type
    4441                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
    4442                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    4443                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x138)
    4444                    $C$DW$337       .dwtag  DW_TAG_subrange_type
    4445                            .dwattr $C$DW$337, DW_AT_upper_bound(0x4d)
    4446                    
    4447                            .dwendtag $C$DW$T$26
    4448                    
    4449                    
    4450                    $C$DW$T$27      .dwtag  DW_TAG_array_type
    4451                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
    4452                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4453                            .dwattr $C$DW$T$27, DW_AT_byte_size(0xf4)
    4454                    $C$DW$338       .dwtag  DW_TAG_subrange_type
    4455                            .dwattr $C$DW$338, DW_AT_upper_bound(0x3c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   82

    4456                    
    4457                            .dwendtag $C$DW$T$27
    4458                    
    4459                    
    4460                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    4461                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$20)
    4462                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4463                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x80)
    4464                    $C$DW$339       .dwtag  DW_TAG_subrange_type
    4465                            .dwattr $C$DW$339, DW_AT_upper_bound(0x1f)
    4466                    
    4467                            .dwendtag $C$DW$T$31
    4468                    
    4469                    
    4470                    $C$DW$T$32      .dwtag  DW_TAG_array_type
    4471                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$20)
    4472                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4473                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x20)
    4474                    $C$DW$340       .dwtag  DW_TAG_subrange_type
    4475                            .dwattr $C$DW$340, DW_AT_upper_bound(0x07)
    4476                    
    4477                            .dwendtag $C$DW$T$32
    4478                    
    4479                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    4480                            .dwattr $C$DW$T$89, DW_AT_name("uint_fast16_t")
    4481                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$19)
    4482                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4483                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4484                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x48)
    4485                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x16)
    4486                    
    4487                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    4488                            .dwattr $C$DW$T$90, DW_AT_name("uint_fast32_t")
    4489                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$19)
    4490                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4491                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4492                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x4b)
    4493                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x16)
    4494                    
    4495                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    4496                            .dwattr $C$DW$T$91, DW_AT_name("uint_fast8_t")
    4497                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$19)
    4498                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    4499                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4500                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x46)
    4501                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x16)
    4502                    
    4503                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    4504                            .dwattr $C$DW$T$92, DW_AT_name("uint_least32_t")
    4505                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$19)
    4506                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    4507                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4508                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x3d)
    4509                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x16)
    4510                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   83

    4511                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    4512                            .dwattr $C$DW$T$93, DW_AT_name("uintptr_t")
    4513                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$11)
    4514                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    4515                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4516                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x53)
    4517                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x1a)
    4518                    
    4519                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    4520                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4521                            .dwattr $C$DW$T$12, DW_AT_name("long")
    4522                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    4523                    
    4524                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    4525                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4526                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4527                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    4528                    
    4529                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    4530                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4531                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    4532                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4533                    
    4534                    $C$DW$T$94      .dwtag  DW_TAG_typedef
    4535                            .dwattr $C$DW$T$94, DW_AT_name("int64_t")
    4536                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$14)
    4537                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    4538                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4539                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x32)
    4540                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x21)
    4541                    
    4542                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    4543                            .dwattr $C$DW$T$95, DW_AT_name("int_fast64_t")
    4544                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    4545                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    4546                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4547                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x4e)
    4548                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x17)
    4549                    
    4550                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    4551                            .dwattr $C$DW$T$96, DW_AT_name("int_least64_t")
    4552                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$94)
    4553                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4554                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4555                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x40)
    4556                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x17)
    4557                    
    4558                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    4559                            .dwattr $C$DW$T$97, DW_AT_name("sint64")
    4560                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$94)
    4561                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    4562                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    4563                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x59)
    4564                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x11)
    4565                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   84

    4566                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    4567                            .dwattr $C$DW$T$98, DW_AT_name("intmax_t")
    4568                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$14)
    4569                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4570                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4571                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x56)
    4572                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x20)
    4573                    
    4574                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    4575                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4576                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4577                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4578                    
    4579                    $C$DW$T$99      .dwtag  DW_TAG_typedef
    4580                            .dwattr $C$DW$T$99, DW_AT_name("uint64_t")
    4581                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$15)
    4582                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    4583                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include/
    4584                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x33)
    4585                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x20)
    4586                    
    4587                    $C$DW$T$100     .dwtag  DW_TAG_typedef
    4588                            .dwattr $C$DW$T$100, DW_AT_name("uint64")
    4589                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    4590                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    4591                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    4592                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x3c)
    4593                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x12)
    4594                    
    4595                    $C$DW$T$101     .dwtag  DW_TAG_typedef
    4596                            .dwattr $C$DW$T$101, DW_AT_name("uint_fast64_t")
    4597                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$99)
    4598                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    4599                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    4600                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x4f)
    4601                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    4602                    
    4603                    $C$DW$T$102     .dwtag  DW_TAG_typedef
    4604                            .dwattr $C$DW$T$102, DW_AT_name("uint_least64_t")
    4605                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$99)
    4606                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    4607                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    4608                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x41)
    4609                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x16)
    4610                    
    4611                    $C$DW$T$103     .dwtag  DW_TAG_typedef
    4612                            .dwattr $C$DW$T$103, DW_AT_name("uintmax_t")
    4613                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$15)
    4614                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    4615                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    4616                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x57)
    4617                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x20)
    4618                    
    4619                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    4620                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   85

    4621                            .dwattr $C$DW$T$16, DW_AT_name("float")
    4622                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4623                    
    4624                    $C$DW$T$104     .dwtag  DW_TAG_typedef
    4625                            .dwattr $C$DW$T$104, DW_AT_name("float32")
    4626                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$16)
    4627                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    4628                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    4629                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x6d)
    4630                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x0f)
    4631                    
    4632                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    4633                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4634                            .dwattr $C$DW$T$17, DW_AT_name("double")
    4635                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    4636                    
    4637                    $C$DW$T$105     .dwtag  DW_TAG_typedef
    4638                            .dwattr $C$DW$T$105, DW_AT_name("float64")
    4639                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$17)
    4640                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    4641                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    4642                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x72)
    4643                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x10)
    4644                    
    4645                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    4646                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4647                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    4648                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    4649                    
    4650                    $C$DW$T$106     .dwtag  DW_TAG_base_type
    4651                            .dwattr $C$DW$T$106, DW_AT_encoding(DW_ATE_unsigned_char)
    4652                            .dwattr $C$DW$T$106, DW_AT_name("unsigned char")
    4653                            .dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
    4654                    
    4655                    $C$DW$T$107     .dwtag  DW_TAG_typedef
    4656                            .dwattr $C$DW$T$107, DW_AT_name("boolean")
    4657                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    4658                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4659                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    4660                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x53)
    4661                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x0f)
    4662                    
    4663                    $C$DW$T$108     .dwtag  DW_TAG_typedef
    4664                            .dwattr $C$DW$T$108, DW_AT_name("tBoolean")
    4665                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    4666                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    4667                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    4668                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x40)
    4669                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x11)
    4670                    
    4671                    
    4672                    $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
    4673                            .dwattr $C$DW$T$109, DW_AT_name("config_value_type")
    4674                            .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    4675                    $C$DW$341       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   86

    4676                            .dwattr $C$DW$341, DW_AT_name("InitialValue")
    4677                            .dwattr $C$DW$341, DW_AT_const_value(0x00)
    4678                            .dwattr $C$DW$341, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4679                            .dwattr $C$DW$341, DW_AT_decl_line(0x5c)
    4680                            .dwattr $C$DW$341, DW_AT_decl_column(0x02)
    4681                    
    4682                    $C$DW$342       .dwtag  DW_TAG_enumerator
    4683                            .dwattr $C$DW$342, DW_AT_name("CurrentValue")
    4684                            .dwattr $C$DW$342, DW_AT_const_value(0x01)
    4685                            .dwattr $C$DW$342, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4686                            .dwattr $C$DW$342, DW_AT_decl_line(0x5d)
    4687                            .dwattr $C$DW$342, DW_AT_decl_column(0x02)
    4688                    
    4689                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    4690                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x5a)
    4691                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x0e)
    4692                            .dwendtag $C$DW$T$109
    4693                    
    4694                    $C$DW$T$110     .dwtag  DW_TAG_typedef
    4695                            .dwattr $C$DW$T$110, DW_AT_name("config_value_type_t")
    4696                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    4697                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    4698                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    4699                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x5e)
    4700                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x02)
    4701                    
    4702                    
    4703                    $C$DW$T$111     .dwtag  DW_TAG_enumeration_type
    4704                            .dwattr $C$DW$T$111, DW_AT_name("loopBackType")
    4705                            .dwattr $C$DW$T$111, DW_AT_byte_size(0x01)
    4706                    $C$DW$343       .dwtag  DW_TAG_enumerator
    4707                            .dwattr $C$DW$343, DW_AT_name("Digital_Lbk")
    4708                            .dwattr $C$DW$343, DW_AT_const_value(0x00)
    4709                            .dwattr $C$DW$343, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4710                            .dwattr $C$DW$343, DW_AT_decl_line(0x4e)
    4711                            .dwattr $C$DW$343, DW_AT_decl_column(0x05)
    4712                    
    4713                    $C$DW$344       .dwtag  DW_TAG_enumerator
    4714                            .dwattr $C$DW$344, DW_AT_name("Analog_Lbk")
    4715                            .dwattr $C$DW$344, DW_AT_const_value(0x01)
    4716                            .dwattr $C$DW$344, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4717                            .dwattr $C$DW$344, DW_AT_decl_line(0x4f)
    4718                            .dwattr $C$DW$344, DW_AT_decl_column(0x05)
    4719                    
    4720                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    4721                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x4c)
    4722                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x0e)
    4723                            .dwendtag $C$DW$T$111
    4724                    
    4725                    $C$DW$T$112     .dwtag  DW_TAG_typedef
    4726                            .dwattr $C$DW$T$112, DW_AT_name("loopBackType_t")
    4727                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    4728                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    4729                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    4730                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x50)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   87

    4731                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x02)
    4732                    
    4733                    
    4734                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4735                            .dwattr $C$DW$T$33, DW_AT_name("pcrBase")
    4736                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x5e0)
    4737                    $C$DW$345       .dwtag  DW_TAG_member
    4738                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    4739                            .dwattr $C$DW$345, DW_AT_name("PMPROTSET0")
    4740                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("PMPROTSET0")
    4741                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4742                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4743                            .dwattr $C$DW$345, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4744                            .dwattr $C$DW$345, DW_AT_decl_line(0x45)
    4745                            .dwattr $C$DW$345, DW_AT_decl_column(0x0c)
    4746                    
    4747                    $C$DW$346       .dwtag  DW_TAG_member
    4748                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    4749                            .dwattr $C$DW$346, DW_AT_name("PMPROTSET1")
    4750                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("PMPROTSET1")
    4751                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4752                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4753                            .dwattr $C$DW$346, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4754                            .dwattr $C$DW$346, DW_AT_decl_line(0x46)
    4755                            .dwattr $C$DW$346, DW_AT_decl_column(0x0c)
    4756                    
    4757                    $C$DW$347       .dwtag  DW_TAG_member
    4758                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$24)
    4759                            .dwattr $C$DW$347, DW_AT_name("rsvd1")
    4760                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("rsvd1")
    4761                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4762                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4763                            .dwattr $C$DW$347, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4764                            .dwattr $C$DW$347, DW_AT_decl_line(0x47)
    4765                            .dwattr $C$DW$347, DW_AT_decl_column(0x0c)
    4766                    
    4767                    $C$DW$348       .dwtag  DW_TAG_member
    4768                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    4769                            .dwattr $C$DW$348, DW_AT_name("PMPROTCLR0")
    4770                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("PMPROTCLR0")
    4771                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4772                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4773                            .dwattr $C$DW$348, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4774                            .dwattr $C$DW$348, DW_AT_decl_line(0x48)
    4775                            .dwattr $C$DW$348, DW_AT_decl_column(0x0c)
    4776                    
    4777                    $C$DW$349       .dwtag  DW_TAG_member
    4778                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    4779                            .dwattr $C$DW$349, DW_AT_name("PMPROTCLR1")
    4780                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("PMPROTCLR1")
    4781                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4782                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4783                            .dwattr $C$DW$349, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4784                            .dwattr $C$DW$349, DW_AT_decl_line(0x49)
    4785                            .dwattr $C$DW$349, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   88

    4786                    
    4787                    $C$DW$350       .dwtag  DW_TAG_member
    4788                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$24)
    4789                            .dwattr $C$DW$350, DW_AT_name("rsvd2")
    4790                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("rsvd2")
    4791                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4792                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4793                            .dwattr $C$DW$350, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4794                            .dwattr $C$DW$350, DW_AT_decl_line(0x4a)
    4795                            .dwattr $C$DW$350, DW_AT_decl_column(0x0c)
    4796                    
    4797                    $C$DW$351       .dwtag  DW_TAG_member
    4798                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    4799                            .dwattr $C$DW$351, DW_AT_name("PPROTSET0")
    4800                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("PPROTSET0")
    4801                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4802                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4803                            .dwattr $C$DW$351, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4804                            .dwattr $C$DW$351, DW_AT_decl_line(0x4b)
    4805                            .dwattr $C$DW$351, DW_AT_decl_column(0x0c)
    4806                    
    4807                    $C$DW$352       .dwtag  DW_TAG_member
    4808                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    4809                            .dwattr $C$DW$352, DW_AT_name("PPROTSET1")
    4810                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("PPROTSET1")
    4811                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4812                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4813                            .dwattr $C$DW$352, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4814                            .dwattr $C$DW$352, DW_AT_decl_line(0x4c)
    4815                            .dwattr $C$DW$352, DW_AT_decl_column(0x0c)
    4816                    
    4817                    $C$DW$353       .dwtag  DW_TAG_member
    4818                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    4819                            .dwattr $C$DW$353, DW_AT_name("PPROTSET2")
    4820                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("PPROTSET2")
    4821                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4822                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4823                            .dwattr $C$DW$353, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4824                            .dwattr $C$DW$353, DW_AT_decl_line(0x4d)
    4825                            .dwattr $C$DW$353, DW_AT_decl_column(0x0c)
    4826                    
    4827                    $C$DW$354       .dwtag  DW_TAG_member
    4828                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    4829                            .dwattr $C$DW$354, DW_AT_name("PPROTSET3")
    4830                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("PPROTSET3")
    4831                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4832                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4833                            .dwattr $C$DW$354, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4834                            .dwattr $C$DW$354, DW_AT_decl_line(0x4e)
    4835                            .dwattr $C$DW$354, DW_AT_decl_column(0x0c)
    4836                    
    4837                    $C$DW$355       .dwtag  DW_TAG_member
    4838                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$25)
    4839                            .dwattr $C$DW$355, DW_AT_name("rsvd3")
    4840                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("rsvd3")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   89

    4841                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4842                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4843                            .dwattr $C$DW$355, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4844                            .dwattr $C$DW$355, DW_AT_decl_line(0x4f)
    4845                            .dwattr $C$DW$355, DW_AT_decl_column(0x0c)
    4846                    
    4847                    $C$DW$356       .dwtag  DW_TAG_member
    4848                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    4849                            .dwattr $C$DW$356, DW_AT_name("PPROTCLR0")
    4850                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("PPROTCLR0")
    4851                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4852                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4853                            .dwattr $C$DW$356, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4854                            .dwattr $C$DW$356, DW_AT_decl_line(0x50)
    4855                            .dwattr $C$DW$356, DW_AT_decl_column(0x0c)
    4856                    
    4857                    $C$DW$357       .dwtag  DW_TAG_member
    4858                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    4859                            .dwattr $C$DW$357, DW_AT_name("PPROTCLR1")
    4860                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("PPROTCLR1")
    4861                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4862                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4863                            .dwattr $C$DW$357, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4864                            .dwattr $C$DW$357, DW_AT_decl_line(0x51)
    4865                            .dwattr $C$DW$357, DW_AT_decl_column(0x0c)
    4866                    
    4867                    $C$DW$358       .dwtag  DW_TAG_member
    4868                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    4869                            .dwattr $C$DW$358, DW_AT_name("PPROTCLR2")
    4870                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("PPROTCLR2")
    4871                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4872                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4873                            .dwattr $C$DW$358, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4874                            .dwattr $C$DW$358, DW_AT_decl_line(0x52)
    4875                            .dwattr $C$DW$358, DW_AT_decl_column(0x0c)
    4876                    
    4877                    $C$DW$359       .dwtag  DW_TAG_member
    4878                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    4879                            .dwattr $C$DW$359, DW_AT_name("PPROTCLR3")
    4880                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("PPROTCLR3")
    4881                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4882                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4883                            .dwattr $C$DW$359, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4884                            .dwattr $C$DW$359, DW_AT_decl_line(0x53)
    4885                            .dwattr $C$DW$359, DW_AT_decl_column(0x0c)
    4886                    
    4887                    $C$DW$360       .dwtag  DW_TAG_member
    4888                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$25)
    4889                            .dwattr $C$DW$360, DW_AT_name("rsvd4")
    4890                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("rsvd4")
    4891                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4892                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4893                            .dwattr $C$DW$360, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4894                            .dwattr $C$DW$360, DW_AT_decl_line(0x54)
    4895                            .dwattr $C$DW$360, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   90

    4896                    
    4897                    $C$DW$361       .dwtag  DW_TAG_member
    4898                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    4899                            .dwattr $C$DW$361, DW_AT_name("PCSPWRDWNSET0")
    4900                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("PCSPWRDWNSET0")
    4901                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4902                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4903                            .dwattr $C$DW$361, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4904                            .dwattr $C$DW$361, DW_AT_decl_line(0x55)
    4905                            .dwattr $C$DW$361, DW_AT_decl_column(0x0c)
    4906                    
    4907                    $C$DW$362       .dwtag  DW_TAG_member
    4908                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    4909                            .dwattr $C$DW$362, DW_AT_name("PCSPWRDWNSET1")
    4910                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("PCSPWRDWNSET1")
    4911                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4912                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4913                            .dwattr $C$DW$362, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4914                            .dwattr $C$DW$362, DW_AT_decl_line(0x56)
    4915                            .dwattr $C$DW$362, DW_AT_decl_column(0x0c)
    4916                    
    4917                    $C$DW$363       .dwtag  DW_TAG_member
    4918                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$24)
    4919                            .dwattr $C$DW$363, DW_AT_name("rsvd5")
    4920                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("rsvd5")
    4921                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4922                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4923                            .dwattr $C$DW$363, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4924                            .dwattr $C$DW$363, DW_AT_decl_line(0x57)
    4925                            .dwattr $C$DW$363, DW_AT_decl_column(0x0c)
    4926                    
    4927                    $C$DW$364       .dwtag  DW_TAG_member
    4928                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    4929                            .dwattr $C$DW$364, DW_AT_name("PCSPWRDWNCLR0")
    4930                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("PCSPWRDWNCLR0")
    4931                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    4932                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4933                            .dwattr $C$DW$364, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4934                            .dwattr $C$DW$364, DW_AT_decl_line(0x58)
    4935                            .dwattr $C$DW$364, DW_AT_decl_column(0x0c)
    4936                    
    4937                    $C$DW$365       .dwtag  DW_TAG_member
    4938                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    4939                            .dwattr $C$DW$365, DW_AT_name("PCSPWRDWNCLR1")
    4940                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("PCSPWRDWNCLR1")
    4941                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    4942                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4943                            .dwattr $C$DW$365, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4944                            .dwattr $C$DW$365, DW_AT_decl_line(0x59)
    4945                            .dwattr $C$DW$365, DW_AT_decl_column(0x0c)
    4946                    
    4947                    $C$DW$366       .dwtag  DW_TAG_member
    4948                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$24)
    4949                            .dwattr $C$DW$366, DW_AT_name("rsvd6")
    4950                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("rsvd6")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   91

    4951                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4952                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4953                            .dwattr $C$DW$366, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4954                            .dwattr $C$DW$366, DW_AT_decl_line(0x5a)
    4955                            .dwattr $C$DW$366, DW_AT_decl_column(0x0c)
    4956                    
    4957                    $C$DW$367       .dwtag  DW_TAG_member
    4958                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    4959                            .dwattr $C$DW$367, DW_AT_name("PSPWRDWNSET0")
    4960                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("PSPWRDWNSET0")
    4961                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    4962                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4963                            .dwattr $C$DW$367, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4964                            .dwattr $C$DW$367, DW_AT_decl_line(0x5b)
    4965                            .dwattr $C$DW$367, DW_AT_decl_column(0x0c)
    4966                    
    4967                    $C$DW$368       .dwtag  DW_TAG_member
    4968                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    4969                            .dwattr $C$DW$368, DW_AT_name("PSPWRDWNSET1")
    4970                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("PSPWRDWNSET1")
    4971                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4972                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4973                            .dwattr $C$DW$368, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4974                            .dwattr $C$DW$368, DW_AT_decl_line(0x5c)
    4975                            .dwattr $C$DW$368, DW_AT_decl_column(0x0c)
    4976                    
    4977                    $C$DW$369       .dwtag  DW_TAG_member
    4978                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    4979                            .dwattr $C$DW$369, DW_AT_name("PSPWRDWNSET2")
    4980                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("PSPWRDWNSET2")
    4981                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    4982                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4983                            .dwattr $C$DW$369, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4984                            .dwattr $C$DW$369, DW_AT_decl_line(0x5d)
    4985                            .dwattr $C$DW$369, DW_AT_decl_column(0x0c)
    4986                    
    4987                    $C$DW$370       .dwtag  DW_TAG_member
    4988                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    4989                            .dwattr $C$DW$370, DW_AT_name("PSPWRDWNSET3")
    4990                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("PSPWRDWNSET3")
    4991                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    4992                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4993                            .dwattr $C$DW$370, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    4994                            .dwattr $C$DW$370, DW_AT_decl_line(0x5e)
    4995                            .dwattr $C$DW$370, DW_AT_decl_column(0x0c)
    4996                    
    4997                    $C$DW$371       .dwtag  DW_TAG_member
    4998                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$25)
    4999                            .dwattr $C$DW$371, DW_AT_name("rsvd7")
    5000                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("rsvd7")
    5001                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    5002                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5003                            .dwattr $C$DW$371, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5004                            .dwattr $C$DW$371, DW_AT_decl_line(0x5f)
    5005                            .dwattr $C$DW$371, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   92

    5006                    
    5007                    $C$DW$372       .dwtag  DW_TAG_member
    5008                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    5009                            .dwattr $C$DW$372, DW_AT_name("PSPWRDWNCLR0")
    5010                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("PSPWRDWNCLR0")
    5011                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5012                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    5013                            .dwattr $C$DW$372, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5014                            .dwattr $C$DW$372, DW_AT_decl_line(0x60)
    5015                            .dwattr $C$DW$372, DW_AT_decl_column(0x0c)
    5016                    
    5017                    $C$DW$373       .dwtag  DW_TAG_member
    5018                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    5019                            .dwattr $C$DW$373, DW_AT_name("PSPWRDWNCLR1")
    5020                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("PSPWRDWNCLR1")
    5021                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5022                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    5023                            .dwattr $C$DW$373, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5024                            .dwattr $C$DW$373, DW_AT_decl_line(0x61)
    5025                            .dwattr $C$DW$373, DW_AT_decl_column(0x0c)
    5026                    
    5027                    $C$DW$374       .dwtag  DW_TAG_member
    5028                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    5029                            .dwattr $C$DW$374, DW_AT_name("PSPWRDWNCLR2")
    5030                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("PSPWRDWNCLR2")
    5031                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5032                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5033                            .dwattr $C$DW$374, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5034                            .dwattr $C$DW$374, DW_AT_decl_line(0x62)
    5035                            .dwattr $C$DW$374, DW_AT_decl_column(0x0c)
    5036                    
    5037                    $C$DW$375       .dwtag  DW_TAG_member
    5038                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    5039                            .dwattr $C$DW$375, DW_AT_name("PSPWRDWNCLR3")
    5040                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("PSPWRDWNCLR3")
    5041                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    5042                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    5043                            .dwattr $C$DW$375, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5044                            .dwattr $C$DW$375, DW_AT_decl_line(0x63)
    5045                            .dwattr $C$DW$375, DW_AT_decl_column(0x0c)
    5046                    
    5047                    $C$DW$376       .dwtag  DW_TAG_member
    5048                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$25)
    5049                            .dwattr $C$DW$376, DW_AT_name("rsvd8")
    5050                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("rsvd8")
    5051                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    5052                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    5053                            .dwattr $C$DW$376, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5054                            .dwattr $C$DW$376, DW_AT_decl_line(0x64)
    5055                            .dwattr $C$DW$376, DW_AT_decl_column(0x0c)
    5056                    
    5057                    $C$DW$377       .dwtag  DW_TAG_member
    5058                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    5059                            .dwattr $C$DW$377, DW_AT_name("PDPWRDWNSET")
    5060                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("PDPWRDWNSET")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   93

    5061                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5062                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    5063                            .dwattr $C$DW$377, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5064                            .dwattr $C$DW$377, DW_AT_decl_line(0x65)
    5065                            .dwattr $C$DW$377, DW_AT_decl_column(0x0c)
    5066                    
    5067                    $C$DW$378       .dwtag  DW_TAG_member
    5068                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    5069                            .dwattr $C$DW$378, DW_AT_name("PDPWRDWNCLR")
    5070                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("PDPWRDWNCLR")
    5071                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    5072                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    5073                            .dwattr $C$DW$378, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5074                            .dwattr $C$DW$378, DW_AT_decl_line(0x66)
    5075                            .dwattr $C$DW$378, DW_AT_decl_column(0x0c)
    5076                    
    5077                    $C$DW$379       .dwtag  DW_TAG_member
    5078                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$26)
    5079                            .dwattr $C$DW$379, DW_AT_name("rsvd9")
    5080                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("rsvd9")
    5081                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    5082                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    5083                            .dwattr $C$DW$379, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5084                            .dwattr $C$DW$379, DW_AT_decl_line(0x67)
    5085                            .dwattr $C$DW$379, DW_AT_decl_column(0x0c)
    5086                    
    5087                    $C$DW$380       .dwtag  DW_TAG_member
    5088                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    5089                            .dwattr $C$DW$380, DW_AT_name("MSTIDWRENA")
    5090                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("MSTIDWRENA")
    5091                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    5092                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    5093                            .dwattr $C$DW$380, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5094                            .dwattr $C$DW$380, DW_AT_decl_line(0x68)
    5095                            .dwattr $C$DW$380, DW_AT_decl_column(0x0c)
    5096                    
    5097                    $C$DW$381       .dwtag  DW_TAG_member
    5098                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    5099                            .dwattr $C$DW$381, DW_AT_name("MSTIDENA")
    5100                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("MSTIDENA")
    5101                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
    5102                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    5103                            .dwattr $C$DW$381, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5104                            .dwattr $C$DW$381, DW_AT_decl_line(0x69)
    5105                            .dwattr $C$DW$381, DW_AT_decl_column(0x0c)
    5106                    
    5107                    $C$DW$382       .dwtag  DW_TAG_member
    5108                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    5109                            .dwattr $C$DW$382, DW_AT_name("MSTIDDIAGCTRL")
    5110                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("MSTIDDIAGCTRL")
    5111                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    5112                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    5113                            .dwattr $C$DW$382, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5114                            .dwattr $C$DW$382, DW_AT_decl_line(0x6a)
    5115                            .dwattr $C$DW$382, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   94

    5116                    
    5117                    $C$DW$383       .dwtag  DW_TAG_member
    5118                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$27)
    5119                            .dwattr $C$DW$383, DW_AT_name("rsvd10")
    5120                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("rsvd10")
    5121                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
    5122                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    5123                            .dwattr $C$DW$383, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5124                            .dwattr $C$DW$383, DW_AT_decl_line(0x6b)
    5125                            .dwattr $C$DW$383, DW_AT_decl_column(0x0c)
    5126                    
    5127                    $C$DW$384       .dwtag  DW_TAG_member
    5128                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$28)
    5129                            .dwattr $C$DW$384, DW_AT_name("PSxMSTID")
    5130                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("PSxMSTID")
    5131                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    5132                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    5133                            .dwattr $C$DW$384, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5134                            .dwattr $C$DW$384, DW_AT_decl_line(0x70)
    5135                            .dwattr $C$DW$384, DW_AT_decl_column(0x06)
    5136                    
    5137                    $C$DW$385       .dwtag  DW_TAG_member
    5138                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$29)
    5139                            .dwattr $C$DW$385, DW_AT_name("PPSxMSTID")
    5140                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("PPSxMSTID")
    5141                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
    5142                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    5143                            .dwattr $C$DW$385, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5144                            .dwattr $C$DW$385, DW_AT_decl_line(0x75)
    5145                            .dwattr $C$DW$385, DW_AT_decl_column(0x06)
    5146                    
    5147                    $C$DW$386       .dwtag  DW_TAG_member
    5148                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$30)
    5149                            .dwattr $C$DW$386, DW_AT_name("PPSExMSTID")
    5150                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("PPSExMSTID")
    5151                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x440]
    5152                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5153                            .dwattr $C$DW$386, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5154                            .dwattr $C$DW$386, DW_AT_decl_line(0x7a)
    5155                            .dwattr $C$DW$386, DW_AT_decl_column(0x06)
    5156                    
    5157                    $C$DW$387       .dwtag  DW_TAG_member
    5158                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$31)
    5159                            .dwattr $C$DW$387, DW_AT_name("PCSxMSTID")
    5160                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("PCSxMSTID")
    5161                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x540]
    5162                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5163                            .dwattr $C$DW$387, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5164                            .dwattr $C$DW$387, DW_AT_decl_line(0x7b)
    5165                            .dwattr $C$DW$387, DW_AT_decl_column(0x0c)
    5166                    
    5167                    $C$DW$388       .dwtag  DW_TAG_member
    5168                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$32)
    5169                            .dwattr $C$DW$388, DW_AT_name("PPCSxMSTID")
    5170                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("PPCSxMSTID")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   95

    5171                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c0]
    5172                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    5173                            .dwattr $C$DW$388, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    5174                            .dwattr $C$DW$388, DW_AT_decl_line(0x7c)
    5175                            .dwattr $C$DW$388, DW_AT_decl_column(0x0c)
    5176                    
    5177                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    5178                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x43)
    5179                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x19)
    5180                            .dwendtag $C$DW$T$33
    5181                    
    5182                    $C$DW$T$55      .dwtag  DW_TAG_volatile_type
    5183                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$33)
    5184                    
    5185                    $C$DW$T$56      .dwtag  DW_TAG_typedef
    5186                            .dwattr $C$DW$T$56, DW_AT_name("pcrBASE_t")
    5187                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    5188                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    5189                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    5190                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x7d)
    5191                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x03)
    5192                    
    5193                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    5194                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    5195                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    5196                    
    5197                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    5198                    
    5199                    ;***************************************************************
    5200                    ;* DWARF CIE ENTRIES                                           *
    5201                    ;***************************************************************
    5202                    
    5203                    $C$DW$CIE       .dwcie 14
    5204                            .dwcfi  cfa_register, 13
    5205                            .dwcfi  cfa_offset, 0
    5206                            .dwcfi  same_value, 4
    5207                            .dwcfi  same_value, 5
    5208                            .dwcfi  same_value, 6
    5209                            .dwcfi  same_value, 7
    5210                            .dwcfi  same_value, 8
    5211                            .dwcfi  same_value, 9
    5212                            .dwcfi  same_value, 10
    5213                            .dwcfi  same_value, 11
    5214                            .dwcfi  same_value, 80
    5215                            .dwcfi  same_value, 81
    5216                            .dwcfi  same_value, 82
    5217                            .dwcfi  same_value, 83
    5218                            .dwcfi  same_value, 84
    5219                            .dwcfi  same_value, 85
    5220                            .dwcfi  same_value, 86
    5221                            .dwcfi  same_value, 87
    5222                            .dwcfi  same_value, 88
    5223                            .dwcfi  same_value, 89
    5224                            .dwcfi  same_value, 90
    5225                            .dwcfi  same_value, 91
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1183610                              PAGE   96

    5226                            .dwcfi  same_value, 92
    5227                            .dwcfi  same_value, 93
