TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 13:27:11 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_sys_vim.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    2626                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$106)
    2627                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2628                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    2629                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x41)
    2630                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x16)
    2631                    
    2632                    $C$DW$T$110     .dwtag  DW_TAG_typedef
    2633                            .dwattr $C$DW$T$110, DW_AT_name("uintmax_t")
    2634                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$15)
    2635                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    2636                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/include
    2637                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x57)
    2638                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x20)
    2639                    
    2640                    $C$DW$T$16      .dwtag  DW_TAG_base_type
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   49

    2641                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2642                            .dwattr $C$DW$T$16, DW_AT_name("float")
    2643                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    2644                    
    2645                    $C$DW$T$111     .dwtag  DW_TAG_typedef
    2646                            .dwattr $C$DW$T$111, DW_AT_name("float32")
    2647                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$16)
    2648                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    2649                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2650                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x6d)
    2651                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x0f)
    2652                    
    2653                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    2654                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2655                            .dwattr $C$DW$T$17, DW_AT_name("double")
    2656                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    2657                    
    2658                    $C$DW$T$112     .dwtag  DW_TAG_typedef
    2659                            .dwattr $C$DW$T$112, DW_AT_name("float64")
    2660                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$17)
    2661                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    2662                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2663                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x72)
    2664                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x10)
    2665                    
    2666                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    2667                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2668                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    2669                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    2670                    
    2671                    $C$DW$T$113     .dwtag  DW_TAG_base_type
    2672                            .dwattr $C$DW$T$113, DW_AT_encoding(DW_ATE_unsigned_char)
    2673                            .dwattr $C$DW$T$113, DW_AT_name("unsigned char")
    2674                            .dwattr $C$DW$T$113, DW_AT_byte_size(0x01)
    2675                    
    2676                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    2677                            .dwattr $C$DW$T$114, DW_AT_name("boolean")
    2678                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    2679                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2680                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2681                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x53)
    2682                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x0f)
    2683                    
    2684                    $C$DW$T$115     .dwtag  DW_TAG_typedef
    2685                            .dwattr $C$DW$T$115, DW_AT_name("tBoolean")
    2686                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    2687                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    2688                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2689                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x40)
    2690                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x11)
    2691                    
    2692                    
    2693                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2694                            .dwattr $C$DW$T$21, DW_AT_name("ccmr5Base")
    2695                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x28)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   50

    2696                    $C$DW$79        .dwtag  DW_TAG_member
    2697                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    2698                            .dwattr $C$DW$79, DW_AT_name("CCMSR1")
    2699                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("CCMSR1")
    2700                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    2702                            .dwattr $C$DW$79, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2703                            .dwattr $C$DW$79, DW_AT_decl_line(0x45)
    2704                            .dwattr $C$DW$79, DW_AT_decl_column(0x0c)
    2705                    
    2706                    $C$DW$80        .dwtag  DW_TAG_member
    2707                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    2708                            .dwattr $C$DW$80, DW_AT_name("CCMKEYR1")
    2709                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("CCMKEYR1")
    2710                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2711                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    2712                            .dwattr $C$DW$80, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2713                            .dwattr $C$DW$80, DW_AT_decl_line(0x46)
    2714                            .dwattr $C$DW$80, DW_AT_decl_column(0x0c)
    2715                    
    2716                    $C$DW$81        .dwtag  DW_TAG_member
    2717                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    2718                            .dwattr $C$DW$81, DW_AT_name("CCMSR2")
    2719                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("CCMSR2")
    2720                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2721                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    2722                            .dwattr $C$DW$81, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2723                            .dwattr $C$DW$81, DW_AT_decl_line(0x47)
    2724                            .dwattr $C$DW$81, DW_AT_decl_column(0x0c)
    2725                    
    2726                    $C$DW$82        .dwtag  DW_TAG_member
    2727                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    2728                            .dwattr $C$DW$82, DW_AT_name("CCMKEYR2")
    2729                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("CCMKEYR2")
    2730                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2731                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    2732                            .dwattr $C$DW$82, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2733                            .dwattr $C$DW$82, DW_AT_decl_line(0x48)
    2734                            .dwattr $C$DW$82, DW_AT_decl_column(0x0c)
    2735                    
    2736                    $C$DW$83        .dwtag  DW_TAG_member
    2737                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    2738                            .dwattr $C$DW$83, DW_AT_name("CCMSR3")
    2739                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("CCMSR3")
    2740                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2741                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2742                            .dwattr $C$DW$83, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2743                            .dwattr $C$DW$83, DW_AT_decl_line(0x49)
    2744                            .dwattr $C$DW$83, DW_AT_decl_column(0x0c)
    2745                    
    2746                    $C$DW$84        .dwtag  DW_TAG_member
    2747                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    2748                            .dwattr $C$DW$84, DW_AT_name("CCMKEYR3")
    2749                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("CCMKEYR3")
    2750                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   51

    2751                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2752                            .dwattr $C$DW$84, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2753                            .dwattr $C$DW$84, DW_AT_decl_line(0x4a)
    2754                            .dwattr $C$DW$84, DW_AT_decl_column(0x0c)
    2755                    
    2756                    $C$DW$85        .dwtag  DW_TAG_member
    2757                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    2758                            .dwattr $C$DW$85, DW_AT_name("CCMPOLCNTRL")
    2759                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("CCMPOLCNTRL")
    2760                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2761                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2762                            .dwattr $C$DW$85, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2763                            .dwattr $C$DW$85, DW_AT_decl_line(0x4b)
    2764                            .dwattr $C$DW$85, DW_AT_decl_column(0x0c)
    2765                    
    2766                    $C$DW$86        .dwtag  DW_TAG_member
    2767                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    2768                            .dwattr $C$DW$86, DW_AT_name("CCMSR4")
    2769                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("CCMSR4")
    2770                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2771                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2772                            .dwattr $C$DW$86, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2773                            .dwattr $C$DW$86, DW_AT_decl_line(0x4c)
    2774                            .dwattr $C$DW$86, DW_AT_decl_column(0x0c)
    2775                    
    2776                    $C$DW$87        .dwtag  DW_TAG_member
    2777                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    2778                            .dwattr $C$DW$87, DW_AT_name("CCMKEYR4")
    2779                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("CCMKEYR4")
    2780                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2781                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2782                            .dwattr $C$DW$87, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2783                            .dwattr $C$DW$87, DW_AT_decl_line(0x4d)
    2784                            .dwattr $C$DW$87, DW_AT_decl_column(0x0c)
    2785                    
    2786                    $C$DW$88        .dwtag  DW_TAG_member
    2787                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    2788                            .dwattr $C$DW$88, DW_AT_name("CCMPDSTAT0")
    2789                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("CCMPDSTAT0")
    2790                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2791                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2792                            .dwattr $C$DW$88, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2793                            .dwattr $C$DW$88, DW_AT_decl_line(0x4e)
    2794                            .dwattr $C$DW$88, DW_AT_decl_column(0x0c)
    2795                    
    2796                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2797                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x43)
    2798                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x19)
    2799                            .dwendtag $C$DW$T$21
    2800                    
    2801                    $C$DW$T$116     .dwtag  DW_TAG_volatile_type
    2802                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$21)
    2803                    
    2804                    $C$DW$T$117     .dwtag  DW_TAG_typedef
    2805                            .dwattr $C$DW$T$117, DW_AT_name("ccmr5BASE_t")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   52

    2806                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    2807                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    2808                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test
    2809                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x4f)
    2810                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x03)
    2811                    
    2812                    
    2813                    $C$DW$T$69      .dwtag  DW_TAG_enumeration_type
    2814                            .dwattr $C$DW$T$69, DW_AT_name("config_value_type")
    2815                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x01)
    2816                    $C$DW$89        .dwtag  DW_TAG_enumerator
    2817                            .dwattr $C$DW$89, DW_AT_name("InitialValue")
    2818                            .dwattr $C$DW$89, DW_AT_const_value(0x00)
    2819                            .dwattr $C$DW$89, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2820                            .dwattr $C$DW$89, DW_AT_decl_line(0x5c)
    2821                            .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    2822                    
    2823                    $C$DW$90        .dwtag  DW_TAG_enumerator
    2824                            .dwattr $C$DW$90, DW_AT_name("CurrentValue")
    2825                            .dwattr $C$DW$90, DW_AT_const_value(0x01)
    2826                            .dwattr $C$DW$90, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2827                            .dwattr $C$DW$90, DW_AT_decl_line(0x5d)
    2828                            .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    2829                    
    2830                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2831                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x5a)
    2832                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2833                            .dwendtag $C$DW$T$69
    2834                    
    2835                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    2836                            .dwattr $C$DW$T$70, DW_AT_name("config_value_type_t")
    2837                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2838                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2839                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2840                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x5e)
    2841                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    2842                    
    2843                    
    2844                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2845                            .dwattr $C$DW$T$24, DW_AT_name("esmBase")
    2846                            .dwattr $C$DW$T$24, DW_AT_byte_size(0xa4)
    2847                    $C$DW$91        .dwtag  DW_TAG_member
    2848                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    2849                            .dwattr $C$DW$91, DW_AT_name("EEPAPR1")
    2850                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("EEPAPR1")
    2851                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2852                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2853                            .dwattr $C$DW$91, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2854                            .dwattr $C$DW$91, DW_AT_decl_line(0x48)
    2855                            .dwattr $C$DW$91, DW_AT_decl_column(0x0c)
    2856                    
    2857                    $C$DW$92        .dwtag  DW_TAG_member
    2858                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    2859                            .dwattr $C$DW$92, DW_AT_name("DEPAPR1")
    2860                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("DEPAPR1")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   53

    2861                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2862                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2863                            .dwattr $C$DW$92, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2864                            .dwattr $C$DW$92, DW_AT_decl_line(0x49)
    2865                            .dwattr $C$DW$92, DW_AT_decl_column(0x0c)
    2866                    
    2867                    $C$DW$93        .dwtag  DW_TAG_member
    2868                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    2869                            .dwattr $C$DW$93, DW_AT_name("IESR1")
    2870                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("IESR1")
    2871                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2872                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2873                            .dwattr $C$DW$93, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2874                            .dwattr $C$DW$93, DW_AT_decl_line(0x4a)
    2875                            .dwattr $C$DW$93, DW_AT_decl_column(0x0c)
    2876                    
    2877                    $C$DW$94        .dwtag  DW_TAG_member
    2878                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
    2879                            .dwattr $C$DW$94, DW_AT_name("IECR1")
    2880                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("IECR1")
    2881                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2882                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2883                            .dwattr $C$DW$94, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2884                            .dwattr $C$DW$94, DW_AT_decl_line(0x4b)
    2885                            .dwattr $C$DW$94, DW_AT_decl_column(0x0c)
    2886                    
    2887                    $C$DW$95        .dwtag  DW_TAG_member
    2888                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    2889                            .dwattr $C$DW$95, DW_AT_name("ILSR1")
    2890                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("ILSR1")
    2891                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2892                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2893                            .dwattr $C$DW$95, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2894                            .dwattr $C$DW$95, DW_AT_decl_line(0x4c)
    2895                            .dwattr $C$DW$95, DW_AT_decl_column(0x0c)
    2896                    
    2897                    $C$DW$96        .dwtag  DW_TAG_member
    2898                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    2899                            .dwattr $C$DW$96, DW_AT_name("ILCR1")
    2900                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("ILCR1")
    2901                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2902                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2903                            .dwattr $C$DW$96, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2904                            .dwattr $C$DW$96, DW_AT_decl_line(0x4d)
    2905                            .dwattr $C$DW$96, DW_AT_decl_column(0x0c)
    2906                    
    2907                    $C$DW$97        .dwtag  DW_TAG_member
    2908                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$22)
    2909                            .dwattr $C$DW$97, DW_AT_name("SR1")
    2910                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("SR1")
    2911                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2912                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2913                            .dwattr $C$DW$97, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2914                            .dwattr $C$DW$97, DW_AT_decl_line(0x4e)
    2915                            .dwattr $C$DW$97, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   54

    2916                    
    2917                    $C$DW$98        .dwtag  DW_TAG_member
    2918                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    2919                            .dwattr $C$DW$98, DW_AT_name("EPSR")
    2920                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("EPSR")
    2921                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2922                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2923                            .dwattr $C$DW$98, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2924                            .dwattr $C$DW$98, DW_AT_decl_line(0x4f)
    2925                            .dwattr $C$DW$98, DW_AT_decl_column(0x0c)
    2926                    
    2927                    $C$DW$99        .dwtag  DW_TAG_member
    2928                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    2929                            .dwattr $C$DW$99, DW_AT_name("IOFFHR")
    2930                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("IOFFHR")
    2931                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2932                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2933                            .dwattr $C$DW$99, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pr
    2934                            .dwattr $C$DW$99, DW_AT_decl_line(0x50)
    2935                            .dwattr $C$DW$99, DW_AT_decl_column(0x0c)
    2936                    
    2937                    $C$DW$100       .dwtag  DW_TAG_member
    2938                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    2939                            .dwattr $C$DW$100, DW_AT_name("IOFFLR")
    2940                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("IOFFLR")
    2941                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2942                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2943                            .dwattr $C$DW$100, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2944                            .dwattr $C$DW$100, DW_AT_decl_line(0x51)
    2945                            .dwattr $C$DW$100, DW_AT_decl_column(0x0c)
    2946                    
    2947                    $C$DW$101       .dwtag  DW_TAG_member
    2948                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    2949                            .dwattr $C$DW$101, DW_AT_name("LTCR")
    2950                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("LTCR")
    2951                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2952                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2953                            .dwattr $C$DW$101, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2954                            .dwattr $C$DW$101, DW_AT_decl_line(0x52)
    2955                            .dwattr $C$DW$101, DW_AT_decl_column(0x0c)
    2956                    
    2957                    $C$DW$102       .dwtag  DW_TAG_member
    2958                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    2959                            .dwattr $C$DW$102, DW_AT_name("LTCPR")
    2960                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("LTCPR")
    2961                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2962                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2963                            .dwattr $C$DW$102, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2964                            .dwattr $C$DW$102, DW_AT_decl_line(0x53)
    2965                            .dwattr $C$DW$102, DW_AT_decl_column(0x0c)
    2966                    
    2967                    $C$DW$103       .dwtag  DW_TAG_member
    2968                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    2969                            .dwattr $C$DW$103, DW_AT_name("EKR")
    2970                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("EKR")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   55

    2971                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2972                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2973                            .dwattr $C$DW$103, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2974                            .dwattr $C$DW$103, DW_AT_decl_line(0x54)
    2975                            .dwattr $C$DW$103, DW_AT_decl_column(0x0c)
    2976                    
    2977                    $C$DW$104       .dwtag  DW_TAG_member
    2978                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    2979                            .dwattr $C$DW$104, DW_AT_name("SSR2")
    2980                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("SSR2")
    2981                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2982                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2983                            .dwattr $C$DW$104, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2984                            .dwattr $C$DW$104, DW_AT_decl_line(0x55)
    2985                            .dwattr $C$DW$104, DW_AT_decl_column(0x0c)
    2986                    
    2987                    $C$DW$105       .dwtag  DW_TAG_member
    2988                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    2989                            .dwattr $C$DW$105, DW_AT_name("IEPSR4")
    2990                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("IEPSR4")
    2991                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2992                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2993                            .dwattr $C$DW$105, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2994                            .dwattr $C$DW$105, DW_AT_decl_line(0x56)
    2995                            .dwattr $C$DW$105, DW_AT_decl_column(0x0c)
    2996                    
    2997                    $C$DW$106       .dwtag  DW_TAG_member
    2998                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    2999                            .dwattr $C$DW$106, DW_AT_name("IEPCR4")
    3000                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("IEPCR4")
    3001                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3002                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    3003                            .dwattr $C$DW$106, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3004                            .dwattr $C$DW$106, DW_AT_decl_line(0x57)
    3005                            .dwattr $C$DW$106, DW_AT_decl_column(0x0c)
    3006                    
    3007                    $C$DW$107       .dwtag  DW_TAG_member
    3008                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    3009                            .dwattr $C$DW$107, DW_AT_name("IESR4")
    3010                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("IESR4")
    3011                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3012                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    3013                            .dwattr $C$DW$107, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3014                            .dwattr $C$DW$107, DW_AT_decl_line(0x58)
    3015                            .dwattr $C$DW$107, DW_AT_decl_column(0x0c)
    3016                    
    3017                    $C$DW$108       .dwtag  DW_TAG_member
    3018                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    3019                            .dwattr $C$DW$108, DW_AT_name("IECR4")
    3020                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("IECR4")
    3021                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3022                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    3023                            .dwattr $C$DW$108, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3024                            .dwattr $C$DW$108, DW_AT_decl_line(0x59)
    3025                            .dwattr $C$DW$108, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   56

    3026                    
    3027                    $C$DW$109       .dwtag  DW_TAG_member
    3028                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    3029                            .dwattr $C$DW$109, DW_AT_name("ILSR4")
    3030                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("ILSR4")
    3031                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3032                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    3033                            .dwattr $C$DW$109, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3034                            .dwattr $C$DW$109, DW_AT_decl_line(0x5a)
    3035                            .dwattr $C$DW$109, DW_AT_decl_column(0x0c)
    3036                    
    3037                    $C$DW$110       .dwtag  DW_TAG_member
    3038                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    3039                            .dwattr $C$DW$110, DW_AT_name("ILCR4")
    3040                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("ILCR4")
    3041                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3042                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    3043                            .dwattr $C$DW$110, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3044                            .dwattr $C$DW$110, DW_AT_decl_line(0x5b)
    3045                            .dwattr $C$DW$110, DW_AT_decl_column(0x0c)
    3046                    
    3047                    $C$DW$111       .dwtag  DW_TAG_member
    3048                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    3049                            .dwattr $C$DW$111, DW_AT_name("SR4")
    3050                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("SR4")
    3051                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3052                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    3053                            .dwattr $C$DW$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3054                            .dwattr $C$DW$111, DW_AT_decl_line(0x5c)
    3055                            .dwattr $C$DW$111, DW_AT_decl_column(0x0c)
    3056                    
    3057                    $C$DW$112       .dwtag  DW_TAG_member
    3058                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$23)
    3059                            .dwattr $C$DW$112, DW_AT_name("rsvd1")
    3060                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("rsvd1")
    3061                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3062                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    3063                            .dwattr $C$DW$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3064                            .dwattr $C$DW$112, DW_AT_decl_line(0x5d)
    3065                            .dwattr $C$DW$112, DW_AT_decl_column(0x0c)
    3066                    
    3067                    $C$DW$113       .dwtag  DW_TAG_member
    3068                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    3069                            .dwattr $C$DW$113, DW_AT_name("IEPSR7")
    3070                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("IEPSR7")
    3071                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3072                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    3073                            .dwattr $C$DW$113, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3074                            .dwattr $C$DW$113, DW_AT_decl_line(0x5e)
    3075                            .dwattr $C$DW$113, DW_AT_decl_column(0x0c)
    3076                    
    3077                    $C$DW$114       .dwtag  DW_TAG_member
    3078                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    3079                            .dwattr $C$DW$114, DW_AT_name("IEPCR7")
    3080                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("IEPCR7")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   57

    3081                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3082                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    3083                            .dwattr $C$DW$114, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3084                            .dwattr $C$DW$114, DW_AT_decl_line(0x5f)
    3085                            .dwattr $C$DW$114, DW_AT_decl_column(0x0c)
    3086                    
    3087                    $C$DW$115       .dwtag  DW_TAG_member
    3088                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    3089                            .dwattr $C$DW$115, DW_AT_name("IESR7")
    3090                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("IESR7")
    3091                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3092                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    3093                            .dwattr $C$DW$115, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3094                            .dwattr $C$DW$115, DW_AT_decl_line(0x60)
    3095                            .dwattr $C$DW$115, DW_AT_decl_column(0x0c)
    3096                    
    3097                    $C$DW$116       .dwtag  DW_TAG_member
    3098                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    3099                            .dwattr $C$DW$116, DW_AT_name("IECR7")
    3100                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("IECR7")
    3101                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    3102                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    3103                            .dwattr $C$DW$116, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3104                            .dwattr $C$DW$116, DW_AT_decl_line(0x61)
    3105                            .dwattr $C$DW$116, DW_AT_decl_column(0x0c)
    3106                    
    3107                    $C$DW$117       .dwtag  DW_TAG_member
    3108                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    3109                            .dwattr $C$DW$117, DW_AT_name("ILSR7")
    3110                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("ILSR7")
    3111                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3112                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    3113                            .dwattr $C$DW$117, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3114                            .dwattr $C$DW$117, DW_AT_decl_line(0x62)
    3115                            .dwattr $C$DW$117, DW_AT_decl_column(0x0c)
    3116                    
    3117                    $C$DW$118       .dwtag  DW_TAG_member
    3118                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    3119                            .dwattr $C$DW$118, DW_AT_name("ILCR7")
    3120                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("ILCR7")
    3121                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    3122                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    3123                            .dwattr $C$DW$118, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3124                            .dwattr $C$DW$118, DW_AT_decl_line(0x63)
    3125                            .dwattr $C$DW$118, DW_AT_decl_column(0x0c)
    3126                    
    3127                    $C$DW$119       .dwtag  DW_TAG_member
    3128                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$22)
    3129                            .dwattr $C$DW$119, DW_AT_name("SR7")
    3130                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("SR7")
    3131                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    3132                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    3133                            .dwattr $C$DW$119, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3134                            .dwattr $C$DW$119, DW_AT_decl_line(0x64)
    3135                            .dwattr $C$DW$119, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   58

    3136                    
    3137                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3138                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x46)
    3139                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x19)
    3140                            .dwendtag $C$DW$T$24
    3141                    
    3142                    $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    3143                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$24)
    3144                    
    3145                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    3146                            .dwattr $C$DW$T$58, DW_AT_name("esmBASE_t")
    3147                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3148                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3149                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3150                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x65)
    3151                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    3152                    
    3153                    $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    3154                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3155                            .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    3156                    
    3157                    
    3158                    $C$DW$T$118     .dwtag  DW_TAG_enumeration_type
    3159                            .dwattr $C$DW$T$118, DW_AT_name("esmSelfTestFlag")
    3160                            .dwattr $C$DW$T$118, DW_AT_byte_size(0x01)
    3161                    $C$DW$120       .dwtag  DW_TAG_enumerator
    3162                            .dwattr $C$DW$120, DW_AT_name("esmSelfTest_Passed")
    3163                            .dwattr $C$DW$120, DW_AT_const_value(0x00)
    3164                            .dwattr $C$DW$120, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3165                            .dwattr $C$DW$120, DW_AT_decl_line(0x3c2)
    3166                            .dwattr $C$DW$120, DW_AT_decl_column(0x05)
    3167                    
    3168                    $C$DW$121       .dwtag  DW_TAG_enumerator
    3169                            .dwattr $C$DW$121, DW_AT_name("esmSelfTest_Active")
    3170                            .dwattr $C$DW$121, DW_AT_const_value(0x01)
    3171                            .dwattr $C$DW$121, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3172                            .dwattr $C$DW$121, DW_AT_decl_line(0x3c3)
    3173                            .dwattr $C$DW$121, DW_AT_decl_column(0x05)
    3174                    
    3175                    $C$DW$122       .dwtag  DW_TAG_enumerator
    3176                            .dwattr $C$DW$122, DW_AT_name("esmSelfTest_NotStarted")
    3177                            .dwattr $C$DW$122, DW_AT_const_value(0x02)
    3178                            .dwattr $C$DW$122, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3179                            .dwattr $C$DW$122, DW_AT_decl_line(0x3c4)
    3180                            .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    3181                    
    3182                    $C$DW$123       .dwtag  DW_TAG_enumerator
    3183                            .dwattr $C$DW$123, DW_AT_name("esmSelfTest_Failed")
    3184                            .dwattr $C$DW$123, DW_AT_const_value(0x03)
    3185                            .dwattr $C$DW$123, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3186                            .dwattr $C$DW$123, DW_AT_decl_line(0x3c5)
    3187                            .dwattr $C$DW$123, DW_AT_decl_column(0x05)
    3188                    
    3189                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3190                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x3c0)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   59

    3191                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x0e)
    3192                            .dwendtag $C$DW$T$118
    3193                    
    3194                    $C$DW$T$119     .dwtag  DW_TAG_typedef
    3195                            .dwattr $C$DW$T$119, DW_AT_name("esmSelfTestFlag_t")
    3196                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    3197                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3198                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3199                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x3c6)
    3200                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x02)
    3201                    
    3202                    
    3203                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3204                            .dwattr $C$DW$T$25, DW_AT_name("esm_config_reg")
    3205                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x2c)
    3206                    $C$DW$124       .dwtag  DW_TAG_member
    3207                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    3208                            .dwattr $C$DW$124, DW_AT_name("CONFIG_EEPAPR1")
    3209                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("CONFIG_EEPAPR1")
    3210                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3211                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    3212                            .dwattr $C$DW$124, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3213                            .dwattr $C$DW$124, DW_AT_decl_line(0x3cb)
    3214                            .dwattr $C$DW$124, DW_AT_decl_column(0x0c)
    3215                    
    3216                    $C$DW$125       .dwtag  DW_TAG_member
    3217                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    3218                            .dwattr $C$DW$125, DW_AT_name("CONFIG_IESR1")
    3219                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("CONFIG_IESR1")
    3220                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3221                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    3222                            .dwattr $C$DW$125, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3223                            .dwattr $C$DW$125, DW_AT_decl_line(0x3cc)
    3224                            .dwattr $C$DW$125, DW_AT_decl_column(0x0c)
    3225                    
    3226                    $C$DW$126       .dwtag  DW_TAG_member
    3227                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    3228                            .dwattr $C$DW$126, DW_AT_name("CONFIG_ILSR1")
    3229                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("CONFIG_ILSR1")
    3230                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3231                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    3232                            .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3233                            .dwattr $C$DW$126, DW_AT_decl_line(0x3cd)
    3234                            .dwattr $C$DW$126, DW_AT_decl_column(0x0c)
    3235                    
    3236                    $C$DW$127       .dwtag  DW_TAG_member
    3237                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    3238                            .dwattr $C$DW$127, DW_AT_name("CONFIG_LTCPR")
    3239                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("CONFIG_LTCPR")
    3240                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3241                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    3242                            .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3243                            .dwattr $C$DW$127, DW_AT_decl_line(0x3ce)
    3244                            .dwattr $C$DW$127, DW_AT_decl_column(0x0c)
    3245                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   60

    3246                    $C$DW$128       .dwtag  DW_TAG_member
    3247                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    3248                            .dwattr $C$DW$128, DW_AT_name("CONFIG_EKR")
    3249                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("CONFIG_EKR")
    3250                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3251                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    3252                            .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3253                            .dwattr $C$DW$128, DW_AT_decl_line(0x3cf)
    3254                            .dwattr $C$DW$128, DW_AT_decl_column(0x0c)
    3255                    
    3256                    $C$DW$129       .dwtag  DW_TAG_member
    3257                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    3258                            .dwattr $C$DW$129, DW_AT_name("CONFIG_IEPSR4")
    3259                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("CONFIG_IEPSR4")
    3260                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3261                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    3262                            .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3263                            .dwattr $C$DW$129, DW_AT_decl_line(0x3d0)
    3264                            .dwattr $C$DW$129, DW_AT_decl_column(0x0c)
    3265                    
    3266                    $C$DW$130       .dwtag  DW_TAG_member
    3267                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    3268                            .dwattr $C$DW$130, DW_AT_name("CONFIG_IESR4")
    3269                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("CONFIG_IESR4")
    3270                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3271                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    3272                            .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3273                            .dwattr $C$DW$130, DW_AT_decl_line(0x3d1)
    3274                            .dwattr $C$DW$130, DW_AT_decl_column(0x0c)
    3275                    
    3276                    $C$DW$131       .dwtag  DW_TAG_member
    3277                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    3278                            .dwattr $C$DW$131, DW_AT_name("CONFIG_ILSR4")
    3279                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("CONFIG_ILSR4")
    3280                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3281                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    3282                            .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3283                            .dwattr $C$DW$131, DW_AT_decl_line(0x3d2)
    3284                            .dwattr $C$DW$131, DW_AT_decl_column(0x0c)
    3285                    
    3286                    $C$DW$132       .dwtag  DW_TAG_member
    3287                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    3288                            .dwattr $C$DW$132, DW_AT_name("CONFIG_IEPSR7")
    3289                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("CONFIG_IEPSR7")
    3290                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3291                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    3292                            .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3293                            .dwattr $C$DW$132, DW_AT_decl_line(0x3d3)
    3294                            .dwattr $C$DW$132, DW_AT_decl_column(0x0c)
    3295                    
    3296                    $C$DW$133       .dwtag  DW_TAG_member
    3297                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    3298                            .dwattr $C$DW$133, DW_AT_name("CONFIG_IESR7")
    3299                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("CONFIG_IESR7")
    3300                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   61

    3301                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    3302                            .dwattr $C$DW$133, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3303                            .dwattr $C$DW$133, DW_AT_decl_line(0x3d4)
    3304                            .dwattr $C$DW$133, DW_AT_decl_column(0x0c)
    3305                    
    3306                    $C$DW$134       .dwtag  DW_TAG_member
    3307                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    3308                            .dwattr $C$DW$134, DW_AT_name("CONFIG_ILSR7")
    3309                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("CONFIG_ILSR7")
    3310                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3311                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    3312                            .dwattr $C$DW$134, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3313                            .dwattr $C$DW$134, DW_AT_decl_line(0x3d5)
    3314                            .dwattr $C$DW$134, DW_AT_decl_column(0x0c)
    3315                    
    3316                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3317                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x3c9)
    3318                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3319                            .dwendtag $C$DW$T$25
    3320                    
    3321                    $C$DW$T$120     .dwtag  DW_TAG_typedef
    3322                            .dwattr $C$DW$T$120, DW_AT_name("esm_config_reg_t")
    3323                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$25)
    3324                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3325                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3326                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x3d6)
    3327                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x03)
    3328                    
    3329                    
    3330                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3331                            .dwattr $C$DW$T$30, DW_AT_name("flashWBase")
    3332                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x410)
    3333                    $C$DW$135       .dwtag  DW_TAG_member
    3334                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    3335                            .dwattr $C$DW$135, DW_AT_name("FRDCNTL")
    3336                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("FRDCNTL")
    3337                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3338                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    3339                            .dwattr $C$DW$135, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3340                            .dwattr $C$DW$135, DW_AT_decl_line(0x48)
    3341                            .dwattr $C$DW$135, DW_AT_decl_column(0x0c)
    3342                    
    3343                    $C$DW$136       .dwtag  DW_TAG_member
    3344                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    3345                            .dwattr $C$DW$136, DW_AT_name("rsvd1")
    3346                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("rsvd1")
    3347                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3348                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    3349                            .dwattr $C$DW$136, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3350                            .dwattr $C$DW$136, DW_AT_decl_line(0x49)
    3351                            .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    3352                    
    3353                    $C$DW$137       .dwtag  DW_TAG_member
    3354                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    3355                            .dwattr $C$DW$137, DW_AT_name("EE_FEDACCTRL1")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   62

    3356                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("EE_FEDACCTRL1")
    3357                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3358                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    3359                            .dwattr $C$DW$137, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3360                            .dwattr $C$DW$137, DW_AT_decl_line(0x4a)
    3361                            .dwattr $C$DW$137, DW_AT_decl_column(0x0c)
    3362                    
    3363                    $C$DW$138       .dwtag  DW_TAG_member
    3364                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    3365                            .dwattr $C$DW$138, DW_AT_name("rsvd2")
    3366                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("rsvd2")
    3367                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3368                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    3369                            .dwattr $C$DW$138, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3370                            .dwattr $C$DW$138, DW_AT_decl_line(0x4b)
    3371                            .dwattr $C$DW$138, DW_AT_decl_column(0x0c)
    3372                    
    3373                    $C$DW$139       .dwtag  DW_TAG_member
    3374                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    3375                            .dwattr $C$DW$139, DW_AT_name("rsvd3")
    3376                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("rsvd3")
    3377                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3378                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    3379                            .dwattr $C$DW$139, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3380                            .dwattr $C$DW$139, DW_AT_decl_line(0x4c)
    3381                            .dwattr $C$DW$139, DW_AT_decl_column(0x0c)
    3382                    
    3383                    $C$DW$140       .dwtag  DW_TAG_member
    3384                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    3385                            .dwattr $C$DW$140, DW_AT_name("FEDAC_PASTATUS")
    3386                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("FEDAC_PASTATUS")
    3387                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3388                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    3389                            .dwattr $C$DW$140, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3390                            .dwattr $C$DW$140, DW_AT_decl_line(0x4d)
    3391                            .dwattr $C$DW$140, DW_AT_decl_column(0x0c)
    3392                    
    3393                    $C$DW$141       .dwtag  DW_TAG_member
    3394                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    3395                            .dwattr $C$DW$141, DW_AT_name("FEDAC_PBSTATUS")
    3396                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("FEDAC_PBSTATUS")
    3397                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3398                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    3399                            .dwattr $C$DW$141, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3400                            .dwattr $C$DW$141, DW_AT_decl_line(0x4e)
    3401                            .dwattr $C$DW$141, DW_AT_decl_column(0x0c)
    3402                    
    3403                    $C$DW$142       .dwtag  DW_TAG_member
    3404                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    3405                            .dwattr $C$DW$142, DW_AT_name("FEDAC_GBLSTATUS")
    3406                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("FEDAC_GBLSTATUS")
    3407                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3408                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    3409                            .dwattr $C$DW$142, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3410                            .dwattr $C$DW$142, DW_AT_decl_line(0x4f)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   63

    3411                            .dwattr $C$DW$142, DW_AT_decl_column(0x0c)
    3412                    
    3413                    $C$DW$143       .dwtag  DW_TAG_member
    3414                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    3415                            .dwattr $C$DW$143, DW_AT_name("rsvd4")
    3416                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("rsvd4")
    3417                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3418                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    3419                            .dwattr $C$DW$143, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3420                            .dwattr $C$DW$143, DW_AT_decl_line(0x50)
    3421                            .dwattr $C$DW$143, DW_AT_decl_column(0x0c)
    3422                    
    3423                    $C$DW$144       .dwtag  DW_TAG_member
    3424                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    3425                            .dwattr $C$DW$144, DW_AT_name("FEDACSDIS")
    3426                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("FEDACSDIS")
    3427                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3428                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    3429                            .dwattr $C$DW$144, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3430                            .dwattr $C$DW$144, DW_AT_decl_line(0x51)
    3431                            .dwattr $C$DW$144, DW_AT_decl_column(0x0c)
    3432                    
    3433                    $C$DW$145       .dwtag  DW_TAG_member
    3434                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    3435                            .dwattr $C$DW$145, DW_AT_name("FPRIM_ADD_TAG")
    3436                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("FPRIM_ADD_TAG")
    3437                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3438                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    3439                            .dwattr $C$DW$145, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3440                            .dwattr $C$DW$145, DW_AT_decl_line(0x52)
    3441                            .dwattr $C$DW$145, DW_AT_decl_column(0x0c)
    3442                    
    3443                    $C$DW$146       .dwtag  DW_TAG_member
    3444                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    3445                            .dwattr $C$DW$146, DW_AT_name("FDUP_ADD_TAG")
    3446                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("FDUP_ADD_TAG")
    3447                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3448                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    3449                            .dwattr $C$DW$146, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3450                            .dwattr $C$DW$146, DW_AT_decl_line(0x53)
    3451                            .dwattr $C$DW$146, DW_AT_decl_column(0x0c)
    3452                    
    3453                    $C$DW$147       .dwtag  DW_TAG_member
    3454                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    3455                            .dwattr $C$DW$147, DW_AT_name("FBPROT")
    3456                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("FBPROT")
    3457                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3458                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3459                            .dwattr $C$DW$147, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3460                            .dwattr $C$DW$147, DW_AT_decl_line(0x54)
    3461                            .dwattr $C$DW$147, DW_AT_decl_column(0x0c)
    3462                    
    3463                    $C$DW$148       .dwtag  DW_TAG_member
    3464                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    3465                            .dwattr $C$DW$148, DW_AT_name("FBSE")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   64

    3466                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("FBSE")
    3467                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3468                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3469                            .dwattr $C$DW$148, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3470                            .dwattr $C$DW$148, DW_AT_decl_line(0x55)
    3471                            .dwattr $C$DW$148, DW_AT_decl_column(0x0c)
    3472                    
    3473                    $C$DW$149       .dwtag  DW_TAG_member
    3474                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    3475                            .dwattr $C$DW$149, DW_AT_name("FBBUSY")
    3476                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("FBBUSY")
    3477                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3478                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3479                            .dwattr $C$DW$149, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3480                            .dwattr $C$DW$149, DW_AT_decl_line(0x56)
    3481                            .dwattr $C$DW$149, DW_AT_decl_column(0x0c)
    3482                    
    3483                    $C$DW$150       .dwtag  DW_TAG_member
    3484                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    3485                            .dwattr $C$DW$150, DW_AT_name("FBAC")
    3486                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("FBAC")
    3487                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3488                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3489                            .dwattr $C$DW$150, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3490                            .dwattr $C$DW$150, DW_AT_decl_line(0x57)
    3491                            .dwattr $C$DW$150, DW_AT_decl_column(0x0c)
    3492                    
    3493                    $C$DW$151       .dwtag  DW_TAG_member
    3494                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    3495                            .dwattr $C$DW$151, DW_AT_name("FBPWRMODE")
    3496                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("FBPWRMODE")
    3497                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3498                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3499                            .dwattr $C$DW$151, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3500                            .dwattr $C$DW$151, DW_AT_decl_line(0x58)
    3501                            .dwattr $C$DW$151, DW_AT_decl_column(0x0c)
    3502                    
    3503                    $C$DW$152       .dwtag  DW_TAG_member
    3504                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    3505                            .dwattr $C$DW$152, DW_AT_name("FBPRDY")
    3506                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("FBPRDY")
    3507                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3508                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3509                            .dwattr $C$DW$152, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3510                            .dwattr $C$DW$152, DW_AT_decl_line(0x59)
    3511                            .dwattr $C$DW$152, DW_AT_decl_column(0x0c)
    3512                    
    3513                    $C$DW$153       .dwtag  DW_TAG_member
    3514                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    3515                            .dwattr $C$DW$153, DW_AT_name("FPAC1")
    3516                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("FPAC1")
    3517                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3518                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3519                            .dwattr $C$DW$153, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3520                            .dwattr $C$DW$153, DW_AT_decl_line(0x5a)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   65

    3521                            .dwattr $C$DW$153, DW_AT_decl_column(0x0c)
    3522                    
    3523                    $C$DW$154       .dwtag  DW_TAG_member
    3524                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    3525                            .dwattr $C$DW$154, DW_AT_name("rsvd5")
    3526                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("rsvd5")
    3527                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3528                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3529                            .dwattr $C$DW$154, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3530                            .dwattr $C$DW$154, DW_AT_decl_line(0x5b)
    3531                            .dwattr $C$DW$154, DW_AT_decl_column(0x0c)
    3532                    
    3533                    $C$DW$155       .dwtag  DW_TAG_member
    3534                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    3535                            .dwattr $C$DW$155, DW_AT_name("FMAC")
    3536                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("FMAC")
    3537                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3538                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3539                            .dwattr $C$DW$155, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3540                            .dwattr $C$DW$155, DW_AT_decl_line(0x5c)
    3541                            .dwattr $C$DW$155, DW_AT_decl_column(0x0c)
    3542                    
    3543                    $C$DW$156       .dwtag  DW_TAG_member
    3544                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    3545                            .dwattr $C$DW$156, DW_AT_name("FMSTAT")
    3546                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("FMSTAT")
    3547                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3548                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3549                            .dwattr $C$DW$156, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3550                            .dwattr $C$DW$156, DW_AT_decl_line(0x5d)
    3551                            .dwattr $C$DW$156, DW_AT_decl_column(0x0c)
    3552                    
    3553                    $C$DW$157       .dwtag  DW_TAG_member
    3554                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    3555                            .dwattr $C$DW$157, DW_AT_name("FEMU_DMSW")
    3556                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("FEMU_DMSW")
    3557                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3558                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3559                            .dwattr $C$DW$157, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3560                            .dwattr $C$DW$157, DW_AT_decl_line(0x5e)
    3561                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    3562                    
    3563                    $C$DW$158       .dwtag  DW_TAG_member
    3564                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    3565                            .dwattr $C$DW$158, DW_AT_name("FEMU_DLSW")
    3566                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("FEMU_DLSW")
    3567                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3568                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3569                            .dwattr $C$DW$158, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3570                            .dwattr $C$DW$158, DW_AT_decl_line(0x5f)
    3571                            .dwattr $C$DW$158, DW_AT_decl_column(0x0c)
    3572                    
    3573                    $C$DW$159       .dwtag  DW_TAG_member
    3574                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    3575                            .dwattr $C$DW$159, DW_AT_name("FEMU_ECC")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   66

    3576                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("FEMU_ECC")
    3577                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3578                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3579                            .dwattr $C$DW$159, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3580                            .dwattr $C$DW$159, DW_AT_decl_line(0x60)
    3581                            .dwattr $C$DW$159, DW_AT_decl_column(0x0c)
    3582                    
    3583                    $C$DW$160       .dwtag  DW_TAG_member
    3584                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    3585                            .dwattr $C$DW$160, DW_AT_name("FLOCK")
    3586                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("FLOCK")
    3587                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3588                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3589                            .dwattr $C$DW$160, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3590                            .dwattr $C$DW$160, DW_AT_decl_line(0x61)
    3591                            .dwattr $C$DW$160, DW_AT_decl_column(0x0c)
    3592                    
    3593                    $C$DW$161       .dwtag  DW_TAG_member
    3594                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    3595                            .dwattr $C$DW$161, DW_AT_name("rsvd6")
    3596                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("rsvd6")
    3597                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3598                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3599                            .dwattr $C$DW$161, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3600                            .dwattr $C$DW$161, DW_AT_decl_line(0x62)
    3601                            .dwattr $C$DW$161, DW_AT_decl_column(0x0c)
    3602                    
    3603                    $C$DW$162       .dwtag  DW_TAG_member
    3604                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    3605                            .dwattr $C$DW$162, DW_AT_name("FDIAGCTRL")
    3606                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("FDIAGCTRL")
    3607                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3608                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3609                            .dwattr $C$DW$162, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3610                            .dwattr $C$DW$162, DW_AT_decl_line(0x63)
    3611                            .dwattr $C$DW$162, DW_AT_decl_column(0x0c)
    3612                    
    3613                    $C$DW$163       .dwtag  DW_TAG_member
    3614                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    3615                            .dwattr $C$DW$163, DW_AT_name("rsvd7")
    3616                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("rsvd7")
    3617                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    3618                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3619                            .dwattr $C$DW$163, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3620                            .dwattr $C$DW$163, DW_AT_decl_line(0x64)
    3621                            .dwattr $C$DW$163, DW_AT_decl_column(0x0c)
    3622                    
    3623                    $C$DW$164       .dwtag  DW_TAG_member
    3624                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    3625                            .dwattr $C$DW$164, DW_AT_name("FRAW_ADDR")
    3626                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("FRAW_ADDR")
    3627                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3628                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3629                            .dwattr $C$DW$164, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3630                            .dwattr $C$DW$164, DW_AT_decl_line(0x65)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   67

    3631                            .dwattr $C$DW$164, DW_AT_decl_column(0x0c)
    3632                    
    3633                    $C$DW$165       .dwtag  DW_TAG_member
    3634                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    3635                            .dwattr $C$DW$165, DW_AT_name("rsvd8")
    3636                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("rsvd8")
    3637                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3638                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3639                            .dwattr $C$DW$165, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3640                            .dwattr $C$DW$165, DW_AT_decl_line(0x66)
    3641                            .dwattr $C$DW$165, DW_AT_decl_column(0x0c)
    3642                    
    3643                    $C$DW$166       .dwtag  DW_TAG_member
    3644                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    3645                            .dwattr $C$DW$166, DW_AT_name("FPAR_OVR")
    3646                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("FPAR_OVR")
    3647                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    3648                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3649                            .dwattr $C$DW$166, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3650                            .dwattr $C$DW$166, DW_AT_decl_line(0x67)
    3651                            .dwattr $C$DW$166, DW_AT_decl_column(0x0c)
    3652                    
    3653                    $C$DW$167       .dwtag  DW_TAG_member
    3654                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$26)
    3655                            .dwattr $C$DW$167, DW_AT_name("rsvd9")
    3656                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("rsvd9")
    3657                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3658                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3659                            .dwattr $C$DW$167, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3660                            .dwattr $C$DW$167, DW_AT_decl_line(0x68)
    3661                            .dwattr $C$DW$167, DW_AT_decl_column(0x0c)
    3662                    
    3663                    $C$DW$168       .dwtag  DW_TAG_member
    3664                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    3665                            .dwattr $C$DW$168, DW_AT_name("RCR_VALID")
    3666                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("RCR_VALID")
    3667                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    3668                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3669                            .dwattr $C$DW$168, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3670                            .dwattr $C$DW$168, DW_AT_decl_line(0x69)
    3671                            .dwattr $C$DW$168, DW_AT_decl_column(0x0c)
    3672                    
    3673                    $C$DW$169       .dwtag  DW_TAG_member
    3674                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    3675                            .dwattr $C$DW$169, DW_AT_name("ACC_THRESHOLD")
    3676                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("ACC_THRESHOLD")
    3677                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    3678                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3679                            .dwattr $C$DW$169, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3680                            .dwattr $C$DW$169, DW_AT_decl_line(0x6a)
    3681                            .dwattr $C$DW$169, DW_AT_decl_column(0x0c)
    3682                    
    3683                    $C$DW$170       .dwtag  DW_TAG_member
    3684                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    3685                            .dwattr $C$DW$170, DW_AT_name("rsvd10")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   68

    3686                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("rsvd10")
    3687                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3688                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3689                            .dwattr $C$DW$170, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3690                            .dwattr $C$DW$170, DW_AT_decl_line(0x6b)
    3691                            .dwattr $C$DW$170, DW_AT_decl_column(0x0c)
    3692                    
    3693                    $C$DW$171       .dwtag  DW_TAG_member
    3694                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    3695                            .dwattr $C$DW$171, DW_AT_name("FEDACSDIS2")
    3696                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("FEDACSDIS2")
    3697                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3698                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3699                            .dwattr $C$DW$171, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3700                            .dwattr $C$DW$171, DW_AT_decl_line(0x6c)
    3701                            .dwattr $C$DW$171, DW_AT_decl_column(0x0c)
    3702                    
    3703                    $C$DW$172       .dwtag  DW_TAG_member
    3704                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    3705                            .dwattr $C$DW$172, DW_AT_name("rsvd11")
    3706                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("rsvd11")
    3707                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3708                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3709                            .dwattr $C$DW$172, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3710                            .dwattr $C$DW$172, DW_AT_decl_line(0x6d)
    3711                            .dwattr $C$DW$172, DW_AT_decl_column(0x0c)
    3712                    
    3713                    $C$DW$173       .dwtag  DW_TAG_member
    3714                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    3715                            .dwattr $C$DW$173, DW_AT_name("rsvd12")
    3716                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("rsvd12")
    3717                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3718                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3719                            .dwattr $C$DW$173, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3720                            .dwattr $C$DW$173, DW_AT_decl_line(0x6e)
    3721                            .dwattr $C$DW$173, DW_AT_decl_column(0x0c)
    3722                    
    3723                    $C$DW$174       .dwtag  DW_TAG_member
    3724                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    3725                            .dwattr $C$DW$174, DW_AT_name("rsvd13")
    3726                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("rsvd13")
    3727                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3728                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3729                            .dwattr $C$DW$174, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3730                            .dwattr $C$DW$174, DW_AT_decl_line(0x6f)
    3731                            .dwattr $C$DW$174, DW_AT_decl_column(0x0c)
    3732                    
    3733                    $C$DW$175       .dwtag  DW_TAG_member
    3734                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    3735                            .dwattr $C$DW$175, DW_AT_name("RCR_VALUE0")
    3736                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("RCR_VALUE0")
    3737                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3738                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3739                            .dwattr $C$DW$175, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3740                            .dwattr $C$DW$175, DW_AT_decl_line(0x70)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\0245610                              PAGE   69

    3741                            .dwattr $C$DW$175, DW_AT_decl_column(0x0c)
    3742                    
    3743                    $C$DW$176       .dwtag  DW_TAG_member
    3744                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    3745                            .dwattr $C$DW$176, DW_AT_name("RCR_VALUE1")
    3746                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("RCR_VALUE1")
    3747                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3748                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3749                            .dwattr $C$DW$176, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3750                            .dwattr $C$DW$176, DW_AT_decl_line(0x71)
    3751                            .dwattr $C$DW$176, DW_AT_decl_column(0x0c)
    3752                    
    3753                    $C$DW$177       .dwtag  DW_TAG_member
    3754                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    3755                            .dwattr $C$DW$177, DW_AT_name("rsvd14")
    3756                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("rsvd14")
    3757                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3758                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3759                            .dwattr $C$DW$177, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3760                            .dwattr $C$DW$177, DW_AT_decl_line(0x72)
    3761                            .dwattr $C$DW$177, DW_AT_decl_column(0x0c)
    3762                    
    3763                    $C$DW$178       .dwtag  DW_TAG_member
    3764                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    3765                            .dwattr $C$DW$178, DW_AT_name("FSM_WR_ENA")
    3766                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("FSM_WR_ENA")
    3767                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x28c]
    3768                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3769                            .dwattr $C$DW$178, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3770                            .dwattr $C$DW$178, DW_AT_decl_line(0x73)
    3771                            .dwattr $C$DW$178, DW_AT_decl_column(0x0c)
    3772                    
    3773                    $C$DW$179       .dwtag  DW_TAG_member
    3774                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$28)
    3775                            .dwattr $C$DW$179, DW_AT_name("rsvd15")
    3776                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("rsvd15")
    3777                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x290]
    3778                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3779                            .dwattr $C$DW$179, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3780                            .dwattr $C$DW$179, DW_AT_decl_line(0x74)
    3781                            .dwattr $C$DW$179, DW_AT_decl_column(0x0c)
    3782                    
    3783                    $C$DW$180       .dwtag  DW_TAG_member
    3784                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    3785                            .dwattr $C$DW$180, DW_AT_name("EEPROM_CONFIG")
    3786                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("EEPROM_CONFIG")
    3787                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c0]
    3788                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
