TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
       3                    ;* Date/Time created: Thu Feb 16 13:27:10 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=32 --diag_wrap=off --embed
       6 00000000                   .state32
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../hcg/source/HL_sci.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\Pro
      13 00000000           g_sciTransfer_t:        .usect  ".bss:g_sciTransfer_t",80,4
      14                            .clink ".bss:g_sciTransfer_t"

    2395                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2396                            .dwattr $C$DW$T$17, DW_AT_name("double")
    2397                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    2398                    
    2399                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    2400                            .dwattr $C$DW$T$88, DW_AT_name("float64")
    2401                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$17)
    2402                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2403                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2404                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x72)
    2405                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x10)
    2406                    
    2407                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    2408                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2409                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    2410                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    2411                    
    2412                    $C$DW$T$89      .dwtag  DW_TAG_base_type
    2413                            .dwattr $C$DW$T$89, DW_AT_encoding(DW_ATE_unsigned_char)
    2414                            .dwattr $C$DW$T$89, DW_AT_name("unsigned char")
    2415                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x01)
    2416                    
    2417                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    2418                            .dwattr $C$DW$T$90, DW_AT_name("boolean")
    2419                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    2420                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   45

    2421                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2422                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x53)
    2423                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x0f)
    2424                    
    2425                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    2426                            .dwattr $C$DW$T$91, DW_AT_name("tBoolean")
    2427                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    2428                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2429                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2430                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x40)
    2431                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x11)
    2432                    
    2433                    
    2434                    $C$DW$T$49      .dwtag  DW_TAG_enumeration_type
    2435                            .dwattr $C$DW$T$49, DW_AT_name("config_value_type")
    2436                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    2437                    $C$DW$100       .dwtag  DW_TAG_enumerator
    2438                            .dwattr $C$DW$100, DW_AT_name("InitialValue")
    2439                            .dwattr $C$DW$100, DW_AT_const_value(0x00)
    2440                            .dwattr $C$DW$100, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2441                            .dwattr $C$DW$100, DW_AT_decl_line(0x5c)
    2442                            .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    2443                    
    2444                    $C$DW$101       .dwtag  DW_TAG_enumerator
    2445                            .dwattr $C$DW$101, DW_AT_name("CurrentValue")
    2446                            .dwattr $C$DW$101, DW_AT_const_value(0x01)
    2447                            .dwattr $C$DW$101, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2448                            .dwattr $C$DW$101, DW_AT_decl_line(0x5d)
    2449                            .dwattr $C$DW$101, DW_AT_decl_column(0x02)
    2450                    
    2451                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2452                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x5a)
    2453                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x0e)
    2454                            .dwendtag $C$DW$T$49
    2455                    
    2456                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    2457                            .dwattr $C$DW$T$50, DW_AT_name("config_value_type_t")
    2458                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2459                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2460                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2461                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x5e)
    2462                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x02)
    2463                    
    2464                    
    2465                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2466                            .dwattr $C$DW$T$24, DW_AT_name("g_sciTransfer")
    2467                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x14)
    2468                    $C$DW$102       .dwtag  DW_TAG_member
    2469                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    2470                            .dwattr $C$DW$102, DW_AT_name("mode")
    2471                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("mode")
    2472                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2473                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2474                            .dwattr $C$DW$102, DW_AT_decl_file("../hcg/source/HL_sci.c")
    2475                            .dwattr $C$DW$102, DW_AT_decl_line(0x39)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   46

    2476                            .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    2477                    
    2478                    $C$DW$103       .dwtag  DW_TAG_member
    2479                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    2480                            .dwattr $C$DW$103, DW_AT_name("tx_length")
    2481                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("tx_length")
    2482                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2483                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2484                            .dwattr $C$DW$103, DW_AT_decl_file("../hcg/source/HL_sci.c")
    2485                            .dwattr $C$DW$103, DW_AT_decl_line(0x3a)
    2486                            .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    2487                    
    2488                    $C$DW$104       .dwtag  DW_TAG_member
    2489                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    2490                            .dwattr $C$DW$104, DW_AT_name("rx_length")
    2491                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("rx_length")
    2492                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2493                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2494                            .dwattr $C$DW$104, DW_AT_decl_file("../hcg/source/HL_sci.c")
    2495                            .dwattr $C$DW$104, DW_AT_decl_line(0x3b)
    2496                            .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    2497                    
    2498                    $C$DW$105       .dwtag  DW_TAG_member
    2499                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$23)
    2500                            .dwattr $C$DW$105, DW_AT_name("tx_data")
    2501                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("tx_data")
    2502                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2503                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2504                            .dwattr $C$DW$105, DW_AT_decl_file("../hcg/source/HL_sci.c")
    2505                            .dwattr $C$DW$105, DW_AT_decl_line(0x3c)
    2506                            .dwattr $C$DW$105, DW_AT_decl_column(0x10)
    2507                    
    2508                    $C$DW$106       .dwtag  DW_TAG_member
    2509                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$23)
    2510                            .dwattr $C$DW$106, DW_AT_name("rx_data")
    2511                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("rx_data")
    2512                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2513                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2514                            .dwattr $C$DW$106, DW_AT_decl_file("../hcg/source/HL_sci.c")
    2515                            .dwattr $C$DW$106, DW_AT_decl_line(0x3d)
    2516                            .dwattr $C$DW$106, DW_AT_decl_column(0x10)
    2517                    
    2518                            .dwattr $C$DW$T$24, DW_AT_decl_file("../hcg/source/HL_sci.c")
    2519                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x37)
    2520                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x18)
    2521                            .dwendtag $C$DW$T$24
    2522                    
    2523                    $C$DW$T$92      .dwtag  DW_TAG_volatile_type
    2524                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$24)
    2525                    
    2526                    
    2527                    $C$DW$T$93      .dwtag  DW_TAG_array_type
    2528                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    2529                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2530                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x50)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   47

    2531                    $C$DW$107       .dwtag  DW_TAG_subrange_type
    2532                            .dwattr $C$DW$107, DW_AT_upper_bound(0x03)
    2533                    
    2534                            .dwendtag $C$DW$T$93
    2535                    
    2536                    
    2537                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2538                            .dwattr $C$DW$T$25, DW_AT_name("gioBase")
    2539                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x34)
    2540                    $C$DW$108       .dwtag  DW_TAG_member
    2541                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    2542                            .dwattr $C$DW$108, DW_AT_name("GCR0")
    2543                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("GCR0")
    2544                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2545                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2546                            .dwattr $C$DW$108, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2547                            .dwattr $C$DW$108, DW_AT_decl_line(0x48)
    2548                            .dwattr $C$DW$108, DW_AT_decl_column(0x0c)
    2549                    
    2550                    $C$DW$109       .dwtag  DW_TAG_member
    2551                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    2552                            .dwattr $C$DW$109, DW_AT_name("rsvd")
    2553                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd")
    2554                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2555                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2556                            .dwattr $C$DW$109, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2557                            .dwattr $C$DW$109, DW_AT_decl_line(0x49)
    2558                            .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    2559                    
    2560                    $C$DW$110       .dwtag  DW_TAG_member
    2561                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    2562                            .dwattr $C$DW$110, DW_AT_name("INTDET")
    2563                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("INTDET")
    2564                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2565                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2566                            .dwattr $C$DW$110, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2567                            .dwattr $C$DW$110, DW_AT_decl_line(0x4a)
    2568                            .dwattr $C$DW$110, DW_AT_decl_column(0x0c)
    2569                    
    2570                    $C$DW$111       .dwtag  DW_TAG_member
    2571                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    2572                            .dwattr $C$DW$111, DW_AT_name("POL")
    2573                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("POL")
    2574                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2575                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2576                            .dwattr $C$DW$111, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2577                            .dwattr $C$DW$111, DW_AT_decl_line(0x4b)
    2578                            .dwattr $C$DW$111, DW_AT_decl_column(0x0c)
    2579                    
    2580                    $C$DW$112       .dwtag  DW_TAG_member
    2581                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    2582                            .dwattr $C$DW$112, DW_AT_name("ENASET")
    2583                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("ENASET")
    2584                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2585                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   48

    2586                            .dwattr $C$DW$112, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2587                            .dwattr $C$DW$112, DW_AT_decl_line(0x4c)
    2588                            .dwattr $C$DW$112, DW_AT_decl_column(0x0c)
    2589                    
    2590                    $C$DW$113       .dwtag  DW_TAG_member
    2591                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    2592                            .dwattr $C$DW$113, DW_AT_name("ENACLR")
    2593                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("ENACLR")
    2594                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2595                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2596                            .dwattr $C$DW$113, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2597                            .dwattr $C$DW$113, DW_AT_decl_line(0x4d)
    2598                            .dwattr $C$DW$113, DW_AT_decl_column(0x0c)
    2599                    
    2600                    $C$DW$114       .dwtag  DW_TAG_member
    2601                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    2602                            .dwattr $C$DW$114, DW_AT_name("LVLSET")
    2603                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("LVLSET")
    2604                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2605                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2606                            .dwattr $C$DW$114, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2607                            .dwattr $C$DW$114, DW_AT_decl_line(0x4e)
    2608                            .dwattr $C$DW$114, DW_AT_decl_column(0x0c)
    2609                    
    2610                    $C$DW$115       .dwtag  DW_TAG_member
    2611                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    2612                            .dwattr $C$DW$115, DW_AT_name("LVLCLR")
    2613                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("LVLCLR")
    2614                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2615                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2616                            .dwattr $C$DW$115, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2617                            .dwattr $C$DW$115, DW_AT_decl_line(0x4f)
    2618                            .dwattr $C$DW$115, DW_AT_decl_column(0x0c)
    2619                    
    2620                    $C$DW$116       .dwtag  DW_TAG_member
    2621                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    2622                            .dwattr $C$DW$116, DW_AT_name("FLG")
    2623                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("FLG")
    2624                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2625                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2626                            .dwattr $C$DW$116, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2627                            .dwattr $C$DW$116, DW_AT_decl_line(0x50)
    2628                            .dwattr $C$DW$116, DW_AT_decl_column(0x0c)
    2629                    
    2630                    $C$DW$117       .dwtag  DW_TAG_member
    2631                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    2632                            .dwattr $C$DW$117, DW_AT_name("OFF1")
    2633                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("OFF1")
    2634                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2635                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2636                            .dwattr $C$DW$117, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2637                            .dwattr $C$DW$117, DW_AT_decl_line(0x51)
    2638                            .dwattr $C$DW$117, DW_AT_decl_column(0x0c)
    2639                    
    2640                    $C$DW$118       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   49

    2641                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    2642                            .dwattr $C$DW$118, DW_AT_name("OFF2")
    2643                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("OFF2")
    2644                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2645                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2646                            .dwattr $C$DW$118, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2647                            .dwattr $C$DW$118, DW_AT_decl_line(0x52)
    2648                            .dwattr $C$DW$118, DW_AT_decl_column(0x0c)
    2649                    
    2650                    $C$DW$119       .dwtag  DW_TAG_member
    2651                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    2652                            .dwattr $C$DW$119, DW_AT_name("EMU1")
    2653                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("EMU1")
    2654                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2655                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2656                            .dwattr $C$DW$119, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2657                            .dwattr $C$DW$119, DW_AT_decl_line(0x53)
    2658                            .dwattr $C$DW$119, DW_AT_decl_column(0x0c)
    2659                    
    2660                    $C$DW$120       .dwtag  DW_TAG_member
    2661                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    2662                            .dwattr $C$DW$120, DW_AT_name("EMU2")
    2663                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("EMU2")
    2664                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2665                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2666                            .dwattr $C$DW$120, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2667                            .dwattr $C$DW$120, DW_AT_decl_line(0x54)
    2668                            .dwattr $C$DW$120, DW_AT_decl_column(0x09)
    2669                    
    2670                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2671                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x46)
    2672                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x19)
    2673                            .dwendtag $C$DW$T$25
    2674                    
    2675                    $C$DW$T$95      .dwtag  DW_TAG_volatile_type
    2676                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$25)
    2677                    
    2678                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2679                            .dwattr $C$DW$T$96, DW_AT_name("gioBASE_t")
    2680                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    2681                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2682                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2683                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x55)
    2684                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x03)
    2685                    
    2686                    
    2687                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2688                            .dwattr $C$DW$T$26, DW_AT_name("gioPort")
    2689                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
    2690                    $C$DW$121       .dwtag  DW_TAG_member
    2691                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    2692                            .dwattr $C$DW$121, DW_AT_name("DIR")
    2693                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("DIR")
    2694                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   50

    2696                            .dwattr $C$DW$121, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2697                            .dwattr $C$DW$121, DW_AT_decl_line(0x62)
    2698                            .dwattr $C$DW$121, DW_AT_decl_column(0x0c)
    2699                    
    2700                    $C$DW$122       .dwtag  DW_TAG_member
    2701                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    2702                            .dwattr $C$DW$122, DW_AT_name("DIN")
    2703                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("DIN")
    2704                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2705                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2706                            .dwattr $C$DW$122, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2707                            .dwattr $C$DW$122, DW_AT_decl_line(0x63)
    2708                            .dwattr $C$DW$122, DW_AT_decl_column(0x0c)
    2709                    
    2710                    $C$DW$123       .dwtag  DW_TAG_member
    2711                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    2712                            .dwattr $C$DW$123, DW_AT_name("DOUT")
    2713                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("DOUT")
    2714                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2715                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2716                            .dwattr $C$DW$123, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2717                            .dwattr $C$DW$123, DW_AT_decl_line(0x64)
    2718                            .dwattr $C$DW$123, DW_AT_decl_column(0x0c)
    2719                    
    2720                    $C$DW$124       .dwtag  DW_TAG_member
    2721                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    2722                            .dwattr $C$DW$124, DW_AT_name("DSET")
    2723                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("DSET")
    2724                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2725                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2726                            .dwattr $C$DW$124, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2727                            .dwattr $C$DW$124, DW_AT_decl_line(0x65)
    2728                            .dwattr $C$DW$124, DW_AT_decl_column(0x0c)
    2729                    
    2730                    $C$DW$125       .dwtag  DW_TAG_member
    2731                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    2732                            .dwattr $C$DW$125, DW_AT_name("DCLR")
    2733                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("DCLR")
    2734                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2735                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2736                            .dwattr $C$DW$125, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2737                            .dwattr $C$DW$125, DW_AT_decl_line(0x66)
    2738                            .dwattr $C$DW$125, DW_AT_decl_column(0x0c)
    2739                    
    2740                    $C$DW$126       .dwtag  DW_TAG_member
    2741                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    2742                            .dwattr $C$DW$126, DW_AT_name("PDR")
    2743                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("PDR")
    2744                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2745                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2746                            .dwattr $C$DW$126, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2747                            .dwattr $C$DW$126, DW_AT_decl_line(0x67)
    2748                            .dwattr $C$DW$126, DW_AT_decl_column(0x0c)
    2749                    
    2750                    $C$DW$127       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   51

    2751                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    2752                            .dwattr $C$DW$127, DW_AT_name("PULDIS")
    2753                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("PULDIS")
    2754                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2755                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2756                            .dwattr $C$DW$127, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2757                            .dwattr $C$DW$127, DW_AT_decl_line(0x68)
    2758                            .dwattr $C$DW$127, DW_AT_decl_column(0x0c)
    2759                    
    2760                    $C$DW$128       .dwtag  DW_TAG_member
    2761                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    2762                            .dwattr $C$DW$128, DW_AT_name("PSL")
    2763                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("PSL")
    2764                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2765                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2766                            .dwattr $C$DW$128, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2767                            .dwattr $C$DW$128, DW_AT_decl_line(0x69)
    2768                            .dwattr $C$DW$128, DW_AT_decl_column(0x0c)
    2769                    
    2770                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2771                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x60)
    2772                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x19)
    2773                            .dwendtag $C$DW$T$26
    2774                    
    2775                    $C$DW$T$97      .dwtag  DW_TAG_volatile_type
    2776                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$26)
    2777                    
    2778                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    2779                            .dwattr $C$DW$T$98, DW_AT_name("gioPORT_t")
    2780                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    2781                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2782                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2783                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x6a)
    2784                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    2785                    
    2786                    
    2787                    $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    2788                            .dwattr $C$DW$T$43, DW_AT_name("loopBackType")
    2789                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2790                    $C$DW$129       .dwtag  DW_TAG_enumerator
    2791                            .dwattr $C$DW$129, DW_AT_name("Digital_Lbk")
    2792                            .dwattr $C$DW$129, DW_AT_const_value(0x00)
    2793                            .dwattr $C$DW$129, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2794                            .dwattr $C$DW$129, DW_AT_decl_line(0x4e)
    2795                            .dwattr $C$DW$129, DW_AT_decl_column(0x05)
    2796                    
    2797                    $C$DW$130       .dwtag  DW_TAG_enumerator
    2798                            .dwattr $C$DW$130, DW_AT_name("Analog_Lbk")
    2799                            .dwattr $C$DW$130, DW_AT_const_value(0x01)
    2800                            .dwattr $C$DW$130, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2801                            .dwattr $C$DW$130, DW_AT_decl_line(0x4f)
    2802                            .dwattr $C$DW$130, DW_AT_decl_column(0x05)
    2803                    
    2804                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2805                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x4c)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   52

    2806                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0e)
    2807                            .dwendtag $C$DW$T$43
    2808                    
    2809                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    2810                            .dwattr $C$DW$T$44, DW_AT_name("loopBackType_t")
    2811                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2812                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2813                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    2814                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x50)
    2815                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x02)
    2816                    
    2817                    
    2818                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2819                            .dwattr $C$DW$T$28, DW_AT_name("sciBase")
    2820                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x94)
    2821                    $C$DW$131       .dwtag  DW_TAG_member
    2822                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    2823                            .dwattr $C$DW$131, DW_AT_name("GCR0")
    2824                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("GCR0")
    2825                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2827                            .dwattr $C$DW$131, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2828                            .dwattr $C$DW$131, DW_AT_decl_line(0x49)
    2829                            .dwattr $C$DW$131, DW_AT_decl_column(0x0c)
    2830                    
    2831                    $C$DW$132       .dwtag  DW_TAG_member
    2832                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    2833                            .dwattr $C$DW$132, DW_AT_name("GCR1")
    2834                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("GCR1")
    2835                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2836                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2837                            .dwattr $C$DW$132, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2838                            .dwattr $C$DW$132, DW_AT_decl_line(0x4a)
    2839                            .dwattr $C$DW$132, DW_AT_decl_column(0x0c)
    2840                    
    2841                    $C$DW$133       .dwtag  DW_TAG_member
    2842                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    2843                            .dwattr $C$DW$133, DW_AT_name("GCR2")
    2844                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("GCR2")
    2845                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2846                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2847                            .dwattr $C$DW$133, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2848                            .dwattr $C$DW$133, DW_AT_decl_line(0x4b)
    2849                            .dwattr $C$DW$133, DW_AT_decl_column(0x0c)
    2850                    
    2851                    $C$DW$134       .dwtag  DW_TAG_member
    2852                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    2853                            .dwattr $C$DW$134, DW_AT_name("SETINT")
    2854                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("SETINT")
    2855                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2856                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2857                            .dwattr $C$DW$134, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2858                            .dwattr $C$DW$134, DW_AT_decl_line(0x4c)
    2859                            .dwattr $C$DW$134, DW_AT_decl_column(0x0c)
    2860                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   53

    2861                    $C$DW$135       .dwtag  DW_TAG_member
    2862                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    2863                            .dwattr $C$DW$135, DW_AT_name("CLEARINT")
    2864                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("CLEARINT")
    2865                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2866                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2867                            .dwattr $C$DW$135, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2868                            .dwattr $C$DW$135, DW_AT_decl_line(0x4d)
    2869                            .dwattr $C$DW$135, DW_AT_decl_column(0x0c)
    2870                    
    2871                    $C$DW$136       .dwtag  DW_TAG_member
    2872                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    2873                            .dwattr $C$DW$136, DW_AT_name("SETINTLVL")
    2874                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("SETINTLVL")
    2875                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2876                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2877                            .dwattr $C$DW$136, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2878                            .dwattr $C$DW$136, DW_AT_decl_line(0x4e)
    2879                            .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    2880                    
    2881                    $C$DW$137       .dwtag  DW_TAG_member
    2882                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    2883                            .dwattr $C$DW$137, DW_AT_name("CLEARINTLVL")
    2884                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("CLEARINTLVL")
    2885                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2886                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2887                            .dwattr $C$DW$137, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2888                            .dwattr $C$DW$137, DW_AT_decl_line(0x4f)
    2889                            .dwattr $C$DW$137, DW_AT_decl_column(0x0c)
    2890                    
    2891                    $C$DW$138       .dwtag  DW_TAG_member
    2892                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    2893                            .dwattr $C$DW$138, DW_AT_name("FLR")
    2894                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("FLR")
    2895                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2896                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2897                            .dwattr $C$DW$138, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2898                            .dwattr $C$DW$138, DW_AT_decl_line(0x50)
    2899                            .dwattr $C$DW$138, DW_AT_decl_column(0x0c)
    2900                    
    2901                    $C$DW$139       .dwtag  DW_TAG_member
    2902                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    2903                            .dwattr $C$DW$139, DW_AT_name("INTVECT0")
    2904                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("INTVECT0")
    2905                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2906                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2907                            .dwattr $C$DW$139, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2908                            .dwattr $C$DW$139, DW_AT_decl_line(0x51)
    2909                            .dwattr $C$DW$139, DW_AT_decl_column(0x0c)
    2910                    
    2911                    $C$DW$140       .dwtag  DW_TAG_member
    2912                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    2913                            .dwattr $C$DW$140, DW_AT_name("INTVECT1")
    2914                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("INTVECT1")
    2915                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   54

    2916                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2917                            .dwattr $C$DW$140, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2918                            .dwattr $C$DW$140, DW_AT_decl_line(0x52)
    2919                            .dwattr $C$DW$140, DW_AT_decl_column(0x0c)
    2920                    
    2921                    $C$DW$141       .dwtag  DW_TAG_member
    2922                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    2923                            .dwattr $C$DW$141, DW_AT_name("FORMAT")
    2924                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("FORMAT")
    2925                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2926                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2927                            .dwattr $C$DW$141, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2928                            .dwattr $C$DW$141, DW_AT_decl_line(0x53)
    2929                            .dwattr $C$DW$141, DW_AT_decl_column(0x0c)
    2930                    
    2931                    $C$DW$142       .dwtag  DW_TAG_member
    2932                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    2933                            .dwattr $C$DW$142, DW_AT_name("BRS")
    2934                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("BRS")
    2935                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2936                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2937                            .dwattr $C$DW$142, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2938                            .dwattr $C$DW$142, DW_AT_decl_line(0x54)
    2939                            .dwattr $C$DW$142, DW_AT_decl_column(0x0c)
    2940                    
    2941                    $C$DW$143       .dwtag  DW_TAG_member
    2942                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    2943                            .dwattr $C$DW$143, DW_AT_name("ED")
    2944                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("ED")
    2945                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2946                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2947                            .dwattr $C$DW$143, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2948                            .dwattr $C$DW$143, DW_AT_decl_line(0x55)
    2949                            .dwattr $C$DW$143, DW_AT_decl_column(0x0c)
    2950                    
    2951                    $C$DW$144       .dwtag  DW_TAG_member
    2952                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    2953                            .dwattr $C$DW$144, DW_AT_name("RD")
    2954                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("RD")
    2955                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2956                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2957                            .dwattr $C$DW$144, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2958                            .dwattr $C$DW$144, DW_AT_decl_line(0x56)
    2959                            .dwattr $C$DW$144, DW_AT_decl_column(0x0c)
    2960                    
    2961                    $C$DW$145       .dwtag  DW_TAG_member
    2962                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    2963                            .dwattr $C$DW$145, DW_AT_name("TD")
    2964                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("TD")
    2965                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2966                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2967                            .dwattr $C$DW$145, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2968                            .dwattr $C$DW$145, DW_AT_decl_line(0x57)
    2969                            .dwattr $C$DW$145, DW_AT_decl_column(0x0c)
    2970                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   55

    2971                    $C$DW$146       .dwtag  DW_TAG_member
    2972                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    2973                            .dwattr $C$DW$146, DW_AT_name("PIO0")
    2974                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("PIO0")
    2975                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2976                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2977                            .dwattr $C$DW$146, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2978                            .dwattr $C$DW$146, DW_AT_decl_line(0x58)
    2979                            .dwattr $C$DW$146, DW_AT_decl_column(0x0c)
    2980                    
    2981                    $C$DW$147       .dwtag  DW_TAG_member
    2982                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    2983                            .dwattr $C$DW$147, DW_AT_name("PIO1")
    2984                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("PIO1")
    2985                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2986                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2987                            .dwattr $C$DW$147, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2988                            .dwattr $C$DW$147, DW_AT_decl_line(0x59)
    2989                            .dwattr $C$DW$147, DW_AT_decl_column(0x0c)
    2990                    
    2991                    $C$DW$148       .dwtag  DW_TAG_member
    2992                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    2993                            .dwattr $C$DW$148, DW_AT_name("PIO2")
    2994                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("PIO2")
    2995                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2996                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2997                            .dwattr $C$DW$148, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    2998                            .dwattr $C$DW$148, DW_AT_decl_line(0x5a)
    2999                            .dwattr $C$DW$148, DW_AT_decl_column(0x0c)
    3000                    
    3001                    $C$DW$149       .dwtag  DW_TAG_member
    3002                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    3003                            .dwattr $C$DW$149, DW_AT_name("PIO3")
    3004                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("PIO3")
    3005                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3006                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3007                            .dwattr $C$DW$149, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3008                            .dwattr $C$DW$149, DW_AT_decl_line(0x5b)
    3009                            .dwattr $C$DW$149, DW_AT_decl_column(0x0c)
    3010                    
    3011                    $C$DW$150       .dwtag  DW_TAG_member
    3012                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    3013                            .dwattr $C$DW$150, DW_AT_name("PIO4")
    3014                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("PIO4")
    3015                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3016                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3017                            .dwattr $C$DW$150, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3018                            .dwattr $C$DW$150, DW_AT_decl_line(0x5c)
    3019                            .dwattr $C$DW$150, DW_AT_decl_column(0x0c)
    3020                    
    3021                    $C$DW$151       .dwtag  DW_TAG_member
    3022                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    3023                            .dwattr $C$DW$151, DW_AT_name("PIO5")
    3024                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("PIO5")
    3025                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   56

    3026                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3027                            .dwattr $C$DW$151, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3028                            .dwattr $C$DW$151, DW_AT_decl_line(0x5d)
    3029                            .dwattr $C$DW$151, DW_AT_decl_column(0x0c)
    3030                    
    3031                    $C$DW$152       .dwtag  DW_TAG_member
    3032                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    3033                            .dwattr $C$DW$152, DW_AT_name("PIO6")
    3034                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("PIO6")
    3035                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3036                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3037                            .dwattr $C$DW$152, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3038                            .dwattr $C$DW$152, DW_AT_decl_line(0x5e)
    3039                            .dwattr $C$DW$152, DW_AT_decl_column(0x0c)
    3040                    
    3041                    $C$DW$153       .dwtag  DW_TAG_member
    3042                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    3043                            .dwattr $C$DW$153, DW_AT_name("PIO7")
    3044                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("PIO7")
    3045                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3046                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3047                            .dwattr $C$DW$153, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3048                            .dwattr $C$DW$153, DW_AT_decl_line(0x5f)
    3049                            .dwattr $C$DW$153, DW_AT_decl_column(0x0c)
    3050                    
    3051                    $C$DW$154       .dwtag  DW_TAG_member
    3052                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    3053                            .dwattr $C$DW$154, DW_AT_name("PIO8")
    3054                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("PIO8")
    3055                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3056                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3057                            .dwattr $C$DW$154, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3058                            .dwattr $C$DW$154, DW_AT_decl_line(0x60)
    3059                            .dwattr $C$DW$154, DW_AT_decl_column(0x0c)
    3060                    
    3061                    $C$DW$155       .dwtag  DW_TAG_member
    3062                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    3063                            .dwattr $C$DW$155, DW_AT_name("rsdv2")
    3064                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("rsdv2")
    3065                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3066                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3067                            .dwattr $C$DW$155, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3068                            .dwattr $C$DW$155, DW_AT_decl_line(0x61)
    3069                            .dwattr $C$DW$155, DW_AT_decl_column(0x0c)
    3070                    
    3071                    $C$DW$156       .dwtag  DW_TAG_member
    3072                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    3073                            .dwattr $C$DW$156, DW_AT_name("IODFTCTRL")
    3074                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("IODFTCTRL")
    3075                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3076                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3077                            .dwattr $C$DW$156, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3078                            .dwattr $C$DW$156, DW_AT_decl_line(0x62)
    3079                            .dwattr $C$DW$156, DW_AT_decl_column(0x0c)
    3080                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   57

    3081                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3082                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x47)
    3083                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x19)
    3084                            .dwendtag $C$DW$T$28
    3085                    
    3086                    $C$DW$T$37      .dwtag  DW_TAG_volatile_type
    3087                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$28)
    3088                    
    3089                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    3090                            .dwattr $C$DW$T$38, DW_AT_name("sciBASE_t")
    3091                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3092                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3093                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\
    3094                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x63)
    3095                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    3096                    
    3097                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    3098                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3099                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    3100                    
    3101                    
    3102                    $C$DW$T$99      .dwtag  DW_TAG_enumeration_type
    3103                            .dwattr $C$DW$T$99, DW_AT_name("sciIntFlags")
    3104                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x04)
    3105                    $C$DW$157       .dwtag  DW_TAG_enumerator
    3106                            .dwattr $C$DW$157, DW_AT_name("SCI_FE_INT")
    3107                            .dwattr $C$DW$157, DW_AT_const_value(0x4000000)
    3108                            .dwattr $C$DW$157, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3109                            .dwattr $C$DW$157, DW_AT_decl_line(0x3f)
    3110                            .dwattr $C$DW$157, DW_AT_decl_column(0x05)
    3111                    
    3112                    $C$DW$158       .dwtag  DW_TAG_enumerator
    3113                            .dwattr $C$DW$158, DW_AT_name("SCI_OE_INT")
    3114                            .dwattr $C$DW$158, DW_AT_const_value(0x2000000)
    3115                            .dwattr $C$DW$158, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3116                            .dwattr $C$DW$158, DW_AT_decl_line(0x40)
    3117                            .dwattr $C$DW$158, DW_AT_decl_column(0x05)
    3118                    
    3119                    $C$DW$159       .dwtag  DW_TAG_enumerator
    3120                            .dwattr $C$DW$159, DW_AT_name("SCI_PE_INT")
    3121                            .dwattr $C$DW$159, DW_AT_const_value(0x1000000)
    3122                            .dwattr $C$DW$159, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3123                            .dwattr $C$DW$159, DW_AT_decl_line(0x41)
    3124                            .dwattr $C$DW$159, DW_AT_decl_column(0x05)
    3125                    
    3126                    $C$DW$160       .dwtag  DW_TAG_enumerator
    3127                            .dwattr $C$DW$160, DW_AT_name("SCI_RX_INT")
    3128                            .dwattr $C$DW$160, DW_AT_const_value(0x200)
    3129                            .dwattr $C$DW$160, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3130                            .dwattr $C$DW$160, DW_AT_decl_line(0x42)
    3131                            .dwattr $C$DW$160, DW_AT_decl_column(0x05)
    3132                    
    3133                    $C$DW$161       .dwtag  DW_TAG_enumerator
    3134                            .dwattr $C$DW$161, DW_AT_name("SCI_TX_INT")
    3135                            .dwattr $C$DW$161, DW_AT_const_value(0x100)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   58

    3136                            .dwattr $C$DW$161, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3137                            .dwattr $C$DW$161, DW_AT_decl_line(0x43)
    3138                            .dwattr $C$DW$161, DW_AT_decl_column(0x05)
    3139                    
    3140                    $C$DW$162       .dwtag  DW_TAG_enumerator
    3141                            .dwattr $C$DW$162, DW_AT_name("SCI_WAKE_INT")
    3142                            .dwattr $C$DW$162, DW_AT_const_value(0x02)
    3143                            .dwattr $C$DW$162, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3144                            .dwattr $C$DW$162, DW_AT_decl_line(0x44)
    3145                            .dwattr $C$DW$162, DW_AT_decl_column(0x05)
    3146                    
    3147                    $C$DW$163       .dwtag  DW_TAG_enumerator
    3148                            .dwattr $C$DW$163, DW_AT_name("SCI_BREAK_INT")
    3149                            .dwattr $C$DW$163, DW_AT_const_value(0x01)
    3150                            .dwattr $C$DW$163, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3151                            .dwattr $C$DW$163, DW_AT_decl_line(0x45)
    3152                            .dwattr $C$DW$163, DW_AT_decl_column(0x05)
    3153                    
    3154                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3155                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x3d)
    3156                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x06)
    3157                            .dwendtag $C$DW$T$99
    3158                    
    3159                    
    3160                    $C$DW$T$100     .dwtag  DW_TAG_enumeration_type
    3161                            .dwattr $C$DW$T$100, DW_AT_name("sciPinSelect")
    3162                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
    3163                    $C$DW$164       .dwtag  DW_TAG_enumerator
    3164                            .dwattr $C$DW$164, DW_AT_name("PIN_SCI_TX")
    3165                            .dwattr $C$DW$164, DW_AT_const_value(0x04)
    3166                            .dwattr $C$DW$164, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3167                            .dwattr $C$DW$164, DW_AT_decl_line(0x5d)
    3168                            .dwattr $C$DW$164, DW_AT_decl_column(0x05)
    3169                    
    3170                    $C$DW$165       .dwtag  DW_TAG_enumerator
    3171                            .dwattr $C$DW$165, DW_AT_name("PIN_SCI_RX")
    3172                            .dwattr $C$DW$165, DW_AT_const_value(0x02)
    3173                            .dwattr $C$DW$165, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3174                            .dwattr $C$DW$165, DW_AT_decl_line(0x5e)
    3175                            .dwattr $C$DW$165, DW_AT_decl_column(0x05)
    3176                    
    3177                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3178                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x5b)
    3179                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x06)
    3180                            .dwendtag $C$DW$T$100
    3181                    
    3182                    
    3183                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3184                            .dwattr $C$DW$T$29, DW_AT_name("sci_config_reg")
    3185                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x2c)
    3186                    $C$DW$166       .dwtag  DW_TAG_member
    3187                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    3188                            .dwattr $C$DW$166, DW_AT_name("CONFIG_GCR0")
    3189                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("CONFIG_GCR0")
    3190                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   59

    3191                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3192                            .dwattr $C$DW$166, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3193                            .dwattr $C$DW$166, DW_AT_decl_line(0x65)
    3194                            .dwattr $C$DW$166, DW_AT_decl_column(0x0c)
    3195                    
    3196                    $C$DW$167       .dwtag  DW_TAG_member
    3197                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    3198                            .dwattr $C$DW$167, DW_AT_name("CONFIG_GCR1")
    3199                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("CONFIG_GCR1")
    3200                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3201                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3202                            .dwattr $C$DW$167, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3203                            .dwattr $C$DW$167, DW_AT_decl_line(0x66)
    3204                            .dwattr $C$DW$167, DW_AT_decl_column(0x0c)
    3205                    
    3206                    $C$DW$168       .dwtag  DW_TAG_member
    3207                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    3208                            .dwattr $C$DW$168, DW_AT_name("CONFIG_SETINT")
    3209                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("CONFIG_SETINT")
    3210                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3211                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3212                            .dwattr $C$DW$168, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3213                            .dwattr $C$DW$168, DW_AT_decl_line(0x67)
    3214                            .dwattr $C$DW$168, DW_AT_decl_column(0x0c)
    3215                    
    3216                    $C$DW$169       .dwtag  DW_TAG_member
    3217                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    3218                            .dwattr $C$DW$169, DW_AT_name("CONFIG_SETINTLVL")
    3219                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("CONFIG_SETINTLVL")
    3220                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3221                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3222                            .dwattr $C$DW$169, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3223                            .dwattr $C$DW$169, DW_AT_decl_line(0x68)
    3224                            .dwattr $C$DW$169, DW_AT_decl_column(0x0c)
    3225                    
    3226                    $C$DW$170       .dwtag  DW_TAG_member
    3227                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    3228                            .dwattr $C$DW$170, DW_AT_name("CONFIG_FORMAT")
    3229                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("CONFIG_FORMAT")
    3230                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3231                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3232                            .dwattr $C$DW$170, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3233                            .dwattr $C$DW$170, DW_AT_decl_line(0x69)
    3234                            .dwattr $C$DW$170, DW_AT_decl_column(0x0c)
    3235                    
    3236                    $C$DW$171       .dwtag  DW_TAG_member
    3237                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    3238                            .dwattr $C$DW$171, DW_AT_name("CONFIG_BRS")
    3239                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("CONFIG_BRS")
    3240                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3241                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3242                            .dwattr $C$DW$171, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3243                            .dwattr $C$DW$171, DW_AT_decl_line(0x6a)
    3244                            .dwattr $C$DW$171, DW_AT_decl_column(0x0c)
    3245                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   60

    3246                    $C$DW$172       .dwtag  DW_TAG_member
    3247                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    3248                            .dwattr $C$DW$172, DW_AT_name("CONFIG_PIO0")
    3249                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("CONFIG_PIO0")
    3250                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3251                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3252                            .dwattr $C$DW$172, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3253                            .dwattr $C$DW$172, DW_AT_decl_line(0x6b)
    3254                            .dwattr $C$DW$172, DW_AT_decl_column(0x0c)
    3255                    
    3256                    $C$DW$173       .dwtag  DW_TAG_member
    3257                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    3258                            .dwattr $C$DW$173, DW_AT_name("CONFIG_PIO1")
    3259                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("CONFIG_PIO1")
    3260                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3261                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3262                            .dwattr $C$DW$173, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3263                            .dwattr $C$DW$173, DW_AT_decl_line(0x6c)
    3264                            .dwattr $C$DW$173, DW_AT_decl_column(0x0c)
    3265                    
    3266                    $C$DW$174       .dwtag  DW_TAG_member
    3267                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    3268                            .dwattr $C$DW$174, DW_AT_name("CONFIG_PIO6")
    3269                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("CONFIG_PIO6")
    3270                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3271                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3272                            .dwattr $C$DW$174, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3273                            .dwattr $C$DW$174, DW_AT_decl_line(0x6d)
    3274                            .dwattr $C$DW$174, DW_AT_decl_column(0x0c)
    3275                    
    3276                    $C$DW$175       .dwtag  DW_TAG_member
    3277                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    3278                            .dwattr $C$DW$175, DW_AT_name("CONFIG_PIO7")
    3279                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("CONFIG_PIO7")
    3280                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3281                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3282                            .dwattr $C$DW$175, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3283                            .dwattr $C$DW$175, DW_AT_decl_line(0x6e)
    3284                            .dwattr $C$DW$175, DW_AT_decl_column(0x0c)
    3285                    
    3286                    $C$DW$176       .dwtag  DW_TAG_member
    3287                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    3288                            .dwattr $C$DW$176, DW_AT_name("CONFIG_PIO8")
    3289                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("CONFIG_PIO8")
    3290                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3291                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3292                            .dwattr $C$DW$176, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3293                            .dwattr $C$DW$176, DW_AT_decl_line(0x6f)
    3294                            .dwattr $C$DW$176, DW_AT_decl_column(0x09)
    3295                    
    3296                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3297                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x63)
    3298                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3299                            .dwendtag $C$DW$T$29
    3300                    
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   61

    3301                    $C$DW$T$47      .dwtag  DW_TAG_typedef
    3302                            .dwattr $C$DW$T$47, DW_AT_name("sci_config_reg_t")
    3303                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$29)
    3304                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3305                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/
    3306                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x70)
    3307                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    3308                    
    3309                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    3310                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3311                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    3312                    
    3313                    
    3314                    $C$DW$T$101     .dwtag  DW_TAG_enumeration_type
    3315                            .dwattr $C$DW$T$101, DW_AT_name("systemInterrupt")
    3316                            .dwattr $C$DW$T$101, DW_AT_byte_size(0x01)
    3317                    $C$DW$177       .dwtag  DW_TAG_enumerator
    3318                            .dwattr $C$DW$177, DW_AT_name("SYS_IRQ")
    3319                            .dwattr $C$DW$177, DW_AT_const_value(0x00)
    3320                            .dwattr $C$DW$177, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3321                            .dwattr $C$DW$177, DW_AT_decl_line(0x4b)
    3322                            .dwattr $C$DW$177, DW_AT_decl_column(0x05)
    3323                    
    3324                    $C$DW$178       .dwtag  DW_TAG_enumerator
    3325                            .dwattr $C$DW$178, DW_AT_name("SYS_FIQ")
    3326                            .dwattr $C$DW$178, DW_AT_const_value(0x01)
    3327                            .dwattr $C$DW$178, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test/P
    3328                            .dwattr $C$DW$178, DW_AT_decl_line(0x4c)
    3329                            .dwattr $C$DW$178, DW_AT_decl_column(0x05)
    3330                    
    3331                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3332                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x49)
    3333                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x0e)
    3334                            .dwendtag $C$DW$T$101
    3335                    
    3336                    $C$DW$T$102     .dwtag  DW_TAG_typedef
    3337                            .dwattr $C$DW$T$102, DW_AT_name("systemInterrupt_t")
    3338                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    3339                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    3340                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/Users/bob/Documents/Projects/induct_forge/RM57Lx_test
    3341                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x4d)
    3342                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x02)
    3343                    
    3344                    
    3345                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3346                            .dwattr $C$DW$T$32, DW_AT_name("vimBase")
    3347                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x1e0)
    3348                    $C$DW$179       .dwtag  DW_TAG_member
    3349                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$30)
    3350                            .dwattr $C$DW$179, DW_AT_name("rsvd1")
    3351                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("rsvd1")
    3352                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3353                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3354                            .dwattr $C$DW$179, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3355                            .dwattr $C$DW$179, DW_AT_decl_line(0x45)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   62

    3356                            .dwattr $C$DW$179, DW_AT_decl_column(0x11)
    3357                    
    3358                    $C$DW$180       .dwtag  DW_TAG_member
    3359                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    3360                            .dwattr $C$DW$180, DW_AT_name("ECCSTAT")
    3361                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("ECCSTAT")
    3362                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3363                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3364                            .dwattr $C$DW$180, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3365                            .dwattr $C$DW$180, DW_AT_decl_line(0x46)
    3366                            .dwattr $C$DW$180, DW_AT_decl_column(0x11)
    3367                    
    3368                    $C$DW$181       .dwtag  DW_TAG_member
    3369                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    3370                            .dwattr $C$DW$181, DW_AT_name("ECCCTL")
    3371                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("ECCCTL")
    3372                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3373                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3374                            .dwattr $C$DW$181, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3375                            .dwattr $C$DW$181, DW_AT_decl_line(0x47)
    3376                            .dwattr $C$DW$181, DW_AT_decl_column(0x11)
    3377                    
    3378                    $C$DW$182       .dwtag  DW_TAG_member
    3379                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    3380                            .dwattr $C$DW$182, DW_AT_name("UERRADDR")
    3381                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("UERRADDR")
    3382                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3383                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3384                            .dwattr $C$DW$182, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3385                            .dwattr $C$DW$182, DW_AT_decl_line(0x48)
    3386                            .dwattr $C$DW$182, DW_AT_decl_column(0x11)
    3387                    
    3388                    $C$DW$183       .dwtag  DW_TAG_member
    3389                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    3390                            .dwattr $C$DW$183, DW_AT_name("FBVECADDR")
    3391                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("FBVECADDR")
    3392                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    3393                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3394                            .dwattr $C$DW$183, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3395                            .dwattr $C$DW$183, DW_AT_decl_line(0x49)
    3396                            .dwattr $C$DW$183, DW_AT_decl_column(0x11)
    3397                    
    3398                    $C$DW$184       .dwtag  DW_TAG_member
    3399                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    3400                            .dwattr $C$DW$184, DW_AT_name("SBERRADDR")
    3401                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("SBERRADDR")
    3402                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    3403                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3404                            .dwattr $C$DW$184, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3405                            .dwattr $C$DW$184, DW_AT_decl_line(0x4a)
    3406                            .dwattr $C$DW$184, DW_AT_decl_column(0x11)
    3407                    
    3408                    $C$DW$185       .dwtag  DW_TAG_member
    3409                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    3410                            .dwattr $C$DW$185, DW_AT_name("IRQINDEX")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   63

    3411                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("IRQINDEX")
    3412                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3413                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3414                            .dwattr $C$DW$185, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3415                            .dwattr $C$DW$185, DW_AT_decl_line(0x4b)
    3416                            .dwattr $C$DW$185, DW_AT_decl_column(0x11)
    3417                    
    3418                    $C$DW$186       .dwtag  DW_TAG_member
    3419                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    3420                            .dwattr $C$DW$186, DW_AT_name("FIQINDEX")
    3421                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("FIQINDEX")
    3422                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3423                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3424                            .dwattr $C$DW$186, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3425                            .dwattr $C$DW$186, DW_AT_decl_line(0x4c)
    3426                            .dwattr $C$DW$186, DW_AT_decl_column(0x11)
    3427                    
    3428                    $C$DW$187       .dwtag  DW_TAG_member
    3429                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    3430                            .dwattr $C$DW$187, DW_AT_name("rsvd2")
    3431                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("rsvd2")
    3432                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    3433                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3434                            .dwattr $C$DW$187, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3435                            .dwattr $C$DW$187, DW_AT_decl_line(0x4d)
    3436                            .dwattr $C$DW$187, DW_AT_decl_column(0x11)
    3437                    
    3438                    $C$DW$188       .dwtag  DW_TAG_member
    3439                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    3440                            .dwattr $C$DW$188, DW_AT_name("rsvd3")
    3441                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("rsvd3")
    3442                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    3443                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3444                            .dwattr $C$DW$188, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3445                            .dwattr $C$DW$188, DW_AT_decl_line(0x4e)
    3446                            .dwattr $C$DW$188, DW_AT_decl_column(0x11)
    3447                    
    3448                    $C$DW$189       .dwtag  DW_TAG_member
    3449                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    3450                            .dwattr $C$DW$189, DW_AT_name("FIRQPR0")
    3451                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("FIRQPR0")
    3452                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    3453                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3454                            .dwattr $C$DW$189, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3455                            .dwattr $C$DW$189, DW_AT_decl_line(0x4f)
    3456                            .dwattr $C$DW$189, DW_AT_decl_column(0x11)
    3457                    
    3458                    $C$DW$190       .dwtag  DW_TAG_member
    3459                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    3460                            .dwattr $C$DW$190, DW_AT_name("FIRQPR1")
    3461                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("FIRQPR1")
    3462                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    3463                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3464                            .dwattr $C$DW$190, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3465                            .dwattr $C$DW$190, DW_AT_decl_line(0x50)
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   64

    3466                            .dwattr $C$DW$190, DW_AT_decl_column(0x11)
    3467                    
    3468                    $C$DW$191       .dwtag  DW_TAG_member
    3469                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    3470                            .dwattr $C$DW$191, DW_AT_name("FIRQPR2")
    3471                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("FIRQPR2")
    3472                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    3473                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3474                            .dwattr $C$DW$191, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3475                            .dwattr $C$DW$191, DW_AT_decl_line(0x51)
    3476                            .dwattr $C$DW$191, DW_AT_decl_column(0x11)
    3477                    
    3478                    $C$DW$192       .dwtag  DW_TAG_member
    3479                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    3480                            .dwattr $C$DW$192, DW_AT_name("FIRQPR3")
    3481                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("FIRQPR3")
    3482                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    3483                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3484                            .dwattr $C$DW$192, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3485                            .dwattr $C$DW$192, DW_AT_decl_line(0x52)
    3486                            .dwattr $C$DW$192, DW_AT_decl_column(0x11)
    3487                    
    3488                    $C$DW$193       .dwtag  DW_TAG_member
    3489                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    3490                            .dwattr $C$DW$193, DW_AT_name("INTREQ0")
    3491                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("INTREQ0")
    3492                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3493                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3494                            .dwattr $C$DW$193, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3495                            .dwattr $C$DW$193, DW_AT_decl_line(0x53)
    3496                            .dwattr $C$DW$193, DW_AT_decl_column(0x11)
    3497                    
    3498                    $C$DW$194       .dwtag  DW_TAG_member
    3499                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    3500                            .dwattr $C$DW$194, DW_AT_name("INTREQ1")
    3501                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("INTREQ1")
    3502                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    3503                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3504                            .dwattr $C$DW$194, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3505                            .dwattr $C$DW$194, DW_AT_decl_line(0x54)
    3506                            .dwattr $C$DW$194, DW_AT_decl_column(0x11)
    3507                    
    3508                    $C$DW$195       .dwtag  DW_TAG_member
    3509                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    3510                            .dwattr $C$DW$195, DW_AT_name("INTREQ2")
    3511                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("INTREQ2")
    3512                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    3513                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3514                            .dwattr $C$DW$195, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3515                            .dwattr $C$DW$195, DW_AT_decl_line(0x55)
    3516                            .dwattr $C$DW$195, DW_AT_decl_column(0x11)
    3517                    
    3518                    $C$DW$196       .dwtag  DW_TAG_member
    3519                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    3520                            .dwattr $C$DW$196, DW_AT_name("INTREQ3")
TI ARM Assembler PC v16.9.0 Thu Feb 16 13:27:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bob\AppData\Local\Temp\1392010                              PAGE   65

    3521                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("INTREQ3")
    3522                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    3523                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3524                            .dwattr $C$DW$196, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3525                            .dwattr $C$DW$196, DW_AT_decl_line(0x56)
    3526                            .dwattr $C$DW$196, DW_AT_decl_column(0x11)
    3527                    
    3528                    $C$DW$197       .dwtag  DW_TAG_member
    3529                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$20)
    3530                            .dwattr $C$DW$197, DW_AT_name("REQMASKSET0")
    3531                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("REQMASKSET0")
    3532                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    3533                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3534                            .dwattr $C$DW$197, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3535                            .dwattr $C$DW$197, DW_AT_decl_line(0x57)
    3536                            .dwattr $C$DW$197, DW_AT_decl_column(0x11)
    3537                    
    3538                    $C$DW$198       .dwtag  DW_TAG_member
    3539                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    3540                            .dwattr $C$DW$198, DW_AT_name("REQMASKSET1")
    3541                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("REQMASKSET1")
    3542                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    3543                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3544                            .dwattr $C$DW$198, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3545                            .dwattr $C$DW$198, DW_AT_decl_line(0x58)
    3546                            .dwattr $C$DW$198, DW_AT_decl_column(0x11)
    3547                    
    3548                    $C$DW$199       .dwtag  DW_TAG_member
    3549                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    3550                            .dwattr $C$DW$199, DW_AT_name("REQMASKSET2")
    3551                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("REQMASKSET2")
    3552                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    3553                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3554                            .dwattr $C$DW$199, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3555                            .dwattr $C$DW$199, DW_AT_decl_line(0x59)
    3556                            .dwattr $C$DW$199, DW_AT_decl_column(0x11)
    3557                    
    3558                    $C$DW$200       .dwtag  DW_TAG_member
    3559                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    3560                            .dwattr $C$DW$200, DW_AT_name("REQMASKSET3")
    3561                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("REQMASKSET3")
    3562                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    3563                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3564                            .dwattr $C$DW$200, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
    3565                            .dwattr $C$DW$200, DW_AT_decl_line(0x5a)
    3566                            .dwattr $C$DW$200, DW_AT_decl_column(0x11)
    3567                    
    3568                    $C$DW$201       .dwtag  DW_TAG_member
    3569                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    3570                            .dwattr $C$DW$201, DW_AT_name("REQMASKCLR0")
    3571                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("REQMASKCLR0")
    3572                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    3573                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3574                            .dwattr $C$DW$201, DW_AT_decl_file("C:\Users\bob\Documents\Projects\induct_forge\RM57Lx_test\P
